{
  "file_name": "021_Lesson_21.faudio-hi-0-Default.mp4",
  "text": " Okay, so one of the most important questions that you might be having is should I learn to code or should I just hire a developer to build the app for me? Now this has been asked over it over because people have to say distribution is everything and what I do like kind of strongly approve of that. I still fundamentally believe that being technical yourself is one of the highest leverage things you can do to be successful in this space. And you know, Zach, Blake and I are all proof that we kind of stick to that. Like we all built our products ourselves. And I think for the same kind of reason, like you can't outsource greatness. Products have to be good to be successful, especially long term. Okay, short short term, you can make some money. But long term is important to get the product right. And to kind of be a little bit of a perfectionist, I will say. Developers also extremely expensive. Like even the cheapest bond with the barrel like Brazilian dabs are around like six K a month. And they take super long to build products. And they don't even know what they're doing half the time. Like you usually pay for quality. And unless you've got like 10, 15 K a month to hire a solid CTO and a product guy, I'd usually just recommend learning yourself. And like I can give my viewpoint on how, so I can give my perspective on how I learn. I watched this tutorial around two, three years ago on rebuilding Twitter from scratch. It's linked right here. It's about seven hours long. And it seems like a long time. But if I learned all of my coding skills and I built quitter from scratch from this tutorial and I've quittered it's doing half a million a month. And trading seven hours of focus and of your time in your life. For the opportunity to build a super successful app, I think that's an amazing exchange of time to wealth ever. Also, like if you do decide to hire out understanding fundamentals saves money and time. But I generally wouldn't recommend this for most people. Even if your first cop laps suck, it's important to be able to code yourself. I would also say like I feel like a lot of people watching this tutorial probably don't have cash, which is one of the reasons I built and learned to code myself. So yeah, that's my take.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 8.0,
      "text": "Okay, so one of the most important questions that you might be having is should I learn to code or should I just hire a developer to build the app for me?"
    },
    {
      "start": 8.0,
      "end": 15.0,
      "text": "Now this has been asked over it over because people have to say distribution is everything and what I do like kind of strongly approve of that."
    },
    {
      "start": 15.0,
      "end": 22.0,
      "text": "I still fundamentally believe that being technical yourself is one of the highest leverage things you can do to be successful in this space."
    },
    {
      "start": 22.0,
      "end": 29.0,
      "text": "And you know, Zach, Blake and I are all proof that we kind of stick to that. Like we all built our products ourselves."
    },
    {
      "start": 29.0,
      "end": 33.0,
      "text": "And I think for the same kind of reason, like you can't outsource greatness."
    },
    {
      "start": 33.0,
      "end": 39.0,
      "text": "Products have to be good to be successful, especially long term. Okay, short short term, you can make some money."
    },
    {
      "start": 39.0,
      "end": 46.0,
      "text": "But long term is important to get the product right. And to kind of be a little bit of a perfectionist, I will say."
    },
    {
      "start": 46.0,
      "end": 53.0,
      "text": "Developers also extremely expensive. Like even the cheapest bond with the barrel like Brazilian dabs are around like six K a month."
    },
    {
      "start": 53.0,
      "end": 58.0,
      "text": "And they take super long to build products. And they don't even know what they're doing half the time."
    },
    {
      "start": 58.0,
      "end": 69.0,
      "text": "Like you usually pay for quality. And unless you've got like 10, 15 K a month to hire a solid CTO and a product guy, I'd usually just recommend learning yourself."
    },
    {
      "start": 70.0,
      "end": 76.0,
      "text": "And like I can give my viewpoint on how, so I can give my perspective on how I learn."
    },
    {
      "start": 76.0,
      "end": 83.0,
      "text": "I watched this tutorial around two, three years ago on rebuilding Twitter from scratch. It's linked right here. It's about seven hours long."
    },
    {
      "start": 83.0,
      "end": 93.0,
      "text": "And it seems like a long time. But if I learned all of my coding skills and I built quitter from scratch from this tutorial and I've quittered it's doing half a million a month."
    },
    {
      "start": 93.0,
      "end": 106.0,
      "text": "And trading seven hours of focus and of your time in your life. For the opportunity to build a super successful app, I think that's an amazing exchange of time to wealth ever."
    },
    {
      "start": 106.0,
      "end": 116.0,
      "text": "Also, like if you do decide to hire out understanding fundamentals saves money and time. But I generally wouldn't recommend this for most people."
    },
    {
      "start": 116.0,
      "end": 124.0,
      "text": "Even if your first cop laps suck, it's important to be able to code yourself."
    },
    {
      "start": 124.0,
      "end": 133.0,
      "text": "I would also say like I feel like a lot of people watching this tutorial probably don't have cash, which is one of the reasons I built and learned to code myself."
    },
    {
      "start": 133.0,
      "end": 136.0,
      "text": "So yeah, that's my take."
    }
  ]
}