{
  "file_name": "022_Lesson_22.faudio-hi-0-Default.mp4",
  "text": " Okay, so there are two ways to hire a developer. The first option is to work with someone for equity and under the agreement that, okay, we both put in equal effort and we get equal outcomes and you run product, I run marketing, et cetera, et cetera. This is a pretty easy to do with SlaserCord, which is my personal Discord server, and I will recommend this just because I follow everyone that watches my YouTube channel to my Discord. So there's a lot of app guys in there and I'll show you it right now. Like, this is the finder co-founder chat that I recommend typing in. So as you can see, I'm looking for a marketing co-founder, 70 foot, split, whatever. Like, you kind of see it as a lot of engagement, a lot of traffic. So it's worth a, we have a chance, and you can say something like this, looking for a dad to go 50, 50 on an app with, I'll be a marketing killer. I build the app market course and I'm extremely focused on being successful with this. I have a ton of ideas and I'm ready to go all in, DM me on this jump on a call. So for example, you can copy this message, go into my Discord, post it, and you will at least get a few replies. But you might have to hustle and post a few different times and try and find someone. But we have 1,100 people in here. Everyone is super motivated and apt and I'm sure you can find one single individual that's also technical and that would love to what could be. And I would mention you bought the course because that is a really positive sign that you're putting your money up front because you want to invest in yourself like it's a massive green flag. And then here linked right here is a vested equity to protect yourself. Something that I've learned and I've learned too late and as so of a bunch of my friends, like you can blatantly learn too late, we brought people on for equity that a long term didn't provide any value and it fucked us all. So now there are like lawsuits, there's complications and it's not worth that headache. So setting up a vested equity agreement is very important. I don't know too much about it, but I just know it's really important so I would recommend going to this link and figuring out a good structure for both of you. A little personal note as well is when I started Quitter for the first time with Connor, I built all the app and we tried to work out an equity agreement or he tried to work out an equity agreement, but I was like fuck that. I don't want to agree to any sort of equity until we kind of both prove ourselves to each other. Like for example, I built the app, he was running marketing, but he couldn't run marketing until I built the app. So I put an all the upfront effort so like him taking 50% of my effort before he had done anything himself didn't make sense to me. So I said, look, let's get to like 100K revenue which sounds ridiculous before we discuss equity. And that was like a trust between both of us and you know we got to 100K revenue and then we sorted it out of the air-wizy part. And yeah, now the reason we did that is because it's important to not get trapped like a lot of co-founders change off the money, like things get really complicated. So it's important to have that level of trust and prove yourself to each other. So here are some things to look for in a founding equity-based engineer. They should be clearly competent, they should be extremely smart. They match their intensity and objectives. Like they're not just sitting around waiting or they're like unbulbored or they're not really motivated. You don't want someone like that. You don't want to hand hold someone. You want someone that's like, okay, I'm gonna fucking co this in a week and then you're gonna like you as the mocked are gonna be like, okay, I'm gonna do this strategy for Reddit. I'm gonna do this, this, this. And like you're both matching each other's intensity. That reduces the friction and the struggle. Whereas like if someone else, like if they are for example pulling the way and you're not, you know, like it's not gonna be successful long term. They should also be willing to sacrifice time and money for an unproven product. They should kind of know what they're getting into. You know, you should explain or emphasize that. It's gonna be long and hard for a long time while that depends on how successful your marketing is. But usually in most cases, it's long and hard and there's no results. And then you get like one result and then it gets to 10 and then born like you've got a booming business. But like there is a big gap of time between that could be months, like several, several months. So just make sure you both understand that. So there is like, to emphasize again, there is opportunity cost as a good developer to waste your time on a project that it's uncertain and he's not getting money from. So, and then on that note, it's better to find an engineer that's younger rather than older because if they're older, they have financial responsibilities like paying for rent or maybe providing for the kids or whatever. So they will be less inclined to work on an unproven product rather than someone that's young and hungry that's in school that doesn't need to be earning money, right? Woo, wow. They should also have high agency and like if they fuck up, they admit they fucked up and like they make the right steps to correct that fuck up and don't just blame other people, blame me or whatever. You should also vibe with them. You should just be generally friends. Another bonus benefit is like, if you've had the same goals as someone you work with, like me and Clonamie Co. Fanar and Quitter, we have the same goals, we want the same things. This is really easy to vibe with and like understand each other. Whereas like, for example, like maybe someone's super materialistic but someone isn't and then like, yeah, then the objectives or goals or whatever are misaligned and you know, that causes friction. So it's not that complex to be honest. And I want to emphasize, like you don't want to just, if you don't just want to find someone super technical, you want to find someone that's technical and you're vibe with. And I'd like kind of prioritize the person you vibe with over just being super technical because you know, the struggles of building and growing a business are very tough and it's super important to share that pain and that growth together rather than suffering silently and you just have a fucking coding robot doing what he's told. You know what I mean? Like you want to have conversations and stuff like that. But yeah, that's pretty much how to do it from an equity standpoint. I hope I covered all bases there. There's an over option which is crack devs, which is one of our partners. You can hire their team and they will build you an MVP for around 5K and then there are some like maintenance on top of that if you choose, but they are very solid and I highly recommend them. Just say you came from Atmaphia and they will give you a bit of a discount. But yeah, that's also an over option. But again, as I said, you know, it's less fun, less exciting. And I think the journey should prioritize being fun because if you have fun while doing it, it doesn't feel like work. So that's my point on hiring developer. That helps.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 3.68,
      "text": "Okay, so there are two ways to hire a developer."
    },
    {
      "start": 3.68,
      "end": 6.8,
      "text": "The first option is to work with someone for equity"
    },
    {
      "start": 6.8,
      "end": 8.28,
      "text": "and under the agreement that, okay,"
    },
    {
      "start": 8.28,
      "end": 11.68,
      "text": "we both put in equal effort and we get equal outcomes"
    },
    {
      "start": 11.68,
      "end": 16.36,
      "text": "and you run product, I run marketing, et cetera, et cetera."
    },
    {
      "start": 16.36,
      "end": 18.44,
      "text": "This is a pretty easy to do with SlaserCord,"
    },
    {
      "start": 18.44,
      "end": 20.32,
      "text": "which is my personal Discord server,"
    },
    {
      "start": 20.32,
      "end": 23.2,
      "text": "and I will recommend this just because I follow everyone"
    },
    {
      "start": 23.2,
      "end": 25.64,
      "text": "that watches my YouTube channel to my Discord."
    },
    {
      "start": 25.64,
      "end": 27.68,
      "text": "So there's a lot of app guys in there"
    },
    {
      "start": 27.68,
      "end": 29.12,
      "text": "and I'll show you it right now."
    },
    {
      "start": 29.12,
      "end": 31.16,
      "text": "Like, this is the finder co-founder chat"
    },
    {
      "start": 31.16,
      "end": 32.6,
      "text": "that I recommend typing in."
    },
    {
      "start": 32.6,
      "end": 34.52,
      "text": "So as you can see, I'm looking for a marketing co-founder,"
    },
    {
      "start": 34.52,
      "end": 36.28,
      "text": "70 foot, split, whatever."
    },
    {
      "start": 36.28,
      "end": 38.6,
      "text": "Like, you kind of see it as a lot of engagement,"
    },
    {
      "start": 38.6,
      "end": 39.760000000000005,
      "text": "a lot of traffic."
    },
    {
      "start": 39.760000000000005,
      "end": 41.92,
      "text": "So it's worth a, we have a chance,"
    },
    {
      "start": 41.92,
      "end": 43.52,
      "text": "and you can say something like this,"
    },
    {
      "start": 43.52,
      "end": 45.96,
      "text": "looking for a dad to go 50, 50 on an app with,"
    },
    {
      "start": 45.96,
      "end": 47.32,
      "text": "I'll be a marketing killer."
    },
    {
      "start": 47.32,
      "end": 49.6,
      "text": "I build the app market course and I'm extremely focused"
    },
    {
      "start": 49.6,
      "end": 51.44,
      "text": "on being successful with this."
    },
    {
      "start": 51.44,
      "end": 53.32,
      "text": "I have a ton of ideas and I'm ready to go all in,"
    },
    {
      "start": 53.32,
      "end": 54.84,
      "text": "DM me on this jump on a call."
    },
    {
      "start": 54.84,
      "end": 56.84,
      "text": "So for example, you can copy this message,"
    },
    {
      "start": 56.84,
      "end": 58.44,
      "text": "go into my Discord, post it,"
    },
    {
      "start": 58.44,
      "end": 61.04,
      "text": "and you will at least get a few replies."
    },
    {
      "start": 61.04,
      "end": 62.36,
      "text": "But you might have to hustle and post"
    },
    {
      "start": 62.36,
      "end": 64.44,
      "text": "a few different times and try and find someone."
    },
    {
      "start": 64.44,
      "end": 67.0,
      "text": "But we have 1,100 people in here."
    },
    {
      "start": 67.0,
      "end": 68.67999999999999,
      "text": "Everyone is super motivated and apt"
    },
    {
      "start": 68.67999999999999,
      "end": 71.03999999999999,
      "text": "and I'm sure you can find one single individual"
    },
    {
      "start": 71.03999999999999,
      "end": 74.6,
      "text": "that's also technical and that would love to what could be."
    },
    {
      "start": 75.96,
      "end": 77.28,
      "text": "And I would mention you bought the course"
    },
    {
      "start": 77.28,
      "end": 79.28,
      "text": "because that is a really positive sign"
    },
    {
      "start": 79.28,
      "end": 82.03999999999999,
      "text": "that you're putting your money up front"
    },
    {
      "start": 82.03999999999999,
      "end": 83.47999999999999,
      "text": "because you want to invest in yourself"
    },
    {
      "start": 83.47999999999999,
      "end": 85.2,
      "text": "like it's a massive green flag."
    },
    {
      "start": 86.2,
      "end": 90.0,
      "text": "And then here linked right here is a vested equity"
    },
    {
      "start": 90.0,
      "end": 91.48,
      "text": "to protect yourself."
    },
    {
      "start": 91.48,
      "end": 93.68,
      "text": "Something that I've learned and I've learned too late"
    },
    {
      "start": 93.68,
      "end": 95.28,
      "text": "and as so of a bunch of my friends,"
    },
    {
      "start": 95.28,
      "end": 97.4,
      "text": "like you can blatantly learn too late,"
    },
    {
      "start": 97.4,
      "end": 99.32000000000001,
      "text": "we brought people on for equity"
    },
    {
      "start": 99.32000000000001,
      "end": 101.64,
      "text": "that a long term didn't provide any value"
    },
    {
      "start": 101.64,
      "end": 103.32000000000001,
      "text": "and it fucked us all."
    },
    {
      "start": 103.32000000000001,
      "end": 106.36,
      "text": "So now there are like lawsuits, there's complications"
    },
    {
      "start": 106.36,
      "end": 108.32000000000001,
      "text": "and it's not worth that headache."
    },
    {
      "start": 108.32000000000001,
      "end": 111.88,
      "text": "So setting up a vested equity agreement is very important."
    },
    {
      "start": 111.88,
      "end": 113.12,
      "text": "I don't know too much about it,"
    },
    {
      "start": 113.12,
      "end": 114.48,
      "text": "but I just know it's really important"
    },
    {
      "start": 114.56,
      "end": 116.28,
      "text": "so I would recommend going to this link"
    },
    {
      "start": 116.28,
      "end": 118.64,
      "text": "and figuring out a good structure for both of you."
    },
    {
      "start": 120.72,
      "end": 125.72,
      "text": "A little personal note as well"
    },
    {
      "start": 127.08,
      "end": 131.12,
      "text": "is when I started Quitter for the first time with Connor,"
    },
    {
      "start": 131.12,
      "end": 135.16,
      "text": "I built all the app and we tried to work out an equity agreement"
    },
    {
      "start": 135.16,
      "end": 137.04,
      "text": "or he tried to work out an equity agreement,"
    },
    {
      "start": 137.04,
      "end": 138.96,
      "text": "but I was like fuck that."
    },
    {
      "start": 138.96,
      "end": 141.2,
      "text": "I don't want to agree to any sort of equity"
    },
    {
      "start": 141.2,
      "end": 144.76,
      "text": "until we kind of both prove ourselves to each other."
    },
    {
      "start": 144.76,
      "end": 146.48,
      "text": "Like for example, I built the app,"
    },
    {
      "start": 146.48,
      "end": 147.6,
      "text": "he was running marketing,"
    },
    {
      "start": 147.6,
      "end": 149.56,
      "text": "but he couldn't run marketing until I built the app."
    },
    {
      "start": 149.56,
      "end": 151.72,
      "text": "So I put an all the upfront effort"
    },
    {
      "start": 151.72,
      "end": 153.79999999999998,
      "text": "so like him taking 50% of my effort"
    },
    {
      "start": 153.79999999999998,
      "end": 156.76,
      "text": "before he had done anything himself didn't make sense to me."
    },
    {
      "start": 156.76,
      "end": 159.35999999999999,
      "text": "So I said, look, let's get to like 100K revenue"
    },
    {
      "start": 159.35999999999999,
      "end": 162.72,
      "text": "which sounds ridiculous before we discuss equity."
    },
    {
      "start": 163.76,
      "end": 166.28,
      "text": "And that was like a trust between both of us"
    },
    {
      "start": 166.28,
      "end": 168.2,
      "text": "and you know we got to 100K revenue"
    },
    {
      "start": 168.2,
      "end": 170.28,
      "text": "and then we sorted it out of the air-wizy part."
    },
    {
      "start": 172.04,
      "end": 174.23999999999998,
      "text": "And yeah, now the reason we did that"
    },
    {
      "start": 174.23999999999998,
      "end": 178.44,
      "text": "is because it's important to not get trapped"
    },
    {
      "start": 178.44,
      "end": 180.35999999999999,
      "text": "like a lot of co-founders change off the money,"
    },
    {
      "start": 180.35999999999999,
      "end": 182.67999999999998,
      "text": "like things get really complicated."
    },
    {
      "start": 182.67999999999998,
      "end": 184.76,
      "text": "So it's important to have that level of trust"
    },
    {
      "start": 184.76,
      "end": 188.67999999999998,
      "text": "and prove yourself to each other."
    },
    {
      "start": 188.67999999999998,
      "end": 190.56,
      "text": "So here are some things to look for in a founding"
    },
    {
      "start": 190.56,
      "end": 192.51999999999998,
      "text": "equity-based engineer."
    },
    {
      "start": 192.51999999999998,
      "end": 194.0,
      "text": "They should be clearly competent,"
    },
    {
      "start": 194.0,
      "end": 196.35999999999999,
      "text": "they should be extremely smart."
    },
    {
      "start": 196.35999999999999,
      "end": 198.23999999999998,
      "text": "They match their intensity and objectives."
    },
    {
      "start": 198.23999999999998,
      "end": 199.88,
      "text": "Like they're not just sitting around waiting"
    },
    {
      "start": 200.6,
      "end": 203.0,
      "text": "or they're like unbulbored or they're not really motivated."
    },
    {
      "start": 203.0,
      "end": 203.92,
      "text": "You don't want someone like that."
    },
    {
      "start": 203.92,
      "end": 205.4,
      "text": "You don't want to hand hold someone."
    },
    {
      "start": 205.4,
      "end": 206.51999999999998,
      "text": "You want someone that's like, okay,"
    },
    {
      "start": 206.51999999999998,
      "end": 208.2,
      "text": "I'm gonna fucking co this in a week"
    },
    {
      "start": 208.2,
      "end": 211.12,
      "text": "and then you're gonna like you as the mocked are gonna be like,"
    },
    {
      "start": 211.12,
      "end": 213.28,
      "text": "okay, I'm gonna do this strategy for Reddit."
    },
    {
      "start": 213.28,
      "end": 214.92,
      "text": "I'm gonna do this, this, this."
    },
    {
      "start": 214.92,
      "end": 217.2,
      "text": "And like you're both matching each other's intensity."
    },
    {
      "start": 217.2,
      "end": 220.32,
      "text": "That reduces the friction and the struggle."
    },
    {
      "start": 220.32,
      "end": 221.8,
      "text": "Whereas like if someone else,"
    },
    {
      "start": 221.8,
      "end": 224.28,
      "text": "like if they are for example pulling the way"
    },
    {
      "start": 224.28,
      "end": 225.88,
      "text": "and you're not, you know,"
    },
    {
      "start": 225.88,
      "end": 228.0,
      "text": "like it's not gonna be successful long term."
    },
    {
      "start": 228.84,
      "end": 231.04,
      "text": "They should also be willing to sacrifice time"
    },
    {
      "start": 231.04,
      "end": 232.68,
      "text": "and money for an unproven product."
    },
    {
      "start": 232.68,
      "end": 234.8,
      "text": "They should kind of know what they're getting into."
    },
    {
      "start": 236.0,
      "end": 238.96,
      "text": "You know, you should explain or emphasize that."
    },
    {
      "start": 238.96,
      "end": 242.16,
      "text": "It's gonna be long and hard for a long time"
    },
    {
      "start": 242.16,
      "end": 244.76,
      "text": "while that depends on how successful your marketing is."
    },
    {
      "start": 244.76,
      "end": 246.28,
      "text": "But usually in most cases,"
    },
    {
      "start": 246.28,
      "end": 249.24,
      "text": "it's long and hard and there's no results."
    },
    {
      "start": 249.24,
      "end": 251.32,
      "text": "And then you get like one result and then it gets to 10"
    },
    {
      "start": 251.32,
      "end": 253.92000000000002,
      "text": "and then born like you've got a booming business."
    },
    {
      "start": 253.92000000000002,
      "end": 257.16,
      "text": "But like there is a big gap of time between that"
    },
    {
      "start": 257.16,
      "end": 259.84000000000003,
      "text": "could be months, like several, several months."
    },
    {
      "start": 259.84000000000003,
      "end": 261.96000000000004,
      "text": "So just make sure you both understand that."
    },
    {
      "start": 263.6,
      "end": 265.64000000000004,
      "text": "So there is like, to emphasize again,"
    },
    {
      "start": 265.64000000000004,
      "end": 268.32000000000005,
      "text": "there is opportunity cost as a good developer"
    },
    {
      "start": 268.32000000000005,
      "end": 270.24,
      "text": "to waste your time on a project"
    },
    {
      "start": 270.24,
      "end": 272.40000000000003,
      "text": "that it's uncertain and he's not getting money from."
    },
    {
      "start": 272.40000000000003,
      "end": 274.72,
      "text": "So, and then on that note,"
    },
    {
      "start": 274.72,
      "end": 276.68,
      "text": "it's better to find an engineer that's younger"
    },
    {
      "start": 276.68,
      "end": 278.52000000000004,
      "text": "rather than older because if they're older,"
    },
    {
      "start": 278.52000000000004,
      "end": 281.32000000000005,
      "text": "they have financial responsibilities like paying for rent"
    },
    {
      "start": 281.32000000000005,
      "end": 283.40000000000003,
      "text": "or maybe providing for the kids or whatever."
    },
    {
      "start": 283.40000000000003,
      "end": 285.76000000000005,
      "text": "So they will be less inclined to work"
    },
    {
      "start": 285.88,
      "end": 287.84,
      "text": "on an unproven product rather than someone"
    },
    {
      "start": 287.84,
      "end": 289.84,
      "text": "that's young and hungry that's in school"
    },
    {
      "start": 289.84,
      "end": 293.8,
      "text": "that doesn't need to be earning money, right?"
    },
    {
      "start": 295.48,
      "end": 297.28,
      "text": "Woo, wow."
    },
    {
      "start": 297.28,
      "end": 299.24,
      "text": "They should also have high agency"
    },
    {
      "start": 299.24,
      "end": 301.52,
      "text": "and like if they fuck up, they admit they fucked up"
    },
    {
      "start": 301.52,
      "end": 305.08,
      "text": "and like they make the right steps to correct that fuck up"
    },
    {
      "start": 306.32,
      "end": 308.76,
      "text": "and don't just blame other people, blame me or whatever."
    },
    {
      "start": 308.76,
      "end": 309.84,
      "text": "You should also vibe with them."
    },
    {
      "start": 309.84,
      "end": 312.56,
      "text": "You should just be generally friends."
    },
    {
      "start": 312.56,
      "end": 315.08,
      "text": "Another bonus benefit is like,"
    },
    {
      "start": 315.08,
      "end": 318.24,
      "text": "if you've had the same goals as someone you work with,"
    },
    {
      "start": 318.24,
      "end": 320.35999999999996,
      "text": "like me and Clonamie Co. Fanar and Quitter,"
    },
    {
      "start": 320.35999999999996,
      "end": 322.76,
      "text": "we have the same goals, we want the same things."
    },
    {
      "start": 322.76,
      "end": 326.12,
      "text": "This is really easy to vibe with and like understand each other."
    },
    {
      "start": 326.12,
      "end": 328.32,
      "text": "Whereas like, for example, like maybe someone's"
    },
    {
      "start": 328.32,
      "end": 330.56,
      "text": "super materialistic but someone isn't"
    },
    {
      "start": 330.56,
      "end": 334.59999999999997,
      "text": "and then like, yeah, then the objectives or goals"
    },
    {
      "start": 334.59999999999997,
      "end": 336.32,
      "text": "or whatever are misaligned and you know,"
    },
    {
      "start": 336.32,
      "end": 337.56,
      "text": "that causes friction."
    },
    {
      "start": 337.56,
      "end": 341.79999999999995,
      "text": "So it's not that complex to be honest."
    },
    {
      "start": 342.48,
      "end": 345.72,
      "text": "And I want to emphasize, like you don't want to just,"
    },
    {
      "start": 345.72,
      "end": 348.72,
      "text": "if you don't just want to find someone super technical,"
    },
    {
      "start": 348.72,
      "end": 351.64,
      "text": "you want to find someone that's technical and you're vibe with."
    },
    {
      "start": 351.64,
      "end": 355.32,
      "text": "And I'd like kind of prioritize the person you vibe with"
    },
    {
      "start": 355.32,
      "end": 358.48,
      "text": "over just being super technical because you know,"
    },
    {
      "start": 358.48,
      "end": 361.64,
      "text": "the struggles of building and growing a business are very tough"
    },
    {
      "start": 362.72,
      "end": 366.44,
      "text": "and it's super important to share that pain"
    },
    {
      "start": 366.44,
      "end": 370.88,
      "text": "and that growth together rather than suffering silently"
    },
    {
      "start": 370.88,
      "end": 374.15999999999997,
      "text": "and you just have a fucking coding robot doing what he's told."
    },
    {
      "start": 374.15999999999997,
      "end": 375.08,
      "text": "You know what I mean?"
    },
    {
      "start": 375.08,
      "end": 378.6,
      "text": "Like you want to have conversations and stuff like that."
    },
    {
      "start": 380.6,
      "end": 383.64,
      "text": "But yeah, that's pretty much how to do it from an equity standpoint."
    },
    {
      "start": 383.64,
      "end": 386.08,
      "text": "I hope I covered all bases there."
    },
    {
      "start": 386.08,
      "end": 388.32,
      "text": "There's an over option which is crack devs,"
    },
    {
      "start": 388.32,
      "end": 390.68,
      "text": "which is one of our partners."
    },
    {
      "start": 390.68,
      "end": 393.92,
      "text": "You can hire their team and they will build you an MVP"
    },
    {
      "start": 393.92,
      "end": 397.12,
      "text": "for around 5K and then there are some like maintenance"
    },
    {
      "start": 397.12,
      "end": 398.88,
      "text": "on top of that if you choose,"
    },
    {
      "start": 398.88,
      "end": 401.84,
      "text": "but they are very solid and I highly recommend them."
    },
    {
      "start": 401.84,
      "end": 403.44,
      "text": "Just say you came from Atmaphia"
    },
    {
      "start": 403.44,
      "end": 406.36,
      "text": "and they will give you a bit of a discount."
    },
    {
      "start": 406.36,
      "end": 408.36,
      "text": "But yeah, that's also an over option."
    },
    {
      "start": 408.36,
      "end": 411.08,
      "text": "But again, as I said, you know,"
    },
    {
      "start": 411.08,
      "end": 413.68,
      "text": "it's less fun, less exciting."
    },
    {
      "start": 413.68,
      "end": 417.04,
      "text": "And I think the journey should prioritize being fun"
    },
    {
      "start": 417.04,
      "end": 418.8,
      "text": "because if you have fun while doing it,"
    },
    {
      "start": 418.8,
      "end": 420.44,
      "text": "it doesn't feel like work."
    },
    {
      "start": 420.44,
      "end": 424.56,
      "text": "So that's my point on hiring developer."
    },
    {
      "start": 424.56,
      "end": 425.56,
      "text": "That helps."
    }
  ]
}