{
  "file_name": "052_Lesson_52.faudio-hi-0-Default.mp4",
  "text": " Okay, let's get into the high life. I feel like I'm doing this for all of my sections. I don't know. So high level, I'm trying to get your attention. You gotta lock in, wake up. You're here because you want to change the rest of your life. You want to live life on your own terms. And therefore, you have to focus. This is the information you've been looking for your whole life. Your whole life. You've known there's been something out there. You've known that there's been information that's just been hidden from you that would change your life. That if you knew this information, you could tap into it. And it would change the rest of your life. Expand your mind. Show you the secrets that they're hiding, that they don't teach you in school. This is it. This is your chance. This is your opportunity. We're not leaving anything off the table. Putting everything on, being extremely transparent with everything all of our systems. At our own risk that people are gonna, it's gonna make the space more competitive, but we believe that all tides rise together. So, high level heuristics, focus of paper click ads. So this basically applies for everything except Apple Search ads. And we're gonna have Apple Search ads we're gonna make its own section for, because it's very different than other platforms. But this is for meta ads, Facebook ads, Instagram ads, Snapchat ads, TikTok ads, I think look everything. Google slightly, Google for the video ads, but not I guess for everything else. Well, some of these apply. You'll know what applies and what doesn't. So the high level heuristics. In the past, you've wanted to be super hyperspecific, handhold the algorithm. These are the target customers I'm looking for. This is a sample set of them. Here's what they look like. Now go find more. You would make what's called a lookalike audience. You would tell it, you would give some data from your existing users and say, these are the people that have bought from me before. Go find more of them. At this point, the algorithms are so good that broad targeting is better. Where you don't really give anything. You just tell the algorithm, this is what I'm optimizing for. Now go. And so that's something to keep in mind throughout this whole thing is that you might hear a lot of buzzwords from people online talking about retargeting campaigns, and which is basically there are all kinds of campaigns actually where there's a retargeting campaign where if someone saw an ad but didn't convert, you show them another ad. And there's a way in Facebook where you could design a campaign specifically to be for retargeting. However, that's actually not the optimal strategy anymore. This is all for most people. By the way, before I continue, I just want to preface that. There are no fucking rules. What works for anyone else might not work for you. I'm showing you what generally works, what's generally believed, the theories, and what I've seen in my personal experience, what I've heard talking to other founders. However, I know for every case proving something, right? I know a counter example where someone does the complete opposite and it works for them. So keep in mind, don't hold anything too tightly. Keep all this information close and loose. Be ready to adapt, be fluid. So creative is greater than targeting tweaks. This is essentially saying the videos that you're creating is more important than telling Facebook, this is a retargeting campaign video. This video is to retarget viewers that have seen a previous ad. In the creative, if the video is saying something like, hey guys, you've probably seen this ad all over social media and blah blah blah, maybe you show a clip from it. If you haven't purchased already, I just wanted to announce there's a sell going on right now. Blah blah blah. If it's actually good, Facebook and all of these ad platforms will learn very, very quickly that it works well for retargeting and it will show, it will be used for that itself. You don't need to do anything. And so the algorithms are really taking a big load off of everyone's shoulders at this point. You don't need to do as much as you used to. You just need to make very high quality creatives and be very intentional about them and just test. Creative is king. The more videos you put out, we saw those examples with Opal and with Bible chat. They're posting new videos every single day. They're running new experiment ads every single day. So okay, I'm gonna actually go into everything affects everything first. Everything affects everything. So just like if you have two creatives, they might one might tee the user up. Like, hey guys, check out this new soap. It lets you wash your body 10 times faster and keeps you clean 10 times longer than other soaps. The person's scrolls. Then a different creative, different creative, the algorithm realizes, oh, this is actually really good for retargeting. It's like, hey guys, we're on sale right now, 50% off. And if you remove the first video, it could totally destroy the second videos performance because everything's working together. The algorithm will learn, okay, I'm gonna show this first video to the user and then I'm gonna hit them with the second. And so everything works together as a system. And if you start turning certain ads off, if you start editing the campaign, you could destroy it. And I'm not saying that is like, you don't, like I'm not saying that to scare you from adjusting things, definitely be willing to adjust things. But I say that to keep in mind, if you change something that you think doesn't really matter, but then your whole campaign just falls apart. It's because everything affects everything. Everything has an effect. The algorithm is making sure that all of these moving pieces move together. The last high level here is sick is to always optimize for the final conversion. So you will be able to choose what to optimize for on these platforms. The options are usually traffic, which just means getting people to download your app, getting as many people as possible to download. Well, actually traffic is more just getting people to see your app page. And there's installs, getting people to download your app. And then there is a event. Then it's a event base where you could choose an event that you've programmed in your app to send a signal back to the ad platform saying this event was triggered. And that's what you want to do. You want to make an event in your app for when someone purchases or starts a trial, something that you can directly measure. First of all, within the next 24 hours, and this is something to do with Apple's privacy rules, which we'll get into. But mostly because we want to train the algorithm to only find people that are going to buy. If we optimize for installs, then the ad platform will think, okay, I'm going to get this app as many fucking installs as possible. I don't care if they spend money. I don't care if they're low quality users. I just want to find people that go download apps. People that like to try different apps. So they go, target those people, they'll go download, you'll get a ton of installs. But they probably won't spend money. They might, but they are less likely to spend money. And if you target for the purchase event, usually when you do target for a purchase event, you'll see that the cost per download spikes up. However, the chance that they purchase is also extremely high, because meta is finding people that they think will convert, they're not finding people that they think will download. They're finding people. They're not finding people that they think will download. They're not finding people that they think will like the app. They're not finding people that are going to press a specific button, they're finding people exclusively that they think will click the fucking check out button and pay with their face ID, that's all they're optimizing for. and they block out everything else, zone it out. Keep these in mind as we move into the next sections and probably you probably actually want to watch this twice. This is going to be the most important section for all of paid ads. If you understand this, then you're basically ready. You're, I wouldn't say you're ready, but you're 80% of the way ready to actually just hiring someone. You want to understand the platform first, but these are the principles that you need to keep in mind and make sure that if you wanted to hire someone to run ads, they understand these as well. Moving on.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 3.44,
      "text": "Okay, let's get into the high life."
    },
    {
      "start": 3.44,
      "end": 5.76,
      "text": "I feel like I'm doing this for all of my sections."
    },
    {
      "start": 5.76,
      "end": 7.32,
      "text": "I don't know."
    },
    {
      "start": 7.32,
      "end": 10.16,
      "text": "So high level, I'm trying to get your attention."
    },
    {
      "start": 10.16,
      "end": 11.72,
      "text": "You gotta lock in, wake up."
    },
    {
      "start": 11.72,
      "end": 14.44,
      "text": "You're here because you want to change the rest of your life."
    },
    {
      "start": 14.44,
      "end": 17.0,
      "text": "You want to live life on your own terms."
    },
    {
      "start": 17.0,
      "end": 19.6,
      "text": "And therefore, you have to focus."
    },
    {
      "start": 19.6,
      "end": 22.12,
      "text": "This is the information you've been looking for your whole life."
    },
    {
      "start": 22.12,
      "end": 23.04,
      "text": "Your whole life."
    },
    {
      "start": 23.04,
      "end": 24.92,
      "text": "You've known there's been something out there."
    },
    {
      "start": 24.92,
      "end": 27.04,
      "text": "You've known that there's been information"
    },
    {
      "start": 27.04,
      "end": 28.68,
      "text": "that's just been hidden from you"
    },
    {
      "start": 28.68,
      "end": 30.56,
      "text": "that would change your life."
    },
    {
      "start": 30.56,
      "end": 33.24,
      "text": "That if you knew this information, you could tap into it."
    },
    {
      "start": 33.24,
      "end": 35.64,
      "text": "And it would change the rest of your life."
    },
    {
      "start": 35.64,
      "end": 37.32,
      "text": "Expand your mind."
    },
    {
      "start": 37.32,
      "end": 39.480000000000004,
      "text": "Show you the secrets that they're hiding,"
    },
    {
      "start": 39.480000000000004,
      "end": 41.480000000000004,
      "text": "that they don't teach you in school."
    },
    {
      "start": 42.64,
      "end": 43.480000000000004,
      "text": "This is it."
    },
    {
      "start": 43.480000000000004,
      "end": 44.72,
      "text": "This is your chance."
    },
    {
      "start": 44.72,
      "end": 46.36,
      "text": "This is your opportunity."
    },
    {
      "start": 46.36,
      "end": 49.08,
      "text": "We're not leaving anything off the table."
    },
    {
      "start": 49.08,
      "end": 52.32,
      "text": "Putting everything on, being extremely transparent"
    },
    {
      "start": 52.32,
      "end": 54.2,
      "text": "with everything all of our systems."
    },
    {
      "start": 54.2,
      "end": 56.879999999999995,
      "text": "At our own risk that people are gonna,"
    },
    {
      "start": 56.88,
      "end": 58.96,
      "text": "it's gonna make the space more competitive,"
    },
    {
      "start": 58.96,
      "end": 62.440000000000005,
      "text": "but we believe that all tides rise together."
    },
    {
      "start": 62.440000000000005,
      "end": 67.44,
      "text": "So, high level heuristics, focus of paper click ads."
    },
    {
      "start": 69.2,
      "end": 73.04,
      "text": "So this basically applies for everything except Apple Search ads."
    },
    {
      "start": 73.04,
      "end": 75.88,
      "text": "And we're gonna have Apple Search ads"
    },
    {
      "start": 75.88,
      "end": 78.36,
      "text": "we're gonna make its own section for,"
    },
    {
      "start": 78.36,
      "end": 80.84,
      "text": "because it's very different than other platforms."
    },
    {
      "start": 80.84,
      "end": 85.2,
      "text": "But this is for meta ads, Facebook ads, Instagram ads,"
    },
    {
      "start": 85.2,
      "end": 89.76,
      "text": "Snapchat ads, TikTok ads, I think look everything."
    },
    {
      "start": 90.84,
      "end": 94.08,
      "text": "Google slightly, Google for the video ads,"
    },
    {
      "start": 94.08,
      "end": 96.08,
      "text": "but not I guess for everything else."
    },
    {
      "start": 97.04,
      "end": 99.64,
      "text": "Well, some of these apply."
    },
    {
      "start": 99.64,
      "end": 101.64,
      "text": "You'll know what applies and what doesn't."
    },
    {
      "start": 101.64,
      "end": 103.32000000000001,
      "text": "So the high level heuristics."
    },
    {
      "start": 105.2,
      "end": 109.64,
      "text": "In the past, you've wanted to be super hyperspecific,"
    },
    {
      "start": 109.64,
      "end": 111.76,
      "text": "handhold the algorithm."
    },
    {
      "start": 111.76,
      "end": 114.84,
      "text": "These are the target customers"
    },
    {
      "start": 114.96000000000001,
      "end": 116.08,
      "text": "I'm looking for."
    },
    {
      "start": 116.08,
      "end": 118.16,
      "text": "This is a sample set of them."
    },
    {
      "start": 118.16,
      "end": 119.36,
      "text": "Here's what they look like."
    },
    {
      "start": 119.36,
      "end": 120.68,
      "text": "Now go find more."
    },
    {
      "start": 120.68,
      "end": 123.08,
      "text": "You would make what's called a lookalike audience."
    },
    {
      "start": 123.08,
      "end": 125.52000000000001,
      "text": "You would tell it, you would give some data"
    },
    {
      "start": 125.52000000000001,
      "end": 126.88000000000001,
      "text": "from your existing users and say,"
    },
    {
      "start": 126.88000000000001,
      "end": 129.96,
      "text": "these are the people that have bought from me before."
    },
    {
      "start": 129.96,
      "end": 131.72,
      "text": "Go find more of them."
    },
    {
      "start": 131.72,
      "end": 135.44,
      "text": "At this point, the algorithms are so good"
    },
    {
      "start": 135.44,
      "end": 137.2,
      "text": "that broad targeting is better."
    },
    {
      "start": 137.2,
      "end": 139.16,
      "text": "Where you don't really give anything."
    },
    {
      "start": 139.16,
      "end": 140.52,
      "text": "You just tell the algorithm,"
    },
    {
      "start": 140.52,
      "end": 142.32,
      "text": "this is what I'm optimizing for."
    },
    {
      "start": 142.32,
      "end": 143.16,
      "text": "Now go."
    },
    {
      "start": 145.52,
      "end": 149.52,
      "text": "And so that's something to keep in mind"
    },
    {
      "start": 149.52,
      "end": 151.76,
      "text": "throughout this whole thing is that you might hear"
    },
    {
      "start": 151.76,
      "end": 154.96,
      "text": "a lot of buzzwords from people online talking about"
    },
    {
      "start": 154.96,
      "end": 157.12,
      "text": "retargeting campaigns,"
    },
    {
      "start": 157.12,
      "end": 161.36,
      "text": "and which is basically there are all kinds of campaigns"
    },
    {
      "start": 161.36,
      "end": 164.4,
      "text": "actually where there's a retargeting campaign"
    },
    {
      "start": 164.4,
      "end": 166.44,
      "text": "where if someone saw an ad but didn't convert,"
    },
    {
      "start": 166.44,
      "end": 168.16,
      "text": "you show them another ad."
    },
    {
      "start": 168.16,
      "end": 171.16,
      "text": "And there's a way in Facebook where you could design a campaign"
    },
    {
      "start": 171.16,
      "end": 173.84,
      "text": "specifically to be for retargeting."
    },
    {
      "start": 173.84,
      "end": 178.84,
      "text": "However, that's actually not the optimal strategy anymore."
    },
    {
      "start": 179.6,
      "end": 181.28,
      "text": "This is all for most people."
    },
    {
      "start": 181.28,
      "end": 184.76,
      "text": "By the way, before I continue, I just want to preface that."
    },
    {
      "start": 184.76,
      "end": 187.36,
      "text": "There are no fucking rules."
    },
    {
      "start": 187.36,
      "end": 189.92000000000002,
      "text": "What works for anyone else might not work for you."
    },
    {
      "start": 189.92000000000002,
      "end": 191.72,
      "text": "I'm showing you what generally works,"
    },
    {
      "start": 191.72,
      "end": 194.36,
      "text": "what's generally believed, the theories,"
    },
    {
      "start": 194.36,
      "end": 197.36,
      "text": "and what I've seen in my personal experience,"
    },
    {
      "start": 197.36,
      "end": 200.36,
      "text": "what I've heard talking to other founders."
    },
    {
      "start": 200.4,
      "end": 204.88000000000002,
      "text": "However, I know for every case proving something, right?"
    },
    {
      "start": 204.88000000000002,
      "end": 207.76000000000002,
      "text": "I know a counter example where someone does the complete opposite"
    },
    {
      "start": 207.76000000000002,
      "end": 209.12,
      "text": "and it works for them."
    },
    {
      "start": 209.12,
      "end": 214.0,
      "text": "So keep in mind, don't hold anything too tightly."
    },
    {
      "start": 214.0,
      "end": 218.76000000000002,
      "text": "Keep all this information close and loose."
    },
    {
      "start": 218.76000000000002,
      "end": 221.64000000000001,
      "text": "Be ready to adapt, be fluid."
    },
    {
      "start": 223.0,
      "end": 227.60000000000002,
      "text": "So creative is greater than targeting tweaks."
    },
    {
      "start": 227.6,
      "end": 231.44,
      "text": "This is essentially saying the videos that you're creating"
    },
    {
      "start": 231.44,
      "end": 233.96,
      "text": "is more important than telling Facebook,"
    },
    {
      "start": 233.96,
      "end": 236.35999999999999,
      "text": "this is a retargeting campaign video."
    },
    {
      "start": 236.35999999999999,
      "end": 238.6,
      "text": "This video is to retarget viewers"
    },
    {
      "start": 238.6,
      "end": 241.04,
      "text": "that have seen a previous ad."
    },
    {
      "start": 241.04,
      "end": 243.95999999999998,
      "text": "In the creative, if the video is saying something like,"
    },
    {
      "start": 243.95999999999998,
      "end": 247.56,
      "text": "hey guys, you've probably seen this ad all over social media"
    },
    {
      "start": 247.56,
      "end": 249.64,
      "text": "and blah blah blah, maybe you show a clip from it."
    },
    {
      "start": 249.64,
      "end": 251.07999999999998,
      "text": "If you haven't purchased already,"
    },
    {
      "start": 251.07999999999998,
      "end": 253.4,
      "text": "I just wanted to announce there's a sell going on right now."
    },
    {
      "start": 253.4,
      "end": 254.24,
      "text": "Blah blah blah."
    },
    {
      "start": 255.24,
      "end": 258.8,
      "text": "If it's actually good, Facebook and all of these ad platforms"
    },
    {
      "start": 258.8,
      "end": 262.92,
      "text": "will learn very, very quickly that it works well for retargeting"
    },
    {
      "start": 262.92,
      "end": 266.92,
      "text": "and it will show, it will be used for that itself."
    },
    {
      "start": 266.92,
      "end": 268.24,
      "text": "You don't need to do anything."
    },
    {
      "start": 269.24,
      "end": 272.16,
      "text": "And so the algorithms are really taking a big load"
    },
    {
      "start": 272.16,
      "end": 274.12,
      "text": "off of everyone's shoulders at this point."
    },
    {
      "start": 274.12,
      "end": 275.92,
      "text": "You don't need to do as much as you used to."
    },
    {
      "start": 275.92,
      "end": 279.76,
      "text": "You just need to make very high quality creatives"
    },
    {
      "start": 279.76,
      "end": 282.44,
      "text": "and be very intentional about them and just test."
    },
    {
      "start": 282.52,
      "end": 284.6,
      "text": "Creative is king."
    },
    {
      "start": 284.6,
      "end": 285.56,
      "text": "The more videos you put out,"
    },
    {
      "start": 285.56,
      "end": 289.68,
      "text": "we saw those examples with Opal and with Bible chat."
    },
    {
      "start": 289.68,
      "end": 291.48,
      "text": "They're posting new videos every single day."
    },
    {
      "start": 291.48,
      "end": 294.44,
      "text": "They're running new experiment ads every single day."
    },
    {
      "start": 295.44,
      "end": 297.76,
      "text": "So okay, I'm gonna actually go into"
    },
    {
      "start": 297.76,
      "end": 300.48,
      "text": "everything affects everything first."
    },
    {
      "start": 300.48,
      "end": 302.12,
      "text": "Everything affects everything."
    },
    {
      "start": 302.12,
      "end": 305.84,
      "text": "So just like if you have two creatives,"
    },
    {
      "start": 305.84,
      "end": 308.72,
      "text": "they might one might tee the user up."
    },
    {
      "start": 308.72,
      "end": 311.0,
      "text": "Like, hey guys, check out this new soap."
    },
    {
      "start": 311.32,
      "end": 315.6,
      "text": "It lets you wash your body 10 times faster"
    },
    {
      "start": 315.6,
      "end": 318.16,
      "text": "and keeps you clean 10 times longer than other soaps."
    },
    {
      "start": 318.16,
      "end": 319.32,
      "text": "The person's scrolls."
    },
    {
      "start": 319.32,
      "end": 321.88,
      "text": "Then a different creative, different creative,"
    },
    {
      "start": 321.88,
      "end": 323.76,
      "text": "the algorithm realizes, oh, this is actually"
    },
    {
      "start": 323.76,
      "end": 324.76,
      "text": "really good for retargeting."
    },
    {
      "start": 324.76,
      "end": 328.08,
      "text": "It's like, hey guys, we're on sale right now, 50% off."
    },
    {
      "start": 328.08,
      "end": 331.68,
      "text": "And if you remove the first video,"
    },
    {
      "start": 332.64,
      "end": 337.88,
      "text": "it could totally destroy the second videos performance"
    },
    {
      "start": 337.88,
      "end": 339.56,
      "text": "because everything's working together."
    },
    {
      "start": 339.56,
      "end": 340.76,
      "text": "The algorithm will learn, okay,"
    },
    {
      "start": 340.76,
      "end": 342.52,
      "text": "I'm gonna show this first video to the user"
    },
    {
      "start": 342.52,
      "end": 344.15999999999997,
      "text": "and then I'm gonna hit them with the second."
    },
    {
      "start": 344.15999999999997,
      "end": 347.2,
      "text": "And so everything works together as a system."
    },
    {
      "start": 347.2,
      "end": 349.12,
      "text": "And if you start turning certain ads off,"
    },
    {
      "start": 349.12,
      "end": 351.4,
      "text": "if you start editing the campaign,"
    },
    {
      "start": 352.68,
      "end": 354.92,
      "text": "you could destroy it."
    },
    {
      "start": 354.92,
      "end": 356.48,
      "text": "And I'm not saying that is like,"
    },
    {
      "start": 356.48,
      "end": 358.4,
      "text": "you don't, like I'm not saying that"
    },
    {
      "start": 358.4,
      "end": 360.71999999999997,
      "text": "to scare you from adjusting things,"
    },
    {
      "start": 360.71999999999997,
      "end": 362.8,
      "text": "definitely be willing to adjust things."
    },
    {
      "start": 362.8,
      "end": 364.92,
      "text": "But I say that to keep in mind,"
    },
    {
      "start": 364.92,
      "end": 366.48,
      "text": "if you change something that you think"
    },
    {
      "start": 366.48,
      "end": 367.76,
      "text": "doesn't really matter,"
    },
    {
      "start": 367.76,
      "end": 370.52,
      "text": "but then your whole campaign just falls apart."
    },
    {
      "start": 371.36,
      "end": 373.08,
      "text": "It's because everything affects everything."
    },
    {
      "start": 373.08,
      "end": 374.2,
      "text": "Everything has an effect."
    },
    {
      "start": 374.2,
      "end": 378.56,
      "text": "The algorithm is making sure that all of these moving pieces"
    },
    {
      "start": 378.56,
      "end": 379.56,
      "text": "move together."
    },
    {
      "start": 380.84,
      "end": 383.0,
      "text": "The last high level here is sick"
    },
    {
      "start": 384.0,
      "end": 387.76,
      "text": "is to always optimize for the final conversion."
    },
    {
      "start": 390.59999999999997,
      "end": 394.12,
      "text": "So you will be able to choose what to optimize for"
    },
    {
      "start": 394.12,
      "end": 395.44,
      "text": "on these platforms."
    },
    {
      "start": 395.44,
      "end": 397.96,
      "text": "The options are usually traffic,"
    },
    {
      "start": 397.96,
      "end": 400.6,
      "text": "which just means getting people to download your app,"
    },
    {
      "start": 400.6,
      "end": 402.44,
      "text": "getting as many people as possible to download."
    },
    {
      "start": 402.44,
      "end": 403.8,
      "text": "Well, actually traffic is more just getting people"
    },
    {
      "start": 403.8,
      "end": 405.16,
      "text": "to see your app page."
    },
    {
      "start": 405.16,
      "end": 408.44,
      "text": "And there's installs, getting people to download your app."
    },
    {
      "start": 408.44,
      "end": 411.08,
      "text": "And then there is a event."
    },
    {
      "start": 411.08,
      "end": 414.64,
      "text": "Then it's a event base where you could choose an event"
    },
    {
      "start": 414.64,
      "end": 416.2,
      "text": "that you've programmed in your app"
    },
    {
      "start": 416.2,
      "end": 419.2,
      "text": "to send a signal back to the ad platform"
    },
    {
      "start": 419.2,
      "end": 420.76,
      "text": "saying this event was triggered."
    },
    {
      "start": 420.76,
      "end": 422.44,
      "text": "And that's what you want to do."
    },
    {
      "start": 422.44,
      "end": 425.15999999999997,
      "text": "You want to make an event in your app"
    },
    {
      "start": 425.16,
      "end": 430.04,
      "text": "for when someone purchases or starts a trial,"
    },
    {
      "start": 430.04,
      "end": 433.48,
      "text": "something that you can directly measure."
    },
    {
      "start": 433.48,
      "end": 435.16,
      "text": "First of all, within the next 24 hours,"
    },
    {
      "start": 435.16,
      "end": 437.16,
      "text": "and this is something to do with Apple's privacy rules,"
    },
    {
      "start": 437.16,
      "end": 438.68,
      "text": "which we'll get into."
    },
    {
      "start": 438.68,
      "end": 443.40000000000003,
      "text": "But mostly because we want to train the algorithm"
    },
    {
      "start": 443.40000000000003,
      "end": 447.24,
      "text": "to only find people that are going to buy."
    },
    {
      "start": 447.24,
      "end": 450.08000000000004,
      "text": "If we optimize for installs,"
    },
    {
      "start": 450.08000000000004,
      "end": 453.32000000000005,
      "text": "then the ad platform will think, okay,"
    },
    {
      "start": 453.32,
      "end": 456.24,
      "text": "I'm going to get this app as many fucking installs"
    },
    {
      "start": 456.24,
      "end": 457.24,
      "text": "as possible."
    },
    {
      "start": 457.24,
      "end": 459.12,
      "text": "I don't care if they spend money."
    },
    {
      "start": 459.12,
      "end": 461.56,
      "text": "I don't care if they're low quality users."
    },
    {
      "start": 461.56,
      "end": 464.15999999999997,
      "text": "I just want to find people that go download apps."
    },
    {
      "start": 464.15999999999997,
      "end": 466.24,
      "text": "People that like to try different apps."
    },
    {
      "start": 466.24,
      "end": 468.4,
      "text": "So they go, target those people,"
    },
    {
      "start": 468.4,
      "end": 470.44,
      "text": "they'll go download, you'll get a ton of installs."
    },
    {
      "start": 470.44,
      "end": 471.96,
      "text": "But they probably won't spend money."
    },
    {
      "start": 471.96,
      "end": 476.12,
      "text": "They might, but they are less likely to spend money."
    },
    {
      "start": 476.12,
      "end": 479.2,
      "text": "And if you target for the purchase event,"
    },
    {
      "start": 479.2,
      "end": 480.92,
      "text": "usually when you do target for a purchase event,"
    },
    {
      "start": 481.08000000000004,
      "end": 484.28000000000003,
      "text": "you'll see that the cost per download spikes up."
    },
    {
      "start": 484.28000000000003,
      "end": 486.88,
      "text": "However, the chance that they purchase"
    },
    {
      "start": 486.88,
      "end": 488.44,
      "text": "is also extremely high,"
    },
    {
      "start": 489.52000000000004,
      "end": 491.36,
      "text": "because meta is finding people that they think"
    },
    {
      "start": 491.36,
      "end": 492.92,
      "text": "will convert, they're not finding people"
    },
    {
      "start": 492.92,
      "end": 493.92,
      "text": "that they think will download."
    },
    {
      "start": 493.92,
      "end": 495.0,
      "text": "They're finding people."
    },
    {
      "start": 495.0,
      "end": 496.88,
      "text": "They're not finding people that they think will download."
    },
    {
      "start": 496.88,
      "end": 498.0,
      "text": "They're not finding people that they think"
    },
    {
      "start": 498.0,
      "end": 499.04,
      "text": "will like the app."
    },
    {
      "start": 499.04,
      "end": 500.8,
      "text": "They're not finding people that are going to press"
    },
    {
      "start": 500.8,
      "end": 503.28000000000003,
      "text": "a specific button, they're finding people exclusively"
    },
    {
      "start": 503.28000000000003,
      "end": 506.12,
      "text": "that they think will click the fucking check out button"
    },
    {
      "start": 506.12,
      "end": 510.08000000000004,
      "text": "and pay with their face ID, that's all they're optimizing for."
    },
    {
      "start": 510.08,
      "end": 513.4399999999999,
      "text": "and they block out everything else, zone it out."
    },
    {
      "start": 515.4399999999999,
      "end": 518.4399999999999,
      "text": "Keep these in mind as we move into the next sections"
    },
    {
      "start": 518.4399999999999,
      "end": 521.4399999999999,
      "text": "and probably you probably actually want to watch this twice."
    },
    {
      "start": 521.4399999999999,
      "end": 524.52,
      "text": "This is going to be the most important section"
    },
    {
      "start": 524.52,
      "end": 525.88,
      "text": "for all of paid ads."
    },
    {
      "start": 525.88,
      "end": 530.12,
      "text": "If you understand this, then you're basically ready."
    },
    {
      "start": 530.12,
      "end": 531.4399999999999,
      "text": "You're, I wouldn't say you're ready,"
    },
    {
      "start": 531.4399999999999,
      "end": 536.4399999999999,
      "text": "but you're 80% of the way ready to actually just hiring someone."
    },
    {
      "start": 536.72,
      "end": 538.04,
      "text": "You want to understand the platform first,"
    },
    {
      "start": 538.04,
      "end": 539.28,
      "text": "but these are the principles"
    },
    {
      "start": 539.28,
      "end": 542.36,
      "text": "that you need to keep in mind and make sure that if you wanted"
    },
    {
      "start": 542.36,
      "end": 545.24,
      "text": "to hire someone to run ads, they understand these as well."
    },
    {
      "start": 546.16,
      "end": 546.68,
      "text": "Moving on."
    }
  ]
}