{
  "file_name": "050_Lesson_50.faudio-hi-0-Default.mp4",
  "text": " So this next section of the course, we are going to be talking about Pay Per Click ads. So this is Facebook ads, meta ads, Google ads, app love and ads, app store search ads, the whole nine yards. So here are our first case studies we're going to go through. So these apps are both primarily being found by people through their paper click ads. So Bible Chat, they're making 700k a month. Let's go check out their Facebook ad library. So 700k a month. Let's see what kind of ads they're on. One of these like cool aesthetic, almost motivational type of videos. The first week of at 7am, all of this stuff they have a few ads running right now. Christian cartoons bring Bible years to life. Some AI cartoons. But she's still remembered who she truly was. What's the most beautiful stories on your Bible? That's any Christian cartoons bring Bible heroes to life. By the way, these ads are all active. As you can see, it doesn't mean they're all profitable. It just means they're active. And we're going to go through the fact that these actually started running today. So that tells you something about Bible Chat. It means that they are constantly testing new creatives. These three ads were uploaded today. And the total active time this is important. If it's been active for like a couple of weeks or something, then most likely the ad is profitable. And also I wanted to mention, so this platform, I know I just jumped right in, but to take a step back, it is the Facebook ad library. You're able to see the ads that any brand is running through the meta ad platform. And so this is how we're doing it for Bible Chat right now. The revenue verified through sensor tower and then the ads we can see on meta. So let's go towards the end. Total active time, 22 hours. Yes, so they just spam out content. And that's something we're going to go into. Creative is king for paid ads. You're going to want to make as many creatives as possible. And this is my example. I'm just throwing out words right now. We're going to dive into all of this, but right now I really just want to show kind of what's possible with paid ads. Yes, so they have like hundreds of ads that are active. It honestly, the fact that none of these are inactive makes me think that maybe they aren't, maybe they're doing a specific bidding strategy where they just throw ads in. They let the algorithm optimize, but they're not actually going in and removing things. But like, okay, let's see what the other views are. We're telling me I never need to put Bible on the box. Yes, just like a product demonstration. That's kind of cool. So, okay, a bunch of variations of ads. It seems like it's mostly like text on the screen and then it shows something. Life without God feels empty. You feel like you run out of text on the screen. Turn out to be meaningless. And some cool grass keeps you feeling exhausted. Per view. Like a story for that. You need to reach God and get close to him. If you are confused, get Bible chat and ask it anything to get answers from the Bible. So, let's Bible chat. Life is just not not to be a piece. And you should feel every day that you're trying your best. Without a demo. Things that turn out to be meaningless. 700k a month. They probably actually make closer to like a million a month. And then we got Opal. And I say that because I believe sensor tower, it shows the proceeds, which means after Apple's cut, so 700k after Apple's cut more like a million. Every single month guys, every single month. And this app, I don't know if you've seen it. Bible chat. It's a very simple app. They basically just plug chat GVT into into their app. And you can ask it for Bible versus and then ask questions about it. They actually built it out pretty well at this point where there's a lot of different sections. And yeah, it's a very good user experience. But it was not complicated at all to build that app. Or it would not become a kid at all to build something like that. Opal. Opal is a productivity app. It's all about reducing screen time. I actually love their onboarding flow. If you're curious about seeing like a masterclass in onboarding, I would look through theirs. Opal. So let's see what kind of ads they're on. Another one of these words like text on the screen. Probably again, I'm falling for. Yeah, like probably again, that's interesting. You are high on the most proven drug known to man right now. And it's called your phone. Drugs have always been and will always be technologies. Whether that's morphine being isolated from the poppy seed or I was very good audio. Go do it yourself and look. So the common thing between these two accounts that we just watched is that they both spam out creatives. I mean, look at this. This one was uploaded today. This one was uploaded yesterday. These two, these three were uploaded the day before. Creative is king. And that's a lesson we're going to get into. What I want you to take away from this segment right here that we just looked through is that with paper click ads, it is very possible to highly scale up your app. Really scale it, grow it. It is not saturated like many people think. You just need to know the right angles to attack the space. And so we're going to get into that. But there are so many apps that are making millions of dollars a month. And their ad libraries are public. So feel free to go search sensor tower for the apps and then go explore their ad libraries. Let's jump into the next section.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 4.72,
      "text": "So this next section of the course, we are going to be talking about Pay Per Click ads."
    },
    {
      "start": 4.72,
      "end": 10.4,
      "text": "So this is Facebook ads, meta ads, Google ads, app love and ads, app store search ads,"
    },
    {
      "start": 11.28,
      "end": 15.280000000000001,
      "text": "the whole nine yards. So here are our first case studies we're going to go through."
    },
    {
      "start": 15.92,
      "end": 22.88,
      "text": "So these apps are both primarily being found by people through their paper click ads."
    },
    {
      "start": 23.44,
      "end": 29.04,
      "text": "So Bible Chat, they're making 700k a month. Let's go check out their Facebook ad library."
    },
    {
      "start": 30.88,
      "end": 37.04,
      "text": "So 700k a month. Let's see what kind of ads they're on."
    },
    {
      "start": 44.64,
      "end": 48.72,
      "text": "One of these like cool aesthetic, almost motivational type of videos."
    },
    {
      "start": 48.72,
      "end": 61.6,
      "text": "The first week of at 7am, all of this stuff they have a few ads running right now."
    },
    {
      "start": 65.84,
      "end": 68.56,
      "text": "Christian cartoons bring Bible years to life."
    },
    {
      "start": 68.56,
      "end": 69.75999999999999,
      "text": "Some AI cartoons."
    },
    {
      "start": 69.75999999999999,
      "end": 72.32,
      "text": "But she's still remembered who she truly was."
    },
    {
      "start": 72.39999999999999,
      "end": 76.47999999999999,
      "text": "What's the most beautiful stories on your Bible?"
    },
    {
      "start": 76.47999999999999,
      "end": 79.44,
      "text": "That's any Christian cartoons bring Bible heroes to life."
    },
    {
      "start": 79.44,
      "end": 83.67999999999999,
      "text": "By the way, these ads are all active. As you can see, it doesn't mean they're all profitable."
    },
    {
      "start": 84.39999999999999,
      "end": 85.19999999999999,
      "text": "It just means they're active."
    },
    {
      "start": 85.19999999999999,
      "end": 88.08,
      "text": "And we're going to go through the fact that these actually started running today."
    },
    {
      "start": 88.63999999999999,
      "end": 90.96,
      "text": "So that tells you something about Bible Chat."
    },
    {
      "start": 90.96,
      "end": 94.0,
      "text": "It means that they are constantly testing new creatives."
    },
    {
      "start": 94.0,
      "end": 95.52,
      "text": "These three ads were uploaded today."
    },
    {
      "start": 96.32,
      "end": 99.35999999999999,
      "text": "And the total active time this is important."
    },
    {
      "start": 99.44,
      "end": 108.24,
      "text": "If it's been active for like a couple of weeks or something, then most likely the ad is profitable."
    },
    {
      "start": 108.72,
      "end": 113.44,
      "text": "And also I wanted to mention, so this platform, I know I just jumped right in, but to take a"
    },
    {
      "start": 113.44,
      "end": 121.2,
      "text": "step back, it is the Facebook ad library. You're able to see the ads that any brand is running"
    },
    {
      "start": 121.2,
      "end": 122.96000000000001,
      "text": "through the meta ad platform."
    },
    {
      "start": 123.84,
      "end": 126.16,
      "text": "And so this is how we're doing it for Bible Chat right now."
    },
    {
      "start": 126.16,
      "end": 130.96,
      "text": "The revenue verified through sensor tower and then the ads we can see on meta."
    },
    {
      "start": 132.32,
      "end": 133.92,
      "text": "So let's go towards the end."
    },
    {
      "start": 134.72,
      "end": 136.07999999999998,
      "text": "Total active time, 22 hours."
    },
    {
      "start": 136.07999999999998,
      "end": 137.84,
      "text": "Yes, so they just spam out content."
    },
    {
      "start": 138.48,
      "end": 140.07999999999998,
      "text": "And that's something we're going to go into."
    },
    {
      "start": 140.07999999999998,
      "end": 142.24,
      "text": "Creative is king for paid ads."
    },
    {
      "start": 142.88,
      "end": 145.35999999999999,
      "text": "You're going to want to make as many creatives as possible."
    },
    {
      "start": 146.0,
      "end": 146.88,
      "text": "And this is my example."
    },
    {
      "start": 146.88,
      "end": 148.48,
      "text": "I'm just throwing out words right now."
    },
    {
      "start": 148.48,
      "end": 152.64,
      "text": "We're going to dive into all of this, but right now I really just want to show kind of what's"
    },
    {
      "start": 152.64,
      "end": 153.83999999999997,
      "text": "possible with paid ads."
    },
    {
      "start": 153.83999999999997,
      "end": 156.79999999999998,
      "text": "Yes, so they have like hundreds of ads that are active."
    },
    {
      "start": 158.07999999999998,
      "end": 163.27999999999997,
      "text": "It honestly, the fact that none of these are inactive makes me think that maybe they aren't,"
    },
    {
      "start": 163.27999999999997,
      "end": 166.72,
      "text": "maybe they're doing a specific bidding strategy where they just throw ads in."
    },
    {
      "start": 166.72,
      "end": 171.6,
      "text": "They let the algorithm optimize, but they're not actually going in and removing things."
    },
    {
      "start": 172.32,
      "end": 174.64,
      "text": "But like, okay, let's see what the other views are."
    },
    {
      "start": 175.67999999999998,
      "end": 178.48,
      "text": "We're telling me I never need to put Bible on the box."
    },
    {
      "start": 179.35999999999999,
      "end": 183.44,
      "text": "Yes, just like a product demonstration."
    },
    {
      "start": 183.44,
      "end": 184.32,
      "text": "That's kind of cool."
    },
    {
      "start": 184.32,
      "end": 186.32,
      "text": "So, okay, a bunch of variations of ads."
    },
    {
      "start": 186.32,
      "end": 190.56,
      "text": "It seems like it's mostly like text on the screen and then it shows something."
    },
    {
      "start": 190.56,
      "end": 192.88,
      "text": "Life without God feels empty."
    },
    {
      "start": 192.88,
      "end": 194.88,
      "text": "You feel like you run out of text on the screen."
    },
    {
      "start": 194.88,
      "end": 195.92,
      "text": "Turn out to be meaningless."
    },
    {
      "start": 195.92,
      "end": 198.39999999999998,
      "text": "And some cool grass keeps you feeling exhausted."
    },
    {
      "start": 198.39999999999998,
      "end": 198.88,
      "text": "Per view."
    },
    {
      "start": 198.88,
      "end": 201.12,
      "text": "Like a story for that."
    },
    {
      "start": 201.12,
      "end": 203.28,
      "text": "You need to reach God and get close to him."
    },
    {
      "start": 203.28,
      "end": 207.92,
      "text": "If you are confused, get Bible chat and ask it anything to get answers from the Bible."
    },
    {
      "start": 208.0,
      "end": 209.44,
      "text": "So, let's Bible chat."
    },
    {
      "start": 209.44,
      "end": 211.51999999999998,
      "text": "Life is just not not to be a piece."
    },
    {
      "start": 211.51999999999998,
      "end": 213.83999999999997,
      "text": "And you should feel every day that you're trying your best."
    },
    {
      "start": 213.83999999999997,
      "end": 214.72,
      "text": "Without a demo."
    },
    {
      "start": 214.72,
      "end": 216.48,
      "text": "Things that turn out to be meaningless."
    },
    {
      "start": 217.44,
      "end": 218.48,
      "text": "700k a month."
    },
    {
      "start": 219.27999999999997,
      "end": 221.44,
      "text": "They probably actually make closer to like a million a month."
    },
    {
      "start": 223.11999999999998,
      "end": 224.07999999999998,
      "text": "And then we got Opal."
    },
    {
      "start": 224.88,
      "end": 227.27999999999997,
      "text": "And I say that because I believe sensor tower,"
    },
    {
      "start": 227.27999999999997,
      "end": 230.16,
      "text": "it shows the proceeds, which means after Apple's cut,"
    },
    {
      "start": 230.16,
      "end": 232.39999999999998,
      "text": "so 700k after Apple's cut more like a million."
    },
    {
      "start": 233.51999999999998,
      "end": 235.51999999999998,
      "text": "Every single month guys, every single month."
    },
    {
      "start": 235.51999999999998,
      "end": 237.44,
      "text": "And this app, I don't know if you've seen it."
    },
    {
      "start": 238.16,
      "end": 238.88,
      "text": "Bible chat."
    },
    {
      "start": 239.83999999999997,
      "end": 241.28,
      "text": "It's a very simple app."
    },
    {
      "start": 241.28,
      "end": 243.67999999999998,
      "text": "They basically just plug chat GVT into"
    },
    {
      "start": 244.95999999999998,
      "end": 245.92,
      "text": "into their app."
    },
    {
      "start": 245.92,
      "end": 252.0,
      "text": "And you can ask it for Bible versus and then ask questions about it."
    },
    {
      "start": 252.0,
      "end": 255.6,
      "text": "They actually built it out pretty well at this point where there's a lot of different sections."
    },
    {
      "start": 255.6,
      "end": 257.68,
      "text": "And yeah, it's a very good user experience."
    },
    {
      "start": 258.71999999999997,
      "end": 262.8,
      "text": "But it was not complicated at all to build that app."
    },
    {
      "start": 262.8,
      "end": 265.76,
      "text": "Or it would not become a kid at all to build something like that."
    },
    {
      "start": 266.48,
      "end": 267.84,
      "text": "Opal."
    },
    {
      "start": 268.96,
      "end": 270.56,
      "text": "Opal is a productivity app."
    },
    {
      "start": 270.56,
      "end": 272.56,
      "text": "It's all about reducing screen time."
    },
    {
      "start": 272.56,
      "end": 274.0,
      "text": "I actually love their onboarding flow."
    },
    {
      "start": 274.0,
      "end": 277.52,
      "text": "If you're curious about seeing like a masterclass in onboarding,"
    },
    {
      "start": 277.52,
      "end": 278.48,
      "text": "I would look through theirs."
    },
    {
      "start": 280.24,
      "end": 280.64,
      "text": "Opal."
    },
    {
      "start": 281.68,
      "end": 283.92,
      "text": "So let's see what kind of ads they're on."
    },
    {
      "start": 283.92,
      "end": 286.4,
      "text": "Another one of these words like text on the screen."
    },
    {
      "start": 286.4,
      "end": 287.92,
      "text": "Probably again, I'm falling for."
    },
    {
      "start": 288.48,
      "end": 291.76,
      "text": "Yeah, like probably again, that's interesting."
    },
    {
      "start": 292.64,
      "end": 296.88,
      "text": "You are high on the most proven drug known to man right now."
    },
    {
      "start": 296.88,
      "end": 298.08,
      "text": "And it's called your phone."
    },
    {
      "start": 298.08,
      "end": 302.4,
      "text": "Drugs have always been and will always be technologies."
    },
    {
      "start": 302.4,
      "end": 305.52,
      "text": "Whether that's morphine being isolated from the"
    },
    {
      "start": 305.52,
      "end": 307.76,
      "text": "poppy seed or I was very good audio."
    },
    {
      "start": 307.76,
      "end": 310.0,
      "text": "Go do it yourself and look."
    },
    {
      "start": 322.4,
      "end": 326.96,
      "text": "So the common thing between these two accounts that we just watched is that"
    },
    {
      "start": 328.56,
      "end": 330.0,
      "text": "they both spam out creatives."
    },
    {
      "start": 330.8,
      "end": 332.0,
      "text": "I mean, look at this."
    },
    {
      "start": 332.0,
      "end": 333.59999999999997,
      "text": "This one was uploaded today."
    },
    {
      "start": 333.59999999999997,
      "end": 335.36,
      "text": "This one was uploaded yesterday."
    },
    {
      "start": 335.36,
      "end": 337.92,
      "text": "These two, these three were uploaded the day before."
    },
    {
      "start": 338.71999999999997,
      "end": 340.4,
      "text": "Creative is king."
    },
    {
      "start": 340.4,
      "end": 341.84,
      "text": "And that's a lesson we're going to get into."
    },
    {
      "start": 343.12,
      "end": 347.36,
      "text": "What I want you to take away from this segment right here that we just looked through"
    },
    {
      "start": 347.44,
      "end": 354.32,
      "text": "is that with paper click ads, it is very possible to highly scale up your app."
    },
    {
      "start": 354.88,
      "end": 357.04,
      "text": "Really scale it, grow it."
    },
    {
      "start": 357.04,
      "end": 359.6,
      "text": "It is not saturated like many people think."
    },
    {
      "start": 360.08000000000004,
      "end": 362.88,
      "text": "You just need to know the right angles to attack the space."
    },
    {
      "start": 363.6,
      "end": 364.88,
      "text": "And so we're going to get into that."
    },
    {
      "start": 364.88,
      "end": 367.92,
      "text": "But there are so many apps that are making millions of dollars a month."
    },
    {
      "start": 368.64,
      "end": 370.08000000000004,
      "text": "And their ad libraries are public."
    },
    {
      "start": 370.08000000000004,
      "end": 374.64,
      "text": "So feel free to go search sensor tower for the apps and then go explore their ad libraries."
    },
    {
      "start": 375.36,
      "end": 376.56,
      "text": "Let's jump into the next section."
    }
  ]
}