{
  "file_name": "025_Lesson_25.faudio-hi-0-Default.mp4",
  "text": " Alright boys and girls welcome back. We are now at the part of this tutorial where we're walking through different software and platform link creating accounts and actually doing things instead of just listening to me. So get yourself ready, get the document up, we're going to be doing a lot of setup and let's get right into it. So the most essential part and most essential step in the beginning is creating an Apple developer account. So you just click this link, start an enrollment and you can choose to either create a brand new iCloud account or just use your personal one. It's truly up to you. Once you've logged in this would usually prompt you to log in but I'm already signed in so it doesn't matter. Once you've signed in it will then ask you to pay subscription. I would choose the personal 99 dollar a year plan. Just it will say your full name on the app store but it doesn't really matter for now. Just as long as you have the membership we can start moving forward with building the app and then you could change everything else later. So once that's purchased we're all set to go and that's a solid start to make an editorial work. So yeah good job guys.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.5200000000000005,
      "text": "Alright boys and girls welcome back. We are now at the part of this tutorial"
    },
    {
      "start": 5.5200000000000005,
      "end": 8.88,
      "text": "where we're walking through different software and platform link creating"
    },
    {
      "start": 8.88,
      "end": 12.92,
      "text": "accounts and actually doing things instead of just listening to me. So get"
    },
    {
      "start": 12.92,
      "end": 17.12,
      "text": "yourself ready, get the document up, we're going to be doing a lot of setup and"
    },
    {
      "start": 17.12,
      "end": 20.76,
      "text": "let's get right into it. So the most essential part and most essential step in"
    },
    {
      "start": 20.76,
      "end": 24.64,
      "text": "the beginning is creating an Apple developer account. So you just click this"
    },
    {
      "start": 24.64,
      "end": 28.68,
      "text": "link, start an enrollment and you can choose to either create a brand new iCloud"
    },
    {
      "start": 28.68,
      "end": 33.04,
      "text": "account or just use your personal one. It's truly up to you. Once you've logged"
    },
    {
      "start": 33.04,
      "end": 35.76,
      "text": "in this would usually prompt you to log in but I'm already signed in so it"
    },
    {
      "start": 35.76,
      "end": 40.36,
      "text": "doesn't matter. Once you've signed in it will then ask you to pay subscription. I"
    },
    {
      "start": 40.36,
      "end": 45.8,
      "text": "would choose the personal 99 dollar a year plan. Just it will say your full name"
    },
    {
      "start": 45.8,
      "end": 48.879999999999995,
      "text": "on the app store but it doesn't really matter for now. Just as long as you have"
    },
    {
      "start": 48.879999999999995,
      "end": 51.96,
      "text": "the membership we can start moving forward with building the app and then you"
    },
    {
      "start": 51.96,
      "end": 55.36,
      "text": "could change everything else later. So once that's purchased we're all set to go"
    },
    {
      "start": 55.36,
      "end": 62.08,
      "text": "and that's a solid start to make an editorial work. So yeah good job guys."
    }
  ]
}