{
  "file_name": "007_Lesson_07.faudio-hi-0-Default.mp4",
  "text": " Welcome back. I believe this is lesson five that we're on now. And today we're going to be doing an interactive lesson. Okay. So we're going to be scrolling Instagram and TikTok to come up with ideas. So if you remember at the end of the... Wait, let me fix this. Track me, boy. Here we go. Okay. If you remember at the end of the previous lesson, we're going over how to identify and the importance of solving your own problems. I spoke about the value of disconnection, right? Going for a walk, going for a run, going for a hike, meditation, whatever it may be, for extended periods of time. So this is de-stimulation, which I think is very important. I think people don't spend enough time nowadays. I wanted to start with that because it's so important. But stimulation is also valuable. And this is a cool practice because you'll be able to carry it into your current daily scrolling. And if you don't scroll on a daily basis right now, I would actually recommend that you create new accounts and begin scrolling on Instagram Reels and TikTok. The reason that I suggest this, particularly to start over Reddit and Twitter, is because this is where the majority of consumers live. This is where the collective unconscious lives. The collective unconscious is largely a Jungian concept. But it essentially posits that throughout society, so for us, the Western world, the United States, we all operate with this collective unconscious underpinning that informs a lot of our action as well as our sort of psychological interests. Okay, so for this lesson, I'm going to begin scrolling on Instagram and TikTok and giving my opinion on different videos, pretty unfiltered. Here I've got a few notes that I'll touch on really quickly before I start. So first off, scrolling the Explorer page. This is Explorer. This is for you page. Now you can also intentionally search up different sort of key terms, looks maxing, Riz, weightlifting, you know, calorie counting, tanning, class action lawsuits, right? All these different domains that people build absent. As you find different niches, you should follow down rabbit holes. You'll be able to begin to recognize these connected webs that exist on the internet, which are essentially niches. I think the cookie verse is a great example. If you don't know what the cookie verse is, you are not chronically online enough. The cookie verse is essentially an offshoot of the looks maxing universe that is centered around cookie king, who is a content creator. He has a very, you know, he has this like, this affect to him. That is very charismatic and endearing. And he operates within the looks maxing niche, but his whole thing is almost like anti-looks maxing where he's eating terrible food. Anyways, I won't dive too deep, but key takeaway here, there are a lot of different niches, rabbit holes, and universes that you can find on the internet. You should ask yourself what is binding these different groups. So for looks maxing, it's the desire to become more attractive. For weightlifting, it is the desire to get stronger. For female relationship advice, it is the desire to find a compatible romantic partner. You can create new accounts as I mentioned to hit these demographics. So I've created accounts trying to put myself in the mind of a 30 year old woman and engaging with content that she would like in order to see a side of the internet that I've never seen before. Now, I know previously I spoke about the importance of solving problems close to you. And yes, that is great. And I think a very valuable framework for most individuals. But the majority of people that are taking this course and the majority of young, or I should say entrepreneurial app developers as a whole, are somewhere around the age of like 15 to 35 year old men. And so for example, the needs and desires of 70 year old women are being completely neglected. Now this is the value of creating new accounts to hit these demographics. If you are somebody who has a very deep understanding of human psychology and you think that you can traverse those different demographics, there is often a lot of alpha or upside in doing so. Now finally, we're going to get a lot more into this in the Reddit and Instagram section. But in short, see what people are manually solving. What are people asking for in the comment sections? The comment sections are like the most underrated place to really learn about the wants, needs, and thoughts of different types of people. The way that I came up with the idea of UMACS was consuming looks, maxing content and seeing these content creators do manual reviews, which people were paying for to get reviews of themselves by these content creators. People are paying 50, 100 plus dollars to get a review of how attractive they are and how they can become more attractive. And now this became abundantly obvious to me. All right, people are already paying for this, but AI can do it as soon as the vision EPI is released through open AI. So these are just some cool little things to think about, as well as a bunch of others that I will get into. Enough of that. Let's do it. All right, I hope that there's nothing bad on my feed. Okay, so I just pulled up Instagram, we'll refresh the Explorer page. See what's going on up in here. I hear we got Colin Myers, cool guy. When I was like 14, 15, it was like a religion to an only rib linker. Me and my friend, we would go through cards in like three, three days spam and that shit. So I think there's going to be an echo. So when I'm playing this, I'm going to turn down my mic audio. Yeah, I'm going to turn down my mic audio and then I'll just kind of swap, I guess, an alternate. Is there a better way to do this? Hmm. All right, I'm going to stitch this once I figure it out.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.0,
      "text": "Welcome back. I believe this is lesson five that we're on now."
    },
    {
      "start": 5.0,
      "end": 8.5,
      "text": "And today we're going to be doing an interactive lesson."
    },
    {
      "start": 8.5,
      "end": 15.4,
      "text": "Okay. So we're going to be scrolling Instagram and TikTok to come up with ideas."
    },
    {
      "start": 15.4,
      "end": 18.0,
      "text": "So if you remember at the end of the..."
    },
    {
      "start": 19.0,
      "end": 24.0,
      "text": "Wait, let me fix this. Track me, boy. Here we go."
    },
    {
      "start": 24.5,
      "end": 31.5,
      "text": "Okay. If you remember at the end of the previous lesson, we're going over how to identify"
    },
    {
      "start": 31.5,
      "end": 36.5,
      "text": "and the importance of solving your own problems."
    },
    {
      "start": 36.5,
      "end": 39.0,
      "text": "I spoke about the value of disconnection, right?"
    },
    {
      "start": 39.0,
      "end": 44.5,
      "text": "Going for a walk, going for a run, going for a hike, meditation, whatever it may be,"
    },
    {
      "start": 44.5,
      "end": 47.0,
      "text": "for extended periods of time."
    },
    {
      "start": 47.0,
      "end": 51.0,
      "text": "So this is de-stimulation, which I think is very important."
    },
    {
      "start": 51.0,
      "end": 55.0,
      "text": "I think people don't spend enough time nowadays."
    },
    {
      "start": 55.0,
      "end": 58.0,
      "text": "I wanted to start with that because it's so important."
    },
    {
      "start": 58.0,
      "end": 61.5,
      "text": "But stimulation is also valuable."
    },
    {
      "start": 61.5,
      "end": 68.0,
      "text": "And this is a cool practice because you'll be able to carry it into your current daily scrolling."
    },
    {
      "start": 68.0,
      "end": 77.0,
      "text": "And if you don't scroll on a daily basis right now, I would actually recommend that you create new accounts"
    },
    {
      "start": 77.5,
      "end": 81.5,
      "text": "and begin scrolling on Instagram Reels and TikTok."
    },
    {
      "start": 81.5,
      "end": 87.5,
      "text": "The reason that I suggest this, particularly to start over Reddit and Twitter,"
    },
    {
      "start": 87.5,
      "end": 90.5,
      "text": "is because this is where the majority of consumers live."
    },
    {
      "start": 90.5,
      "end": 94.5,
      "text": "This is where the collective unconscious lives."
    },
    {
      "start": 94.5,
      "end": 99.5,
      "text": "The collective unconscious is largely a Jungian concept."
    },
    {
      "start": 99.5,
      "end": 105.5,
      "text": "But it essentially posits that throughout society,"
    },
    {
      "start": 105.5,
      "end": 114.5,
      "text": "so for us, the Western world, the United States, we all operate with this collective unconscious underpinning"
    },
    {
      "start": 114.5,
      "end": 123.5,
      "text": "that informs a lot of our action as well as our sort of psychological interests."
    },
    {
      "start": 123.5,
      "end": 128.5,
      "text": "Okay, so for this lesson, I'm going to begin scrolling on Instagram and TikTok"
    },
    {
      "start": 128.5,
      "end": 132.5,
      "text": "and giving my opinion on different videos, pretty unfiltered."
    },
    {
      "start": 132.5,
      "end": 137.5,
      "text": "Here I've got a few notes that I'll touch on really quickly before I start."
    },
    {
      "start": 137.5,
      "end": 140.5,
      "text": "So first off, scrolling the Explorer page."
    },
    {
      "start": 140.5,
      "end": 142.5,
      "text": "This is Explorer. This is for you page."
    },
    {
      "start": 142.5,
      "end": 147.5,
      "text": "Now you can also intentionally search up different sort of key terms, looks maxing,"
    },
    {
      "start": 147.5,
      "end": 156.5,
      "text": "Riz, weightlifting, you know, calorie counting, tanning, class action lawsuits, right?"
    },
    {
      "start": 156.5,
      "end": 159.5,
      "text": "All these different domains that people build absent."
    },
    {
      "start": 160.5,
      "end": 165.5,
      "text": "As you find different niches, you should follow down rabbit holes."
    },
    {
      "start": 165.5,
      "end": 174.5,
      "text": "You'll be able to begin to recognize these connected webs that exist on the internet, which are essentially niches."
    },
    {
      "start": 174.5,
      "end": 177.5,
      "text": "I think the cookie verse is a great example."
    },
    {
      "start": 177.5,
      "end": 182.5,
      "text": "If you don't know what the cookie verse is, you are not chronically online enough."
    },
    {
      "start": 182.5,
      "end": 188.5,
      "text": "The cookie verse is essentially an offshoot of the looks maxing universe"
    },
    {
      "start": 188.5,
      "end": 193.5,
      "text": "that is centered around cookie king, who is a content creator."
    },
    {
      "start": 193.5,
      "end": 201.5,
      "text": "He has a very, you know, he has this like, this affect to him."
    },
    {
      "start": 201.5,
      "end": 204.5,
      "text": "That is very charismatic and endearing."
    },
    {
      "start": 204.5,
      "end": 210.5,
      "text": "And he operates within the looks maxing niche, but his whole thing is almost like anti-looks maxing"
    },
    {
      "start": 210.5,
      "end": 213.5,
      "text": "where he's eating terrible food."
    },
    {
      "start": 213.5,
      "end": 219.5,
      "text": "Anyways, I won't dive too deep, but key takeaway here, there are a lot of different niches,"
    },
    {
      "start": 219.5,
      "end": 222.5,
      "text": "rabbit holes, and universes that you can find on the internet."
    },
    {
      "start": 222.5,
      "end": 226.5,
      "text": "You should ask yourself what is binding these different groups."
    },
    {
      "start": 226.5,
      "end": 229.5,
      "text": "So for looks maxing, it's the desire to become more attractive."
    },
    {
      "start": 229.5,
      "end": 232.5,
      "text": "For weightlifting, it is the desire to get stronger."
    },
    {
      "start": 232.5,
      "end": 239.5,
      "text": "For female relationship advice, it is the desire to find a compatible romantic partner."
    },
    {
      "start": 240.5,
      "end": 243.5,
      "text": "You can create new accounts as I mentioned to hit these demographics."
    },
    {
      "start": 243.5,
      "end": 248.5,
      "text": "So I've created accounts trying to put myself in the mind of a 30 year old woman"
    },
    {
      "start": 248.5,
      "end": 254.5,
      "text": "and engaging with content that she would like in order to see a side of the internet that I've never seen before."
    },
    {
      "start": 254.5,
      "end": 259.5,
      "text": "Now, I know previously I spoke about the importance of solving problems close to you."
    },
    {
      "start": 259.5,
      "end": 261.5,
      "text": "And yes, that is great."
    },
    {
      "start": 261.5,
      "end": 264.5,
      "text": "And I think a very valuable framework for most individuals."
    },
    {
      "start": 264.5,
      "end": 268.5,
      "text": "But the majority of people that are taking this course and the majority of young,"
    },
    {
      "start": 268.5,
      "end": 272.5,
      "text": "or I should say entrepreneurial app developers as a whole,"
    },
    {
      "start": 272.5,
      "end": 277.5,
      "text": "are somewhere around the age of like 15 to 35 year old men."
    },
    {
      "start": 277.5,
      "end": 283.5,
      "text": "And so for example, the needs and desires of 70 year old women are being completely neglected."
    },
    {
      "start": 283.5,
      "end": 288.5,
      "text": "Now this is the value of creating new accounts to hit these demographics."
    },
    {
      "start": 288.5,
      "end": 292.5,
      "text": "If you are somebody who has a very deep understanding of human psychology"
    },
    {
      "start": 292.5,
      "end": 295.5,
      "text": "and you think that you can traverse those different demographics,"
    },
    {
      "start": 295.5,
      "end": 301.5,
      "text": "there is often a lot of alpha or upside in doing so."
    },
    {
      "start": 301.5,
      "end": 306.5,
      "text": "Now finally, we're going to get a lot more into this in the Reddit and Instagram section."
    },
    {
      "start": 306.5,
      "end": 311.5,
      "text": "But in short, see what people are manually solving."
    },
    {
      "start": 311.5,
      "end": 313.5,
      "text": "What are people asking for in the comment sections?"
    },
    {
      "start": 313.5,
      "end": 321.5,
      "text": "The comment sections are like the most underrated place to really learn about the wants, needs,"
    },
    {
      "start": 321.5,
      "end": 325.5,
      "text": "and thoughts of different types of people."
    },
    {
      "start": 325.5,
      "end": 330.5,
      "text": "The way that I came up with the idea of UMACS was consuming looks,"
    },
    {
      "start": 330.5,
      "end": 335.5,
      "text": "maxing content and seeing these content creators do manual reviews,"
    },
    {
      "start": 335.5,
      "end": 341.5,
      "text": "which people were paying for to get reviews of themselves by these content creators."
    },
    {
      "start": 341.5,
      "end": 346.5,
      "text": "People are paying 50, 100 plus dollars to get a review of how attractive they are"
    },
    {
      "start": 346.5,
      "end": 348.5,
      "text": "and how they can become more attractive."
    },
    {
      "start": 348.5,
      "end": 351.5,
      "text": "And now this became abundantly obvious to me."
    },
    {
      "start": 351.5,
      "end": 354.5,
      "text": "All right, people are already paying for this,"
    },
    {
      "start": 354.5,
      "end": 359.5,
      "text": "but AI can do it as soon as the vision EPI is released through open AI."
    },
    {
      "start": 359.5,
      "end": 363.5,
      "text": "So these are just some cool little things to think about,"
    },
    {
      "start": 363.5,
      "end": 366.5,
      "text": "as well as a bunch of others that I will get into."
    },
    {
      "start": 366.5,
      "end": 370.5,
      "text": "Enough of that. Let's do it."
    },
    {
      "start": 370.5,
      "end": 374.5,
      "text": "All right, I hope that there's nothing bad on my feed."
    },
    {
      "start": 375.5,
      "end": 379.5,
      "text": "Okay, so I just pulled up Instagram, we'll refresh the Explorer page."
    },
    {
      "start": 379.5,
      "end": 382.5,
      "text": "See what's going on up in here."
    },
    {
      "start": 382.5,
      "end": 385.5,
      "text": "I hear we got Colin Myers, cool guy."
    },
    {
      "start": 385.5,
      "end": 389.5,
      "text": "When I was like 14, 15, it was like a religion to an only rib linker."
    },
    {
      "start": 389.5,
      "end": 394.5,
      "text": "Me and my friend, we would go through cards in like three, three days spam and that shit."
    },
    {
      "start": 394.5,
      "end": 397.5,
      "text": "So I think there's going to be an echo."
    },
    {
      "start": 397.5,
      "end": 403.5,
      "text": "So when I'm playing this, I'm going to turn down my mic audio."
    },
    {
      "start": 403.5,
      "end": 408.5,
      "text": "Yeah, I'm going to turn down my mic audio and then I'll just kind of swap, I guess, an alternate."
    },
    {
      "start": 408.5,
      "end": 411.5,
      "text": "Is there a better way to do this?"
    },
    {
      "start": 411.5,
      "end": 415.5,
      "text": "Hmm. All right, I'm going to stitch this once I figure it out."
    }
  ]
}