{
  "file_name": "029_Lesson_29.faudio-hi-0-Default.mp4",
  "text": " Okay, now we're going to talk about AI prompting and how to expedite development by utilizing AI. In my opinion, and I've spoke to Blake Anderson about this, the reason apps have blown up recently and the reason we've all got very rich and successful off of it is because AI has lowered the barriers to entry significantly. It saves a lot of time. It's super smart and like you can build and test and validate things at lightning speed. Here is a bunch of charity prompts that you can use. We'll be using this first one to begin this tutorial and there's a bunch of other ones that are very simple. Like make a poor to refresh list and SwiftUI or create a SwiftUI button with a spring bounce animation when tapped. These are all like really simple prompts but they work. And instead of like needing to learn to learn to code like knowing what ins and outs this and that, you can just ask check GPT to build it for you. And as long as you have like a fundamental understanding of how Swift and how code works, you can build anything. So we use that a lot in Quitter. We use a lot to expedite my work with the community. Like most of the community functions, built by AI. I mean, I understand how they work now but like I didn't initially and it just did it for me and now we have a fucking working community that has a thousand posts a day. So it really does work. And usually the more detailed the better, as you can see this prompt that we're going to use for the beginning of the tutorial, I want to build a UMACS clone in SwiftUI. Okay, very explicit. Then UMACS is an app where you can take a picture of your face and it will rate your looks out of ten. This should be out of 100. Yeah, that should be right. This image should be passed to the OpenAI API via MacPause repository and the results should display on the front end. If you coded before you can understand what it means by results front end, whatever, and repository, very simple. I will explain later. The scores that should give you are overall rating, potential, masculinity, skin quality and jawline and anchiko, sorry. So this is exactly what UMACS has. So I'll just pull up there right now. Oh shit. As you can see, there is an overall, there's a potential, masculinity, skin quality, jawline and cheekbones. And it's just his face and that image is rated by ChatGbT. Very, very simple stuff. So yeah, that's the problem I'm going to give ChatGbT in the next section of this tutorial. But usually just the general rule is like the more explicit the better. It always share information about your tech stack. So let's, for example, say I'm using Firebase or I'm using OpenAI instead of Claude or Gemini. And also if it doesn't, if you copy paste the code into your IDE and what you kind of expect it or it's not kind of functioning how you want it to function, just say change this. It's doing one thing, but I want it to do another thing instead. And ChatGbT will be very fast to fix it and you can like move a lightning speed. And I'm going to show you how fast we can build a UX competitor right now. So let's get into it.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.2,
      "text": "Okay, now we're going to talk about AI prompting and how to expedite development by utilizing"
    },
    {
      "start": 5.2,
      "end": 6.2,
      "text": "AI."
    },
    {
      "start": 6.2,
      "end": 11.52,
      "text": "In my opinion, and I've spoke to Blake Anderson about this, the reason apps have blown"
    },
    {
      "start": 11.52,
      "end": 15.4,
      "text": "up recently and the reason we've all got very rich and successful off of it is because"
    },
    {
      "start": 15.4,
      "end": 18.88,
      "text": "AI has lowered the barriers to entry significantly."
    },
    {
      "start": 18.88,
      "end": 20.6,
      "text": "It saves a lot of time."
    },
    {
      "start": 20.6,
      "end": 29.92,
      "text": "It's super smart and like you can build and test and validate things at lightning speed."
    },
    {
      "start": 29.92,
      "end": 32.72,
      "text": "Here is a bunch of charity prompts that you can use."
    },
    {
      "start": 32.72,
      "end": 36.92,
      "text": "We'll be using this first one to begin this tutorial and there's a bunch of other ones"
    },
    {
      "start": 36.92,
      "end": 38.400000000000006,
      "text": "that are very simple."
    },
    {
      "start": 38.400000000000006,
      "end": 42.64,
      "text": "Like make a poor to refresh list and SwiftUI or create a SwiftUI button with a spring"
    },
    {
      "start": 42.64,
      "end": 44.36,
      "text": "bounce animation when tapped."
    },
    {
      "start": 44.36,
      "end": 49.040000000000006,
      "text": "These are all like really simple prompts but they work."
    },
    {
      "start": 49.040000000000006,
      "end": 54.28,
      "text": "And instead of like needing to learn to learn to code like knowing what ins and outs"
    },
    {
      "start": 54.28,
      "end": 57.96,
      "text": "this and that, you can just ask check GPT to build it for you."
    },
    {
      "start": 57.96,
      "end": 63.0,
      "text": "And as long as you have like a fundamental understanding of how Swift and how code works,"
    },
    {
      "start": 63.0,
      "end": 65.92,
      "text": "you can build anything."
    },
    {
      "start": 65.92,
      "end": 68.12,
      "text": "So we use that a lot in Quitter."
    },
    {
      "start": 68.12,
      "end": 70.92,
      "text": "We use a lot to expedite my work with the community."
    },
    {
      "start": 70.92,
      "end": 73.44,
      "text": "Like most of the community functions, built by AI."
    },
    {
      "start": 73.44,
      "end": 79.08,
      "text": "I mean, I understand how they work now but like I didn't initially and it just did it"
    },
    {
      "start": 79.08,
      "end": 83.72,
      "text": "for me and now we have a fucking working community that has a thousand posts a day."
    },
    {
      "start": 83.72,
      "end": 86.03999999999999,
      "text": "So it really does work."
    },
    {
      "start": 86.03999999999999,
      "end": 92.84,
      "text": "And usually the more detailed the better, as you can see this prompt that we're going"
    },
    {
      "start": 92.84,
      "end": 97.64,
      "text": "to use for the beginning of the tutorial, I want to build a UMACS clone in SwiftUI."
    },
    {
      "start": 97.64,
      "end": 99.56,
      "text": "Okay, very explicit."
    },
    {
      "start": 99.56,
      "end": 104.0,
      "text": "Then UMACS is an app where you can take a picture of your face and it will rate your"
    },
    {
      "start": 104.0,
      "end": 105.48,
      "text": "looks out of ten."
    },
    {
      "start": 105.48,
      "end": 108.0,
      "text": "This should be out of 100."
    },
    {
      "start": 108.0,
      "end": 110.28,
      "text": "Yeah, that should be right."
    },
    {
      "start": 110.28,
      "end": 115.4,
      "text": "This image should be passed to the OpenAI API via MacPause repository and the results"
    },
    {
      "start": 115.4,
      "end": 117.8,
      "text": "should display on the front end."
    },
    {
      "start": 117.8,
      "end": 122.0,
      "text": "If you coded before you can understand what it means by results front end, whatever,"
    },
    {
      "start": 122.0,
      "end": 125.48,
      "text": "and repository, very simple."
    },
    {
      "start": 125.48,
      "end": 126.96000000000001,
      "text": "I will explain later."
    },
    {
      "start": 126.96000000000001,
      "end": 131.44,
      "text": "The scores that should give you are overall rating, potential, masculinity, skin quality"
    },
    {
      "start": 131.44,
      "end": 134.56,
      "text": "and jawline and anchiko, sorry."
    },
    {
      "start": 134.56,
      "end": 136.24,
      "text": "So this is exactly what UMACS has."
    },
    {
      "start": 136.24,
      "end": 140.12,
      "text": "So I'll just pull up there right now."
    },
    {
      "start": 140.12,
      "end": 142.24,
      "text": "Oh shit."
    },
    {
      "start": 142.24,
      "end": 146.12,
      "text": "As you can see, there is an overall, there's a potential, masculinity, skin quality, jawline"
    },
    {
      "start": 146.12,
      "end": 147.52,
      "text": "and cheekbones."
    },
    {
      "start": 147.52,
      "end": 152.0,
      "text": "And it's just his face and that image is rated by ChatGbT."
    },
    {
      "start": 152.0,
      "end": 154.64000000000001,
      "text": "Very, very simple stuff."
    },
    {
      "start": 154.64000000000001,
      "end": 158.88,
      "text": "So yeah, that's the problem I'm going to give ChatGbT in the next section of this tutorial."
    },
    {
      "start": 158.88,
      "end": 162.32000000000002,
      "text": "But usually just the general rule is like the more explicit the better."
    },
    {
      "start": 162.32,
      "end": 164.64,
      "text": "It always share information about your tech stack."
    },
    {
      "start": 164.64,
      "end": 171.84,
      "text": "So let's, for example, say I'm using Firebase or I'm using OpenAI instead of Claude or"
    },
    {
      "start": 171.84,
      "end": 174.84,
      "text": "Gemini."
    },
    {
      "start": 174.84,
      "end": 180.4,
      "text": "And also if it doesn't, if you copy paste the code into your IDE and what you kind of"
    },
    {
      "start": 180.4,
      "end": 184.92,
      "text": "expect it or it's not kind of functioning how you want it to function, just say change"
    },
    {
      "start": 184.92,
      "end": 185.92,
      "text": "this."
    },
    {
      "start": 185.92,
      "end": 189.84,
      "text": "It's doing one thing, but I want it to do another thing instead."
    },
    {
      "start": 189.84,
      "end": 193.84,
      "text": "And ChatGbT will be very fast to fix it and you can like move a lightning speed."
    },
    {
      "start": 193.84,
      "end": 197.76,
      "text": "And I'm going to show you how fast we can build a UX competitor right now."
    },
    {
      "start": 197.76,
      "end": 198.68,
      "text": "So let's get into it."
    }
  ]
}