{
  "file_name": "049_Lesson_49.faudio-hi-0-Default.mp4",
  "text": " Alright, here we go. Now that you know the types of organic content, how to set up your actual profiles, which was pretty short for a minute long, let's talk about how to get set up for organic accounts and how to actually warm them up properly. I highly suggest doing this for anything with organic volume posting. That means you are making multiple TikTok accounts and posting two, three times a day or faceless, which is the same thing. You are posting two, three times a day, but just with the edited content. Now, the first thing is obviously download TikTok and create your account. Even if you are launching in a week, two, three, four weeks, I would download TikTok right away, make sure your account is warm, and start making videos that you actually get comfortable doing this. When it comes to your user names, alright, here's the deal. Make it something organic. I gave an example for Quitter. So, your name was Jack, Quitwood Jack, Jack. Quitter, Jack's Journey, or you could even just do Jack Jones 1, 2, 3. Make it simple. You don't need to overthink it. I would just use a first name, last name. You can even make it a fake name, and I would make it a clear profile picture. When it comes to the bio, I think you can do really anything you want. I've seen a lot of people do like my journey to quitting. Just no shame to support. It's actually something someone usefully enough in our Discord community for organic content. Sounds like AI, so maybe they use that. But you don't want the profile to look like a scam, like an ad. You want to make it look like a real person. When it comes to the timeline of warming up your account, here's what you do. You need to take three to four days and give it a commitment of at least 15 minutes a day, morning, lunch, afternoon, evening. What you're going to be doing is searching up content like in Contemplating Gaging. For 15 minutes, or it's 45 minutes a day, or 30 to 45 minutes a day, split up three times. Just make sure TikTok knows you, thinks you're an actual account, and trust you. When it comes to this, I gave an example for Quitter. I think it's the best thing to do. I'll actually just give examples of what we were doing. We looked at porn addiction recovery, dopamine detox, men's mental health, breaking bad habits, benefits of quitting porn, how to break lust, how to quit lust. We looked at men's masculinity, male masculinity. Then our feed was everything about becoming a better man, quitting lust, quitting porn. It was filled with self-development creators, religious creators, et cetera. You do this, as you like posts, you comment, you save, and then also on top of that, it's really important to click three dots and say, not interested for posts, you're not interested in. Another thing I'd highly recommend is reposting videos and leave comments. You might think that like comment, engage, save, share, et cetera is enough. I really recommend reposting and leaving comments because then actually TikTok will be like, okay, this is a real person. You're acting like a consumer on the algorithm. You're going to get trusted by TikTok, and then they're actually going to push your videos because you are playing their game. As I said before, mark any content as not interested to train the algorithm that you're not interested in those accounts. After four days, you need to scroll through your 4u page and out of 10 videos, eat and need to be in your niche. If you eat in your niche, which is 80% of your 4u page, then you are good. You are ready to post. I highly recommend posting two to three times a day, morning, lunch after noon. We should have spread out at least four or five hours. Your set, man, or girls. The last thing I'd say is you want to keep it warm. This is maintenance. Especially when you're posting, don't just open the app, post your video, delete it. Open the app, scroll for a minute or two, post a video, scroll for a minute, two, send a comment, and then you're good. Spend some time engaging in the niche videos, maybe liking, commenting, reposting videos, so that TikTok always thinks that you are an actual person. If you are getting under 100 views consistently, you are probably getting shadow band and TikTok does not think you are a real person, so you might want to create a new account and warm it up. We've already gone over this, but post three videos a day. Max, I would do his four, but I really think you guys should sit in the two to three days. Two to three videos a day, sweet spot. I would space them at least two hours apart, but I recommend four to five. Post before 10AM and then add captions, hashtags, and on screen text. When it comes to on screen text, talk to that before, on screen hooks that you guys have seen, hashtags, any relevant hashtags in your niche, and then captions, I always like to say quit a corn emoji with at quitter app, and so depending on your app, does the value is, you can just tag your app in there and make sure that it's being pushed. Lastly, look, just summarizing this. You want a three to four days of engaging in wanting to be your account. Your four-upage needs to be 80% of content, begin posting, and then make sure you engage every single day to maintain trust and growth. At the end of the day, this will help you be best prepared to rip millions of views and drive downloads and growth for your app guys. That is how to warm up your organic accounts and make sure you can also use this. Make sure you guys know that you can also use this for faceless. To warm up your accounts for faceless. So let's rip.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 3.04,
      "text": "Alright, here we go."
    },
    {
      "start": 3.04,
      "end": 7.640000000000001,
      "text": "Now that you know the types of organic content, how to set up your actual profiles, which"
    },
    {
      "start": 7.640000000000001,
      "end": 13.76,
      "text": "was pretty short for a minute long, let's talk about how to get set up for organic accounts"
    },
    {
      "start": 13.76,
      "end": 16.04,
      "text": "and how to actually warm them up properly."
    },
    {
      "start": 16.04,
      "end": 20.240000000000002,
      "text": "I highly suggest doing this for anything with organic volume posting."
    },
    {
      "start": 20.240000000000002,
      "end": 25.12,
      "text": "That means you are making multiple TikTok accounts and posting two, three times a day"
    },
    {
      "start": 25.12,
      "end": 27.16,
      "text": "or faceless, which is the same thing."
    },
    {
      "start": 27.16,
      "end": 31.68,
      "text": "You are posting two, three times a day, but just with the edited content."
    },
    {
      "start": 31.68,
      "end": 38.0,
      "text": "Now, the first thing is obviously download TikTok and create your account."
    },
    {
      "start": 38.0,
      "end": 41.56,
      "text": "Even if you are launching in a week, two, three, four weeks, I would download TikTok"
    },
    {
      "start": 41.56,
      "end": 45.040000000000006,
      "text": "right away, make sure your account is warm, and start making videos that you actually"
    },
    {
      "start": 45.040000000000006,
      "end": 46.92,
      "text": "get comfortable doing this."
    },
    {
      "start": 46.92,
      "end": 50.68000000000001,
      "text": "When it comes to your user names, alright, here's the deal."
    },
    {
      "start": 50.68000000000001,
      "end": 51.68000000000001,
      "text": "Make it something organic."
    },
    {
      "start": 51.68000000000001,
      "end": 53.08,
      "text": "I gave an example for Quitter."
    },
    {
      "start": 53.16,
      "end": 56.04,
      "text": "So, your name was Jack, Quitwood Jack, Jack."
    },
    {
      "start": 56.04,
      "end": 61.36,
      "text": "Quitter, Jack's Journey, or you could even just do Jack Jones 1, 2, 3."
    },
    {
      "start": 61.36,
      "end": 62.92,
      "text": "Make it simple."
    },
    {
      "start": 62.92,
      "end": 65.36,
      "text": "You don't need to overthink it."
    },
    {
      "start": 65.36,
      "end": 67.2,
      "text": "I would just use a first name, last name."
    },
    {
      "start": 67.2,
      "end": 70.75999999999999,
      "text": "You can even make it a fake name, and I would make it a clear profile picture."
    },
    {
      "start": 70.75999999999999,
      "end": 75.48,
      "text": "When it comes to the bio, I think you can do really anything you want."
    },
    {
      "start": 75.48,
      "end": 79.64,
      "text": "I've seen a lot of people do like my journey to quitting."
    },
    {
      "start": 79.64,
      "end": 82.0,
      "text": "Just no shame to support."
    },
    {
      "start": 82.0,
      "end": 86.76,
      "text": "It's actually something someone usefully enough in our Discord community for organic content."
    },
    {
      "start": 86.76,
      "end": 89.72,
      "text": "Sounds like AI, so maybe they use that."
    },
    {
      "start": 89.72,
      "end": 93.48,
      "text": "But you don't want the profile to look like a scam, like an ad."
    },
    {
      "start": 93.48,
      "end": 95.72,
      "text": "You want to make it look like a real person."
    },
    {
      "start": 95.72,
      "end": 100.36,
      "text": "When it comes to the timeline of warming up your account, here's what you do."
    },
    {
      "start": 100.36,
      "end": 105.84,
      "text": "You need to take three to four days and give it a commitment of at least 15 minutes a day,"
    },
    {
      "start": 105.84,
      "end": 110.32000000000001,
      "text": "morning, lunch, afternoon, evening."
    },
    {
      "start": 110.32000000000001,
      "end": 115.44,
      "text": "What you're going to be doing is searching up content like in Contemplating Gaging."
    },
    {
      "start": 115.44,
      "end": 122.92,
      "text": "For 15 minutes, or it's 45 minutes a day, or 30 to 45 minutes a day, split up three times."
    },
    {
      "start": 122.92,
      "end": 126.56,
      "text": "Just make sure TikTok knows you, thinks you're an actual account, and trust you."
    },
    {
      "start": 126.56,
      "end": 128.56,
      "text": "When it comes to this, I gave an example for Quitter."
    },
    {
      "start": 128.56,
      "end": 130.16,
      "text": "I think it's the best thing to do."
    },
    {
      "start": 130.16,
      "end": 133.76,
      "text": "I'll actually just give examples of what we were doing."
    },
    {
      "start": 133.76,
      "end": 138.23999999999998,
      "text": "We looked at porn addiction recovery, dopamine detox, men's mental health, breaking bad habits,"
    },
    {
      "start": 138.23999999999998,
      "end": 143.28,
      "text": "benefits of quitting porn, how to break lust, how to quit lust."
    },
    {
      "start": 143.28,
      "end": 149.56,
      "text": "We looked at men's masculinity, male masculinity."
    },
    {
      "start": 149.56,
      "end": 154.2,
      "text": "Then our feed was everything about becoming a better man, quitting lust, quitting porn."
    },
    {
      "start": 154.2,
      "end": 157.35999999999999,
      "text": "It was filled with self-development creators, religious creators, et cetera."
    },
    {
      "start": 157.35999999999999,
      "end": 161.32,
      "text": "You do this, as you like posts, you comment, you save, and then also on top of that, it's"
    },
    {
      "start": 161.32,
      "end": 165.32,
      "text": "really important to click three dots and say, not interested for posts, you're not interested"
    },
    {
      "start": 165.32,
      "end": 168.4,
      "text": "in."
    },
    {
      "start": 168.4,
      "end": 174.44,
      "text": "Another thing I'd highly recommend is reposting videos and leave comments."
    },
    {
      "start": 174.44,
      "end": 178.76,
      "text": "You might think that like comment, engage, save, share, et cetera is enough."
    },
    {
      "start": 178.76,
      "end": 183.88,
      "text": "I really recommend reposting and leaving comments because then actually TikTok will be like,"
    },
    {
      "start": 183.88,
      "end": 185.16,
      "text": "okay, this is a real person."
    },
    {
      "start": 185.16,
      "end": 187.64,
      "text": "You're acting like a consumer on the algorithm."
    },
    {
      "start": 187.64,
      "end": 190.32,
      "text": "You're going to get trusted by TikTok, and then they're actually going to push your videos"
    },
    {
      "start": 190.32,
      "end": 192.79999999999998,
      "text": "because you are playing their game."
    },
    {
      "start": 192.79999999999998,
      "end": 196.76,
      "text": "As I said before, mark any content as not interested to train the algorithm that you're"
    },
    {
      "start": 196.76,
      "end": 199.88,
      "text": "not interested in those accounts."
    },
    {
      "start": 199.88,
      "end": 203.84,
      "text": "After four days, you need to scroll through your 4u page and out of 10 videos, eat and"
    },
    {
      "start": 203.84,
      "end": 204.84,
      "text": "need to be in your niche."
    },
    {
      "start": 204.84,
      "end": 209.0,
      "text": "If you eat in your niche, which is 80% of your 4u page, then you are good."
    },
    {
      "start": 209.0,
      "end": 210.48,
      "text": "You are ready to post."
    },
    {
      "start": 210.48,
      "end": 216.32,
      "text": "I highly recommend posting two to three times a day, morning, lunch after noon."
    },
    {
      "start": 216.32,
      "end": 220.56,
      "text": "We should have spread out at least four or five hours."
    },
    {
      "start": 220.56,
      "end": 223.56,
      "text": "Your set, man, or girls."
    },
    {
      "start": 223.56,
      "end": 225.84,
      "text": "The last thing I'd say is you want to keep it warm."
    },
    {
      "start": 225.84,
      "end": 226.84,
      "text": "This is maintenance."
    },
    {
      "start": 226.84,
      "end": 230.48,
      "text": "Especially when you're posting, don't just open the app, post your video, delete it."
    },
    {
      "start": 230.48,
      "end": 233.88,
      "text": "Open the app, scroll for a minute or two, post a video, scroll for a minute, two, send"
    },
    {
      "start": 233.88,
      "end": 235.4,
      "text": "a comment, and then you're good."
    },
    {
      "start": 235.4,
      "end": 240.32,
      "text": "Spend some time engaging in the niche videos, maybe liking, commenting, reposting videos,"
    },
    {
      "start": 240.32,
      "end": 244.95999999999998,
      "text": "so that TikTok always thinks that you are an actual person."
    },
    {
      "start": 244.96,
      "end": 251.42000000000002,
      "text": "If you are getting under 100 views consistently, you are probably getting shadow band and"
    },
    {
      "start": 251.42000000000002,
      "end": 254.72,
      "text": "TikTok does not think you are a real person, so you might want to create a new account"
    },
    {
      "start": 254.72,
      "end": 256.96000000000004,
      "text": "and warm it up."
    },
    {
      "start": 256.96000000000004,
      "end": 261.24,
      "text": "We've already gone over this, but post three videos a day."
    },
    {
      "start": 261.24,
      "end": 265.40000000000003,
      "text": "Max, I would do his four, but I really think you guys should sit in the two to three days."
    },
    {
      "start": 265.40000000000003,
      "end": 267.16,
      "text": "Two to three videos a day, sweet spot."
    },
    {
      "start": 267.16,
      "end": 271.56,
      "text": "I would space them at least two hours apart, but I recommend four to five."
    },
    {
      "start": 271.56,
      "end": 276.16,
      "text": "Post before 10AM and then add captions, hashtags, and on screen text."
    },
    {
      "start": 276.16,
      "end": 279.48,
      "text": "When it comes to on screen text, talk to that before, on screen hooks that you guys have"
    },
    {
      "start": 279.48,
      "end": 284.48,
      "text": "seen, hashtags, any relevant hashtags in your niche, and then captions, I always like to"
    },
    {
      "start": 284.48,
      "end": 290.08,
      "text": "say quit a corn emoji with at quitter app, and so depending on your app, does the value"
    },
    {
      "start": 290.08,
      "end": 296.4,
      "text": "is, you can just tag your app in there and make sure that it's being pushed."
    },
    {
      "start": 296.4,
      "end": 299.0,
      "text": "Lastly, look, just summarizing this."
    },
    {
      "start": 299.0,
      "end": 302.64,
      "text": "You want a three to four days of engaging in wanting to be your account."
    },
    {
      "start": 302.64,
      "end": 306.91999999999996,
      "text": "Your four-upage needs to be 80% of content, begin posting, and then make sure you engage"
    },
    {
      "start": 306.91999999999996,
      "end": 309.56,
      "text": "every single day to maintain trust and growth."
    },
    {
      "start": 309.56,
      "end": 314.91999999999996,
      "text": "At the end of the day, this will help you be best prepared to rip millions of views and"
    },
    {
      "start": 314.91999999999996,
      "end": 318.91999999999996,
      "text": "drive downloads and growth for your app guys."
    },
    {
      "start": 318.91999999999996,
      "end": 325.08,
      "text": "That is how to warm up your organic accounts and make sure you can also use this."
    },
    {
      "start": 325.08,
      "end": 328.8,
      "text": "Make sure you guys know that you can also use this for faceless."
    },
    {
      "start": 328.8,
      "end": 331.15999999999997,
      "text": "To warm up your accounts for faceless."
    },
    {
      "start": 331.15999999999997,
      "end": 332.68,
      "text": "So let's rip."
    }
  ]
}