{
  "file_name": "058_Lesson_58.faudio-hi-0-Default.mp4",
  "text": " All right, let's get into some ASO, also known as Apple Search Optimization. I know personally, people that run studios where their apps, the only advertising they do, is Apple Search ads and Apple Search Optimization. And together, because they work together very closely, they are doing six figures a month. And it's extremely, extremely profitable, extremely profitable because ASO is pretty much completely profitable. And then Apple Search ads, that's the only money they're spending. But that's really profitable, too. So the power, this is not something you should sleep on. A lot of people sleep on it, but ASO, honestly, I look at it as a pre-do principle type of thing. The 80-20 rule, do 20% of work that will count for 80% of the results. How it works is everything you do in your apps title description, mostly title sub-title keywords, that will affect its rankings on the app store. It will affect it when you look up your app's name, is it number one, is it number two, is it number three? It will, if your app is in a specific category, like Cali as a calorie tracker, if you look up calorie tracker, we're the fourth one that comes up. And this all comes down to Apple Search Optimization. And you could keep refining this, and month after month, do all these little tweaks that will help you improve and go up on the rankings for these different keywords over time. And a lot of people do that. Like the studio I mentioned, they're obsessed with their rankings. And they're always adapting, always doing these little tweaks, changing keywords, all the stuff that I'll get into in order to rank higher. For me, I get it as something, when you set up the app once, do it, do it right, that will account for 80% of the results you'll get. And then just leave it, honestly, don't spend more time, focus on more scalable channels. So Apple Search Optimization, how does it work? Well, have you ever wondered why we named Cali-Ey calorie tracker? It's not because we want people to know that Cali-Ey is a calorie tracker. It's because the name is the most important part to Apple categorizing your app. If we put calorie tracker in subtitle instead of in the name, then we would drop a few places on App Store rankings when you look up calorie tracker right now. Your main keywords you want to include in your name. Essentially, how it goes is there's a hierarchy of importance. So a lot of people think that the keyword section, the keyword section on your app, and sorry to jump around them, I'll go back to this in a second. But a lot of people think the keywords for your app are, and I actually hit up whatever it can. A lot of people think the keywords for your app is very important for, I'm just saying, is it sensitive to show this because competitors may watch this and they see our keywords? Is that bad? I don't think they could do much with it. We'll see what happens. I think we're okay. Yes, I think most of these keywords are actually public. Whatever. So a lot of people see these keywords and they think, okay, keywords are the only thing that matters for App Store rankings. That's not true. Keywords are pretty important, but they're the third most important thing. First is your name, second is your subtitle, and last is your keywords. And what you essentially want to do is figure out a list of all the keywords that are closest to your niche, rank them, and then start putting them in to most relevant to your name, least relevant to the keywords. But it's not just about relevancy. It's also about how saturated each keyword is because some keywords have so many apps putting in CaliTrucker. For example, in the name, and so it's very difficult to rank. Whereas if we did something like, I don't know, food counter, in the name, it's less, less people are doing that. And so it would be easier for us to rank on the App Store charts. And by rank, I literally mean, I'll show you. I literally mean if you look up CaliTrucker. Look up CaliTrucker alone, scroll down, one, my fitness pal, two, some other app, three, lose it, and four, Cali AI. And that is driving us many downloads a day. I think probably like a few hundred, honestly, it's not that many. That's why this isn't so scalable. But those few hundred downloads are making us a few hundred dollars a day, completely profitable, completely profitable. I'll just because we set this up early on. So what you'll want to do when you're setting up your app is one, it would be sick if within your actual apps name, you are strategic and include some keywords that will help you. So for us putting AI and Cali, is actually fucking incredible because if we, if our app is called like, I don't know, Cali, like Cali Pro, and we wanted our app to come up when you look up AI CaliTrucker, we couldn't write Cali Pro dash CaliTrucker. We would have to write Cali Pro dash AI CaliTrucker. And I don't even think that fits. There's a limit of like 30 characters here. And so it's very important that all of the space is very utilized. You want to basically hit everything. I think the more keywords you fit, actually the less impactful each one will be. These are some things I've learned. So that's why we don't fit like another one. And here also just looks stupid. CaliTrucker fit. So there definitely is a balance when creating the name of your app between actually sounding cool, looking like a brand and then also packing keywords in. So okay, hierarchy. You want your top keyword up there with your name. So a lot of people do the name of their app dash their main keywords subtitle second best keywords food and macro counter. Like that's kind of related to CaliTrucker. It is what it is. It's a food and macro counter. But I think in the past we had like fitness, like counter on a tracker, all the stuff. But we realized those keywords actually weren't. They weren't as they didn't get as many searches. And by the way, all of this you can check in at twiek.com. It has some kind of so keywords. You can for different keywords, you like search them. I have to cost money. I think there's a free trial. But you can see the volume of how many people are searching it per month. So CaliTrucker 100 100,000 people search that every single month. The difficulty is 43. It's pretty high. A lot of people use it. And CaliTrucker is number four. Okay. It's estimating that CaliTrucker we get 2,700 downloads from CaliTrucker every single month and 4,640 from CaliTrucker. So we make about $3 in profit per download. So that is like almost 20K in just pure profit just because we have these terms. So great. We have our title subtitle. And by the way, you do not want to use the same keywords over and over. If you put, if I put CaliTrucker in subtitle, it will assume it will act as if it wasn't a name. It will act as if it was only in the subtitle. So it would lower the importance. So you only want to say a keyword and each word is used as a keyword. So how it works is within this, you might only think there's like 1, 2, 3, 4, 5, 6, 7, different keyword pairs. There's just 7 different words. But how it actually works is it matches up all these words. So if you look up food CaliTrucker, that will, we will be in that ranking. If you look up macro CaliTrucker, we will be in that ranking. If you look up counter CaliTrucker, we'll be in that ranking. If you look up CaliAI macro counter, it essentially just like merges all the possible permutations of your keywords, placing preference to name, then subtitle and keywords. So you'll want to fit not necessarily as many as you can, but you'll want to keep it clean for the nice, brand aesthetic while putting your most important ones in the name and subtitle. You should not just try to fill it mostly. I feel like 10 spaces left over. We may actually want to add another one for CaliI. It seems like I'm missed opportunity. So then the last place is your keywords and here. It's very important. You don't want to put a space in between each one. You want to put a comma in between each word to be, because that's how you separate it. You separate it with commas. But a lot of people will do comma space and then that just loses you a character. So don't put spaces and you'll get more keywords. And then you just want to squeeze as many. And remember, do not repeat from the subtitle or the type. Just fit as many as you can. If you're looking for keywords, AppTweek is a great place to find some keywords to use. You can look at your competitors, see what keywords they use. And that's pretty helpful. Or you can just raw dog out of your head. If you're just trying to launch and get it out quick and sure, but I would go back, I would use some of these keyword tools. You could also use search out optimization, which I showed in one of the previous modules. And that has a keyword finder as well. So that's a very important step of ASO is the title, subtitle and keywords. Remember that the next important thing is the app icon and AppSource screenshots. What we just went through the title, subtitle keywords, this will help your app rank for these different keywords. This will help your app show up. Once someone actually looks it up, once someone looks up CaliTrocker, what will make them click on yours rather than someone else's? This primarily comes down to the icon and screenshots. So for us, our screenshots are honestly not the best in my opinion. The thing is, these are literally the screenshots that we started the app with. Or maybe like a month after launching we changed to these. However, we haven't been able to beat them for some reason. We've done all these iterations. I think it's partially a problem with Apple's AB testing software for AB testing screenshots. What you could do, by the way, in the product page optimization, which is all about app store optimization, you could run some tests where you AB tests are running screenshots. And we tried all this stuff, like putting AI CaliTrocker really big. Because essentially theories say you want like three words max really big at the top, then some visuals and like just big, catchy headlines for every screenshot. But for us, for some reason, our more raw screenshots that we built very early on have just been winning every single test. And we're still working on improving it. But I would keep in mind that I mean, even these like they're not bad screenshots. What you want is usually a visual of the app show clearly what it does. And try to make it short and snappy. Like this is too long in my opinion. It's working right now, but we're working on fixing the headlines. Make CaliTrocker easy with AI. Just have a picture of your food and let's do the rest. Only three screenshots are shown until someone clicks into your app. So the first, the were the most important. And ideally they can kind of tell a story together. Just have a picture. Then let us do the rest. Tell us a story. They need each other. They can't really stand alone. So that's important. You could actually see your app store, your conversion rate in the analytics page. And the conversion rate means how many people see your app and then we'll click on it. Leave the conversion rate. Yeah, so it's hours out of the people that see it about 21% will click into the page. Not necessarily download it, but just click into the page. Oh, okay, it actually downloads out of people that clicked into it. So my bad 21% of people like go to the Cali app page will download it. All of these numbers that we've actually had are very skewed. I've noticed because of influencer marketing, most people that run paid ads have like different numbers. They're like, wow, your numbers are either really, our numbers are either really bad or really good to these people. But it's just all skewed and a little different because we have influencers promoting it. And it's not paid ads going like directly to the page with maybe higher intent or lower intent sometimes. So the last thing that's important is the icon super, super important. So just up here. The icon and the screenshots both can have a significant effect on the conversion rate. This icon we used to just have the apple. We used to just have it. You can look in our. Okay, you see this. Metadata history. So our old logo was just the apple. And then we added the scan lines because we hypothesized, all right, if we add the scan lines, we'll tell the user that you're actually taking the picture. It's scanning something. It's not just an apple. You understand more of what the app may be doing. And that alone boosted the conversion rate 7%, which is huge. It's massive. So do not underestimate the power of your icons and screenshots in these small tweaks. You want to try to show what the app does in the most clean way possible. Okay. So this is very high level app store optimization breakdown of it. If you're interested in learning more, I actually attached. There are all kinds of great articles by app tweak on this topic. And if you go to their start as a section, they break down so much about best practices for screenshots, how to a B test app icon design keywords. And I would definitely recommend reading them. It's definitely worth it to get a deeper understanding. But with this, you should be able to start making money. This is, yeah, this is the app store optimization section. It's a quick one, not too much involved, not as complicated as the other ones. But it's very, very profitable. So with that, I'm out.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 6.6000000000000005,
      "text": "All right, let's get into some ASO, also known as Apple Search Optimization."
    },
    {
      "start": 6.6000000000000005,
      "end": 13.280000000000001,
      "text": "I know personally, people that run studios where their apps, the only advertising they"
    },
    {
      "start": 13.280000000000001,
      "end": 18.0,
      "text": "do, is Apple Search ads and Apple Search Optimization."
    },
    {
      "start": 18.0,
      "end": 23.84,
      "text": "And together, because they work together very closely, they are doing six figures a month."
    },
    {
      "start": 23.84,
      "end": 29.48,
      "text": "And it's extremely, extremely profitable, extremely profitable because ASO is pretty much"
    },
    {
      "start": 29.48,
      "end": 30.48,
      "text": "completely profitable."
    },
    {
      "start": 30.48,
      "end": 33.4,
      "text": "And then Apple Search ads, that's the only money they're spending."
    },
    {
      "start": 33.4,
      "end": 37.08,
      "text": "But that's really profitable, too."
    },
    {
      "start": 37.08,
      "end": 39.4,
      "text": "So the power, this is not something you should sleep on."
    },
    {
      "start": 39.4,
      "end": 45.879999999999995,
      "text": "A lot of people sleep on it, but ASO, honestly, I look at it as a pre-do principle type of thing."
    },
    {
      "start": 45.879999999999995,
      "end": 52.44,
      "text": "The 80-20 rule, do 20% of work that will count for 80% of the results."
    },
    {
      "start": 52.44,
      "end": 61.36,
      "text": "How it works is everything you do in your apps title description, mostly title sub-title"
    },
    {
      "start": 61.36,
      "end": 65.36,
      "text": "keywords, that will affect its rankings on the app store."
    },
    {
      "start": 65.36,
      "end": 68.88,
      "text": "It will affect it when you look up your app's name, is it number one, is it number two,"
    },
    {
      "start": 68.88,
      "end": 70.2,
      "text": "is it number three?"
    },
    {
      "start": 70.2,
      "end": 74.47999999999999,
      "text": "It will, if your app is in a specific category, like Cali as a calorie tracker, if you look"
    },
    {
      "start": 74.47999999999999,
      "end": 77.88,
      "text": "up calorie tracker, we're the fourth one that comes up."
    },
    {
      "start": 77.88,
      "end": 80.84,
      "text": "And this all comes down to Apple Search Optimization."
    },
    {
      "start": 80.84,
      "end": 86.08,
      "text": "And you could keep refining this, and month after month, do all these little tweaks that"
    },
    {
      "start": 86.08,
      "end": 93.28,
      "text": "will help you improve and go up on the rankings for these different keywords over time."
    },
    {
      "start": 93.28,
      "end": 94.76,
      "text": "And a lot of people do that."
    },
    {
      "start": 94.76,
      "end": 99.28,
      "text": "Like the studio I mentioned, they're obsessed with their rankings."
    },
    {
      "start": 99.28,
      "end": 104.32000000000001,
      "text": "And they're always adapting, always doing these little tweaks, changing keywords, all the"
    },
    {
      "start": 104.32000000000001,
      "end": 109.4,
      "text": "stuff that I'll get into in order to rank higher."
    },
    {
      "start": 109.4,
      "end": 114.60000000000001,
      "text": "For me, I get it as something, when you set up the app once, do it, do it right, that"
    },
    {
      "start": 114.60000000000001,
      "end": 117.84,
      "text": "will account for 80% of the results you'll get."
    },
    {
      "start": 117.84,
      "end": 122.84,
      "text": "And then just leave it, honestly, don't spend more time, focus on more scalable channels."
    },
    {
      "start": 122.84,
      "end": 127.84,
      "text": "So Apple Search Optimization, how does it work?"
    },
    {
      "start": 127.84,
      "end": 134.64000000000001,
      "text": "Well, have you ever wondered why we named Cali-Ey calorie tracker?"
    },
    {
      "start": 135.6,
      "end": 139.44,
      "text": "It's not because we want people to know that Cali-Ey is a calorie tracker."
    },
    {
      "start": 139.44,
      "end": 146.6,
      "text": "It's because the name is the most important part to Apple categorizing your app."
    },
    {
      "start": 146.6,
      "end": 155.32,
      "text": "If we put calorie tracker in subtitle instead of in the name, then we would drop a few places"
    },
    {
      "start": 155.32,
      "end": 161.16,
      "text": "on App Store rankings when you look up calorie tracker right now."
    },
    {
      "start": 161.16,
      "end": 165.35999999999999,
      "text": "Your main keywords you want to include in your name."
    },
    {
      "start": 165.35999999999999,
      "end": 169.56,
      "text": "Essentially, how it goes is there's a hierarchy of importance."
    },
    {
      "start": 169.56,
      "end": 175.35999999999999,
      "text": "So a lot of people think that the keyword section, the keyword section on your app, and"
    },
    {
      "start": 175.35999999999999,
      "end": 180.44,
      "text": "sorry to jump around them, I'll go back to this in a second."
    },
    {
      "start": 180.44,
      "end": 187.64,
      "text": "But a lot of people think the keywords for your app are, and I actually hit up whatever"
    },
    {
      "start": 187.64,
      "end": 188.64,
      "text": "it can."
    },
    {
      "start": 188.64,
      "end": 197.0,
      "text": "A lot of people think the keywords for your app is very important for, I'm just saying,"
    },
    {
      "start": 197.0,
      "end": 201.39999999999998,
      "text": "is it sensitive to show this because competitors may watch this and they see our keywords?"
    },
    {
      "start": 201.39999999999998,
      "end": 203.39999999999998,
      "text": "Is that bad?"
    },
    {
      "start": 203.39999999999998,
      "end": 214.27999999999997,
      "text": "I don't think they could do much with it."
    },
    {
      "start": 215.28,
      "end": 217.0,
      "text": "We'll see what happens."
    },
    {
      "start": 217.0,
      "end": 219.0,
      "text": "I think we're okay."
    },
    {
      "start": 219.0,
      "end": 227.4,
      "text": "Yes, I think most of these keywords are actually public."
    },
    {
      "start": 227.4,
      "end": 229.24,
      "text": "Whatever."
    },
    {
      "start": 229.24,
      "end": 233.6,
      "text": "So a lot of people see these keywords and they think, okay, keywords are the only thing"
    },
    {
      "start": 233.6,
      "end": 237.08,
      "text": "that matters for App Store rankings."
    },
    {
      "start": 237.08,
      "end": 238.72,
      "text": "That's not true."
    },
    {
      "start": 238.72,
      "end": 242.96,
      "text": "Keywords are pretty important, but they're the third most important thing."
    },
    {
      "start": 242.96,
      "end": 249.4,
      "text": "First is your name, second is your subtitle, and last is your keywords."
    },
    {
      "start": 249.4,
      "end": 257.64,
      "text": "And what you essentially want to do is figure out a list of all the keywords that are closest"
    },
    {
      "start": 257.64,
      "end": 264.04,
      "text": "to your niche, rank them, and then start putting them in to most relevant to your name,"
    },
    {
      "start": 264.04,
      "end": 265.92,
      "text": "least relevant to the keywords."
    },
    {
      "start": 265.92,
      "end": 268.40000000000003,
      "text": "But it's not just about relevancy."
    },
    {
      "start": 268.4,
      "end": 274.88,
      "text": "It's also about how saturated each keyword is because some keywords have so many apps"
    },
    {
      "start": 274.88,
      "end": 276.12,
      "text": "putting in CaliTrucker."
    },
    {
      "start": 276.12,
      "end": 280.52,
      "text": "For example, in the name, and so it's very difficult to rank."
    },
    {
      "start": 280.52,
      "end": 286.35999999999996,
      "text": "Whereas if we did something like, I don't know, food counter, in the name, it's less,"
    },
    {
      "start": 286.35999999999996,
      "end": 287.35999999999996,
      "text": "less people are doing that."
    },
    {
      "start": 287.35999999999996,
      "end": 292.67999999999995,
      "text": "And so it would be easier for us to rank on the App Store charts."
    },
    {
      "start": 292.67999999999995,
      "end": 296.4,
      "text": "And by rank, I literally mean, I'll show you."
    },
    {
      "start": 296.4,
      "end": 303.0,
      "text": "I literally mean if you look up CaliTrucker."
    },
    {
      "start": 303.0,
      "end": 308.32,
      "text": "Look up CaliTrucker alone, scroll down, one, my fitness pal, two, some other app, three,"
    },
    {
      "start": 308.32,
      "end": 312.64,
      "text": "lose it, and four, Cali AI."
    },
    {
      "start": 312.64,
      "end": 318.47999999999996,
      "text": "And that is driving us many downloads a day."
    },
    {
      "start": 318.47999999999996,
      "end": 322.23999999999995,
      "text": "I think probably like a few hundred, honestly, it's not that many."
    },
    {
      "start": 322.23999999999995,
      "end": 324.03999999999996,
      "text": "That's why this isn't so scalable."
    },
    {
      "start": 324.04,
      "end": 329.72,
      "text": "But those few hundred downloads are making us a few hundred dollars a day, completely"
    },
    {
      "start": 329.72,
      "end": 331.88,
      "text": "profitable, completely profitable."
    },
    {
      "start": 331.88,
      "end": 334.52000000000004,
      "text": "I'll just because we set this up early on."
    },
    {
      "start": 334.52000000000004,
      "end": 340.88,
      "text": "So what you'll want to do when you're setting up your app is one, it would be sick if within"
    },
    {
      "start": 340.88,
      "end": 345.92,
      "text": "your actual apps name, you are strategic and include some keywords that will help you."
    },
    {
      "start": 345.92,
      "end": 352.12,
      "text": "So for us putting AI and Cali, is actually fucking incredible because if we, if our app"
    },
    {
      "start": 352.12,
      "end": 360.48,
      "text": "is called like, I don't know, Cali, like Cali Pro, and we wanted our app to come up when"
    },
    {
      "start": 360.48,
      "end": 364.4,
      "text": "you look up AI CaliTrucker, we couldn't write Cali Pro dash CaliTrucker."
    },
    {
      "start": 364.4,
      "end": 367.28000000000003,
      "text": "We would have to write Cali Pro dash AI CaliTrucker."
    },
    {
      "start": 367.28000000000003,
      "end": 368.6,
      "text": "And I don't even think that fits."
    },
    {
      "start": 368.6,
      "end": 371.48,
      "text": "There's a limit of like 30 characters here."
    },
    {
      "start": 371.48,
      "end": 377.76,
      "text": "And so it's very important that all of the space is very utilized."
    },
    {
      "start": 377.76,
      "end": 380.8,
      "text": "You want to basically hit everything."
    },
    {
      "start": 380.8,
      "end": 385.32,
      "text": "I think the more keywords you fit, actually the less impactful each one will be."
    },
    {
      "start": 385.32,
      "end": 387.36,
      "text": "These are some things I've learned."
    },
    {
      "start": 387.36,
      "end": 390.16,
      "text": "So that's why we don't fit like another one."
    },
    {
      "start": 390.16,
      "end": 391.52000000000004,
      "text": "And here also just looks stupid."
    },
    {
      "start": 391.52000000000004,
      "end": 394.28000000000003,
      "text": "CaliTrucker fit."
    },
    {
      "start": 394.28000000000003,
      "end": 399.48,
      "text": "So there definitely is a balance when creating the name of your app between actually sounding"
    },
    {
      "start": 399.48,
      "end": 405.68,
      "text": "cool, looking like a brand and then also packing keywords in."
    },
    {
      "start": 405.68,
      "end": 406.68,
      "text": "So okay, hierarchy."
    },
    {
      "start": 406.68,
      "end": 409.2,
      "text": "You want your top keyword up there with your name."
    },
    {
      "start": 409.2,
      "end": 415.03999999999996,
      "text": "So a lot of people do the name of their app dash their main keywords subtitle second"
    },
    {
      "start": 415.03999999999996,
      "end": 419.56,
      "text": "best keywords food and macro counter."
    },
    {
      "start": 419.56,
      "end": 421.68,
      "text": "Like that's kind of related to CaliTrucker."
    },
    {
      "start": 421.68,
      "end": 422.68,
      "text": "It is what it is."
    },
    {
      "start": 422.68,
      "end": 424.88,
      "text": "It's a food and macro counter."
    },
    {
      "start": 424.88,
      "end": 431.84,
      "text": "But I think in the past we had like fitness, like counter on a tracker, all the stuff."
    },
    {
      "start": 431.84,
      "end": 435.32,
      "text": "But we realized those keywords actually weren't."
    },
    {
      "start": 435.32,
      "end": 439.03999999999996,
      "text": "They weren't as they didn't get as many searches."
    },
    {
      "start": 439.04,
      "end": 444.68,
      "text": "And by the way, all of this you can check in at twiek.com."
    },
    {
      "start": 444.68,
      "end": 451.48,
      "text": "It has some kind of so keywords."
    },
    {
      "start": 451.48,
      "end": 455.24,
      "text": "You can for different keywords, you like search them."
    },
    {
      "start": 455.24,
      "end": 456.24,
      "text": "I have to cost money."
    },
    {
      "start": 456.24,
      "end": 457.84000000000003,
      "text": "I think there's a free trial."
    },
    {
      "start": 457.84000000000003,
      "end": 461.84000000000003,
      "text": "But you can see the volume of how many people are searching it per month."
    },
    {
      "start": 461.84000000000003,
      "end": 468.84000000000003,
      "text": "So CaliTrucker 100 100,000 people search that every single month."
    },
    {
      "start": 468.84,
      "end": 470.44,
      "text": "The difficulty is 43."
    },
    {
      "start": 470.44,
      "end": 471.44,
      "text": "It's pretty high."
    },
    {
      "start": 471.44,
      "end": 474.88,
      "text": "A lot of people use it."
    },
    {
      "start": 474.88,
      "end": 477.28,
      "text": "And CaliTrucker is number four."
    },
    {
      "start": 477.28,
      "end": 478.28,
      "text": "Okay."
    },
    {
      "start": 478.28,
      "end": 482.67999999999995,
      "text": "It's estimating that CaliTrucker we get 2,700 downloads from CaliTrucker every single"
    },
    {
      "start": 482.67999999999995,
      "end": 487.4,
      "text": "month and 4,640 from CaliTrucker."
    },
    {
      "start": 487.4,
      "end": 491.23999999999995,
      "text": "So we make about $3 in profit per download."
    },
    {
      "start": 491.23999999999995,
      "end": 498.23999999999995,
      "text": "So that is like almost 20K in just pure profit just because we have these terms."
    },
    {
      "start": 499.08,
      "end": 501.36,
      "text": "So great."
    },
    {
      "start": 501.36,
      "end": 503.64,
      "text": "We have our title subtitle."
    },
    {
      "start": 503.64,
      "end": 507.56,
      "text": "And by the way, you do not want to use the same keywords over and over."
    },
    {
      "start": 507.56,
      "end": 513.36,
      "text": "If you put, if I put CaliTrucker in subtitle, it will assume it will act as if it wasn't"
    },
    {
      "start": 513.36,
      "end": 514.36,
      "text": "a name."
    },
    {
      "start": 514.36,
      "end": 516.08,
      "text": "It will act as if it was only in the subtitle."
    },
    {
      "start": 516.08,
      "end": 518.24,
      "text": "So it would lower the importance."
    },
    {
      "start": 518.24,
      "end": 524.32,
      "text": "So you only want to say a keyword and each word is used as a keyword."
    },
    {
      "start": 524.32,
      "end": 535.0400000000001,
      "text": "So how it works is within this, you might only think there's like 1, 2, 3, 4, 5, 6, 7,"
    },
    {
      "start": 535.0400000000001,
      "end": 536.5200000000001,
      "text": "different keyword pairs."
    },
    {
      "start": 536.5200000000001,
      "end": 539.0400000000001,
      "text": "There's just 7 different words."
    },
    {
      "start": 539.0400000000001,
      "end": 542.32,
      "text": "But how it actually works is it matches up all these words."
    },
    {
      "start": 542.32,
      "end": 546.84,
      "text": "So if you look up food CaliTrucker, that will, we will be in that ranking."
    },
    {
      "start": 546.84,
      "end": 550.0,
      "text": "If you look up macro CaliTrucker, we will be in that ranking."
    },
    {
      "start": 550.0,
      "end": 552.5200000000001,
      "text": "If you look up counter CaliTrucker, we'll be in that ranking."
    },
    {
      "start": 552.52,
      "end": 558.88,
      "text": "If you look up CaliAI macro counter, it essentially just like merges all the possible permutations"
    },
    {
      "start": 558.88,
      "end": 566.4,
      "text": "of your keywords, placing preference to name, then subtitle and keywords."
    },
    {
      "start": 566.4,
      "end": 571.88,
      "text": "So you'll want to fit not necessarily as many as you can, but you'll want to keep it clean"
    },
    {
      "start": 571.88,
      "end": 576.16,
      "text": "for the nice, brand aesthetic while putting your most important ones in the name and subtitle."
    },
    {
      "start": 576.16,
      "end": 579.68,
      "text": "You should not just try to fill it mostly."
    },
    {
      "start": 579.68,
      "end": 582.56,
      "text": "I feel like 10 spaces left over."
    },
    {
      "start": 582.56,
      "end": 584.52,
      "text": "We may actually want to add another one for CaliI."
    },
    {
      "start": 584.52,
      "end": 588.28,
      "text": "It seems like I'm missed opportunity."
    },
    {
      "start": 588.28,
      "end": 591.7199999999999,
      "text": "So then the last place is your keywords and here."
    },
    {
      "start": 591.7199999999999,
      "end": 592.7199999999999,
      "text": "It's very important."
    },
    {
      "start": 592.7199999999999,
      "end": 595.4,
      "text": "You don't want to put a space in between each one."
    },
    {
      "start": 595.4,
      "end": 603.48,
      "text": "You want to put a comma in between each word to be, because that's how you separate it."
    },
    {
      "start": 603.48,
      "end": 604.48,
      "text": "You separate it with commas."
    },
    {
      "start": 604.48,
      "end": 608.8000000000001,
      "text": "But a lot of people will do comma space and then that just loses you a character."
    },
    {
      "start": 608.8000000000001,
      "end": 612.36,
      "text": "So don't put spaces and you'll get more keywords."
    },
    {
      "start": 612.36,
      "end": 613.6,
      "text": "And then you just want to squeeze as many."
    },
    {
      "start": 613.6,
      "end": 617.2,
      "text": "And remember, do not repeat from the subtitle or the type."
    },
    {
      "start": 617.2,
      "end": 618.6800000000001,
      "text": "Just fit as many as you can."
    },
    {
      "start": 618.6800000000001,
      "end": 623.8000000000001,
      "text": "If you're looking for keywords, AppTweek is a great place to find some keywords to use."
    },
    {
      "start": 623.8000000000001,
      "end": 627.6800000000001,
      "text": "You can look at your competitors, see what keywords they use."
    },
    {
      "start": 627.6800000000001,
      "end": 631.64,
      "text": "And that's pretty helpful."
    },
    {
      "start": 631.64,
      "end": 634.56,
      "text": "Or you can just raw dog out of your head."
    },
    {
      "start": 634.56,
      "end": 638.24,
      "text": "If you're just trying to launch and get it out quick and sure, but I would go back, I"
    },
    {
      "start": 638.24,
      "end": 640.84,
      "text": "would use some of these keyword tools."
    },
    {
      "start": 640.84,
      "end": 645.16,
      "text": "You could also use search out optimization, which I showed in one of the previous modules."
    },
    {
      "start": 645.16,
      "end": 651.48,
      "text": "And that has a keyword finder as well."
    },
    {
      "start": 651.48,
      "end": 658.36,
      "text": "So that's a very important step of ASO is the title, subtitle and keywords."
    },
    {
      "start": 658.36,
      "end": 668.64,
      "text": "Remember that the next important thing is the app icon and AppSource screenshots."
    },
    {
      "start": 668.64,
      "end": 672.96,
      "text": "What we just went through the title, subtitle keywords, this will help your app rank for"
    },
    {
      "start": 672.96,
      "end": 673.96,
      "text": "these different keywords."
    },
    {
      "start": 673.96,
      "end": 676.12,
      "text": "This will help your app show up."
    },
    {
      "start": 676.12,
      "end": 680.6800000000001,
      "text": "Once someone actually looks it up, once someone looks up CaliTrocker, what will make them"
    },
    {
      "start": 680.6800000000001,
      "end": 683.36,
      "text": "click on yours rather than someone else's?"
    },
    {
      "start": 683.36,
      "end": 688.32,
      "text": "This primarily comes down to the icon and screenshots."
    },
    {
      "start": 688.32,
      "end": 697.48,
      "text": "So for us, our screenshots are honestly not the best in my opinion."
    },
    {
      "start": 697.48,
      "end": 702.24,
      "text": "The thing is, these are literally the screenshots that we started the app with."
    },
    {
      "start": 702.24,
      "end": 705.5600000000001,
      "text": "Or maybe like a month after launching we changed to these."
    },
    {
      "start": 705.5600000000001,
      "end": 709.6400000000001,
      "text": "However, we haven't been able to beat them for some reason."
    },
    {
      "start": 709.6400000000001,
      "end": 711.44,
      "text": "We've done all these iterations."
    },
    {
      "start": 711.44,
      "end": 718.2800000000001,
      "text": "I think it's partially a problem with Apple's AB testing software for AB testing screenshots."
    },
    {
      "start": 718.3199999999999,
      "end": 722.72,
      "text": "What you could do, by the way, in the product page optimization, which is all about app"
    },
    {
      "start": 722.72,
      "end": 727.92,
      "text": "store optimization, you could run some tests where you AB tests are running screenshots."
    },
    {
      "start": 727.92,
      "end": 731.16,
      "text": "And we tried all this stuff, like putting AI CaliTrocker really big."
    },
    {
      "start": 731.16,
      "end": 738.16,
      "text": "Because essentially theories say you want like three words max really big at the top,"
    },
    {
      "start": 738.16,
      "end": 745.3199999999999,
      "text": "then some visuals and like just big, catchy headlines for every screenshot."
    },
    {
      "start": 745.32,
      "end": 751.88,
      "text": "But for us, for some reason, our more raw screenshots that we built very early on have just"
    },
    {
      "start": 751.88,
      "end": 755.8000000000001,
      "text": "been winning every single test."
    },
    {
      "start": 755.8000000000001,
      "end": 758.1600000000001,
      "text": "And we're still working on improving it."
    },
    {
      "start": 758.1600000000001,
      "end": 762.84,
      "text": "But I would keep in mind that I mean, even these like they're not bad screenshots."
    },
    {
      "start": 762.84,
      "end": 768.2,
      "text": "What you want is usually a visual of the app show clearly what it does."
    },
    {
      "start": 768.2,
      "end": 769.8000000000001,
      "text": "And try to make it short and snappy."
    },
    {
      "start": 769.8000000000001,
      "end": 771.32,
      "text": "Like this is too long in my opinion."
    },
    {
      "start": 771.32,
      "end": 776.2800000000001,
      "text": "It's working right now, but we're working on fixing the headlines."
    },
    {
      "start": 776.2800000000001,
      "end": 778.24,
      "text": "Make CaliTrocker easy with AI."
    },
    {
      "start": 778.24,
      "end": 780.88,
      "text": "Just have a picture of your food and let's do the rest."
    },
    {
      "start": 780.88,
      "end": 785.84,
      "text": "Only three screenshots are shown until someone clicks into your app."
    },
    {
      "start": 785.84,
      "end": 787.5600000000001,
      "text": "So the first, the were the most important."
    },
    {
      "start": 787.5600000000001,
      "end": 791.1600000000001,
      "text": "And ideally they can kind of tell a story together."
    },
    {
      "start": 791.1600000000001,
      "end": 792.1600000000001,
      "text": "Just have a picture."
    },
    {
      "start": 792.1600000000001,
      "end": 794.0,
      "text": "Then let us do the rest."
    },
    {
      "start": 794.0,
      "end": 795.0,
      "text": "Tell us a story."
    },
    {
      "start": 795.0,
      "end": 796.8000000000001,
      "text": "They need each other."
    },
    {
      "start": 796.8000000000001,
      "end": 798.1600000000001,
      "text": "They can't really stand alone."
    },
    {
      "start": 802.0400000000001,
      "end": 802.88,
      "text": "So that's important."
    },
    {
      "start": 805.6,
      "end": 812.08,
      "text": "You could actually see your app store, your conversion rate in the analytics page."
    },
    {
      "start": 812.08,
      "end": 817.2800000000001,
      "text": "And the conversion rate means how many people see your app and then we'll click on it."
    },
    {
      "start": 817.2800000000001,
      "end": 819.08,
      "text": "Leave the conversion rate."
    },
    {
      "start": 819.08,
      "end": 827.1600000000001,
      "text": "Yeah, so it's hours out of the people that see it about 21% will click into the page."
    },
    {
      "start": 827.1600000000001,
      "end": 829.72,
      "text": "Not necessarily download it, but just click into the page."
    },
    {
      "start": 832.2800000000001,
      "end": 836.6,
      "text": "Oh, okay, it actually downloads out of people that clicked into it."
    },
    {
      "start": 836.6,
      "end": 840.8000000000001,
      "text": "So my bad 21% of people like go to the Cali app page will download it."
    },
    {
      "start": 840.8000000000001,
      "end": 844.12,
      "text": "All of these numbers that we've actually had are very skewed."
    },
    {
      "start": 844.12,
      "end": 849.0400000000001,
      "text": "I've noticed because of influencer marketing, most people that run paid ads have like different numbers."
    },
    {
      "start": 849.0400000000001,
      "end": 854.5600000000001,
      "text": "They're like, wow, your numbers are either really, our numbers are either really bad or really good to these people."
    },
    {
      "start": 854.5600000000001,
      "end": 859.0,
      "text": "But it's just all skewed and a little different because we have influencers promoting it."
    },
    {
      "start": 859.0,
      "end": 864.84,
      "text": "And it's not paid ads going like directly to the page with maybe higher intent or lower intent sometimes."
    },
    {
      "start": 867.08,
      "end": 878.48,
      "text": "So the last thing that's important is the icon super, super important."
    },
    {
      "start": 878.48,
      "end": 879.84,
      "text": "So just up here."
    },
    {
      "start": 882.24,
      "end": 887.24,
      "text": "The icon and the screenshots both can have a significant effect on the conversion rate."
    },
    {
      "start": 887.24,
      "end": 890.36,
      "text": "This icon we used to just have the apple."
    },
    {
      "start": 891.5600000000001,
      "end": 893.04,
      "text": "We used to just have it."
    },
    {
      "start": 893.04,
      "end": 894.6,
      "text": "You can look in our."
    },
    {
      "start": 897.24,
      "end": 898.64,
      "text": "Okay, you see this."
    },
    {
      "start": 903.44,
      "end": 905.5600000000001,
      "text": "Metadata history."
    },
    {
      "start": 905.5600000000001,
      "end": 908.28,
      "text": "So our old logo was just the apple."
    },
    {
      "start": 908.28,
      "end": 913.48,
      "text": "And then we added the scan lines because we hypothesized, all right, if we add the scan lines,"
    },
    {
      "start": 913.48,
      "end": 917.8000000000001,
      "text": "we'll tell the user that you're actually taking the picture."
    },
    {
      "start": 917.8000000000001,
      "end": 919.8000000000001,
      "text": "It's scanning something."
    },
    {
      "start": 919.8000000000001,
      "end": 921.48,
      "text": "It's not just an apple."
    },
    {
      "start": 921.48,
      "end": 924.88,
      "text": "You understand more of what the app may be doing."
    },
    {
      "start": 924.88,
      "end": 930.08,
      "text": "And that alone boosted the conversion rate 7%, which is huge."
    },
    {
      "start": 930.08,
      "end": 931.08,
      "text": "It's massive."
    },
    {
      "start": 932.48,
      "end": 938.6,
      "text": "So do not underestimate the power of your icons and screenshots in these small tweaks."
    },
    {
      "start": 938.6,
      "end": 943.84,
      "text": "You want to try to show what the app does in the most clean way possible."
    },
    {
      "start": 945.84,
      "end": 946.84,
      "text": "Okay."
    },
    {
      "start": 946.84,
      "end": 952.4,
      "text": "So this is very high level app store optimization breakdown of it."
    },
    {
      "start": 954.32,
      "end": 957.6800000000001,
      "text": "If you're interested in learning more, I actually attached."
    },
    {
      "start": 959.32,
      "end": 963.6800000000001,
      "text": "There are all kinds of great articles by app tweak on this topic."
    },
    {
      "start": 964.68,
      "end": 971.68,
      "text": "And if you go to their start as a section, they break down so much about best practices for screenshots,"
    },
    {
      "start": 971.68,
      "end": 976.68,
      "text": "how to a B test app icon design keywords."
    },
    {
      "start": 976.68,
      "end": 978.68,
      "text": "And I would definitely recommend reading them."
    },
    {
      "start": 978.68,
      "end": 981.68,
      "text": "It's definitely worth it to get a deeper understanding."
    },
    {
      "start": 983.68,
      "end": 988.68,
      "text": "But with this, you should be able to start making money."
    },
    {
      "start": 988.68,
      "end": 992.68,
      "text": "This is, yeah, this is the app store optimization section."
    },
    {
      "start": 993.68,
      "end": 997.68,
      "text": "It's a quick one, not too much involved, not as complicated as the other ones."
    },
    {
      "start": 998.68,
      "end": 1000.68,
      "text": "But it's very, very profitable."
    },
    {
      "start": 1000.68,
      "end": 1002.68,
      "text": "So with that, I'm out."
    }
  ]
}