{
  "file_name": "044_Lesson_44.faudio-hi-0-Default.mp4",
  "text": " To cap off influencers, you guys gotta understand that influencers are not just individuals. They're also pages. An influencer is really anyone that you can have a paid placement opportunity with a massive amount of reach. So when it comes to these pages, you have usually a core for them. You got motivational pages, meme pages, news pages, and college student pages. Now if we're going to go through these, this is a meme page, fuck boy problems. Quitter, for Quitter, we've run a ton of memes on here. They just pump out memes and things get everywhere from a couple of hundred thousand views to millions of views. Due to their existing, I want to say brand reputation in the space. And also everyone loves them. Like, do people know who they are? Another one is motivational pages. You have bolt motivation here, which rips hundreds of thousands of views about popular and influential people, along with movies, etc. And he makes it engaging, like appears a good karate kid. It's about to face the whole way this little hell. It's got one chance to get it. You could easily approach this company and this page and be like, hey, we have a motivational aspect in our app. We'd love to partner. Another one is college accounts. So college fencing is one. Five million followers, they rip views, and all it is is memes about college. And now it's school starting right now. It's currently end of August. Dude, it's just going to rip. And if you have an app in this space, starting college kids, highly recommended targeting one of these theme pages. Now, why do theme pages work? Same as influencers. They have masses reach. They have brand familiar reputation. And you can also get direct conversions. On top of that, you can increase your brand awareness. If you have influencers posting about your product, and on top of that, now you have a pop-your-themed page posting about your product. Bought a Bing-Bought-A-BOOM. They're going to hit five to ten times in the algorithm about your app, your software. Now they're going to download, and they're going to convert. They're going to be like, oh, shit, we have this theme page talking about it. And my three favorite influencers talking about it. Like, this must be legit. Like, I got this. The downloaded product, your product works. They get the value out of it. Bought a Bing-Bought-A-BOOM. Start telling their friends. Growth is exponential, guys. Now, when it comes to working with them, I would not overthink it. All you have to do is identify the pages, right? Just like you would any influencer. I would follow that same format. You can go to the theme page, right? And click the affiliated badge, and you can find more people like them. Like fucking shower feelings, right? Two million followers. And there's RIP. Once you have identified your pages, I would definitely message them. DM them like you would an influencer. And then same thing. Do not talk about pricing in the DMs. I highly recommend getting them on the call, and pitching a View Guarantee. Right? How we talk about it right here. View Guarantee models RIP. You can get a $2.00 CPM, get a million Guarantee views, and do $2,000 deal. So, at the end of the day, in order for you to execute on this properly, I highly recommend having your posts blend into their page, make sure you're leveraging humor, and double down the winners. If a post pops off, I'd reach out to other pages in that niche, whether it's college pages, meme pages, motivational pages, or news pages. And have them post that same structure, and you'll just compound the views, and it'll fucking rip. So, that is the impages for you. They're great for supporting influencer campaigns and top of funnel awareness. And at the end of the day, you will get direct conversions, but I would not bank on the fact that you're always going to get direct conversions. Yes, you can lose money with these pages. Yes, they won't always work, but highly recommended as a supplemental distribution method.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.0,
      "text": "To cap off influencers, you guys gotta understand that influencers are not just individuals."
    },
    {
      "start": 5.0,
      "end": 6.0,
      "text": "They're also pages."
    },
    {
      "start": 6.0,
      "end": 12.0,
      "text": "An influencer is really anyone that you can have a paid placement opportunity with a massive amount of reach."
    },
    {
      "start": 12.0,
      "end": 16.0,
      "text": "So when it comes to these pages, you have usually a core for them."
    },
    {
      "start": 16.0,
      "end": 21.0,
      "text": "You got motivational pages, meme pages, news pages, and college student pages."
    },
    {
      "start": 21.0,
      "end": 26.0,
      "text": "Now if we're going to go through these, this is a meme page, fuck boy problems."
    },
    {
      "start": 26.0,
      "end": 29.0,
      "text": "Quitter, for Quitter, we've run a ton of memes on here."
    },
    {
      "start": 29.0,
      "end": 35.0,
      "text": "They just pump out memes and things get everywhere from a couple of hundred thousand views to millions of views."
    },
    {
      "start": 35.0,
      "end": 39.0,
      "text": "Due to their existing, I want to say brand reputation in the space."
    },
    {
      "start": 39.0,
      "end": 40.0,
      "text": "And also everyone loves them."
    },
    {
      "start": 40.0,
      "end": 42.0,
      "text": "Like, do people know who they are?"
    },
    {
      "start": 42.0,
      "end": 44.0,
      "text": "Another one is motivational pages."
    },
    {
      "start": 44.0,
      "end": 50.0,
      "text": "You have bolt motivation here, which rips hundreds of thousands of views about popular and influential people,"
    },
    {
      "start": 50.0,
      "end": 53.0,
      "text": "along with movies, etc."
    },
    {
      "start": 53.0,
      "end": 56.0,
      "text": "And he makes it engaging, like appears a good karate kid."
    },
    {
      "start": 56.0,
      "end": 59.0,
      "text": "It's about to face the whole way this little hell."
    },
    {
      "start": 59.0,
      "end": 61.0,
      "text": "It's got one chance to get it."
    },
    {
      "start": 61.0,
      "end": 67.0,
      "text": "You could easily approach this company and this page and be like, hey, we have a motivational aspect in our app."
    },
    {
      "start": 67.0,
      "end": 68.0,
      "text": "We'd love to partner."
    },
    {
      "start": 68.0,
      "end": 71.0,
      "text": "Another one is college accounts."
    },
    {
      "start": 71.0,
      "end": 75.0,
      "text": "So college fencing is one."
    },
    {
      "start": 75.0,
      "end": 81.0,
      "text": "Five million followers, they rip views, and all it is is memes about college."
    },
    {
      "start": 81.0,
      "end": 83.0,
      "text": "And now it's school starting right now."
    },
    {
      "start": 83.0,
      "end": 84.0,
      "text": "It's currently end of August."
    },
    {
      "start": 84.0,
      "end": 85.0,
      "text": "Dude, it's just going to rip."
    },
    {
      "start": 85.0,
      "end": 90.0,
      "text": "And if you have an app in this space, starting college kids, highly recommended targeting one of these theme pages."
    },
    {
      "start": 90.0,
      "end": 94.0,
      "text": "Now, why do theme pages work?"
    },
    {
      "start": 94.0,
      "end": 95.0,
      "text": "Same as influencers."
    },
    {
      "start": 95.0,
      "end": 96.0,
      "text": "They have masses reach."
    },
    {
      "start": 96.0,
      "end": 98.0,
      "text": "They have brand familiar reputation."
    },
    {
      "start": 98.0,
      "end": 100.0,
      "text": "And you can also get direct conversions."
    },
    {
      "start": 100.0,
      "end": 103.0,
      "text": "On top of that, you can increase your brand awareness."
    },
    {
      "start": 103.0,
      "end": 108.0,
      "text": "If you have influencers posting about your product, and on top of that, now you have a pop-your-themed page posting about your product."
    },
    {
      "start": 108.0,
      "end": 110.0,
      "text": "Bought a Bing-Bought-A-BOOM."
    },
    {
      "start": 110.0,
      "end": 115.0,
      "text": "They're going to hit five to ten times in the algorithm about your app, your software."
    },
    {
      "start": 115.0,
      "end": 117.0,
      "text": "Now they're going to download, and they're going to convert."
    },
    {
      "start": 117.0,
      "end": 119.0,
      "text": "They're going to be like, oh, shit, we have this theme page talking about it."
    },
    {
      "start": 119.0,
      "end": 121.0,
      "text": "And my three favorite influencers talking about it."
    },
    {
      "start": 121.0,
      "end": 122.0,
      "text": "Like, this must be legit."
    },
    {
      "start": 122.0,
      "end": 123.0,
      "text": "Like, I got this."
    },
    {
      "start": 123.0,
      "end": 125.0,
      "text": "The downloaded product, your product works."
    },
    {
      "start": 125.0,
      "end": 126.0,
      "text": "They get the value out of it."
    },
    {
      "start": 126.0,
      "end": 127.0,
      "text": "Bought a Bing-Bought-A-BOOM."
    },
    {
      "start": 127.0,
      "end": 128.0,
      "text": "Start telling their friends."
    },
    {
      "start": 128.0,
      "end": 130.0,
      "text": "Growth is exponential, guys."
    },
    {
      "start": 130.0,
      "end": 133.0,
      "text": "Now, when it comes to working with them, I would not overthink it."
    },
    {
      "start": 133.0,
      "end": 136.0,
      "text": "All you have to do is identify the pages, right?"
    },
    {
      "start": 136.0,
      "end": 137.0,
      "text": "Just like you would any influencer."
    },
    {
      "start": 137.0,
      "end": 138.0,
      "text": "I would follow that same format."
    },
    {
      "start": 138.0,
      "end": 141.0,
      "text": "You can go to the theme page, right?"
    },
    {
      "start": 141.0,
      "end": 145.0,
      "text": "And click the affiliated badge, and you can find more people like them."
    },
    {
      "start": 145.0,
      "end": 147.0,
      "text": "Like fucking shower feelings, right?"
    },
    {
      "start": 147.0,
      "end": 148.0,
      "text": "Two million followers."
    },
    {
      "start": 148.0,
      "end": 150.0,
      "text": "And there's RIP."
    },
    {
      "start": 150.0,
      "end": 154.0,
      "text": "Once you have identified your pages, I would definitely message them."
    },
    {
      "start": 154.0,
      "end": 156.0,
      "text": "DM them like you would an influencer."
    },
    {
      "start": 156.0,
      "end": 157.0,
      "text": "And then same thing."
    },
    {
      "start": 157.0,
      "end": 159.0,
      "text": "Do not talk about pricing in the DMs."
    },
    {
      "start": 159.0,
      "end": 163.0,
      "text": "I highly recommend getting them on the call, and pitching a View Guarantee."
    },
    {
      "start": 163.0,
      "end": 164.0,
      "text": "Right?"
    },
    {
      "start": 164.0,
      "end": 165.0,
      "text": "How we talk about it right here."
    },
    {
      "start": 166.0,
      "end": 167.0,
      "text": "View Guarantee models RIP."
    },
    {
      "start": 167.0,
      "end": 171.0,
      "text": "You can get a $2.00 CPM, get a million Guarantee views, and do $2,000 deal."
    },
    {
      "start": 171.0,
      "end": 176.0,
      "text": "So, at the end of the day, in order for you to execute on this properly,"
    },
    {
      "start": 176.0,
      "end": 180.0,
      "text": "I highly recommend having your posts blend into their page, make sure you're leveraging humor,"
    },
    {
      "start": 180.0,
      "end": 181.0,
      "text": "and double down the winners."
    },
    {
      "start": 181.0,
      "end": 186.0,
      "text": "If a post pops off, I'd reach out to other pages in that niche, whether it's college pages,"
    },
    {
      "start": 186.0,
      "end": 188.0,
      "text": "meme pages, motivational pages, or news pages."
    },
    {
      "start": 188.0,
      "end": 192.0,
      "text": "And have them post that same structure, and you'll just compound the views,"
    },
    {
      "start": 192.0,
      "end": 194.0,
      "text": "and it'll fucking rip."
    },
    {
      "start": 195.0,
      "end": 198.0,
      "text": "So, that is the impages for you."
    },
    {
      "start": 198.0,
      "end": 201.0,
      "text": "They're great for supporting influencer campaigns and top of funnel awareness."
    },
    {
      "start": 201.0,
      "end": 205.0,
      "text": "And at the end of the day, you will get direct conversions, but I would not bank on the fact"
    },
    {
      "start": 205.0,
      "end": 207.0,
      "text": "that you're always going to get direct conversions."
    },
    {
      "start": 207.0,
      "end": 209.0,
      "text": "Yes, you can lose money with these pages."
    },
    {
      "start": 209.0,
      "end": 218.0,
      "text": "Yes, they won't always work, but highly recommended as a supplemental distribution method."
    }
  ]
}