{
  "file_name": "041_Lesson_41.faudio-hi-0-Default.mp4",
  "text": " The first step of influencer marketing is finding influencers who would have guessed. So I'm going to teach you guys how to do that. Before we start hunting down influencers that can promote our apps, it's very important to know what type of influencer you are looking for. The best way to do this is to look at the core demographic of your product and then figure out where they hang out online. For example, Kalei, a calorie tracking app. Who's our core demographic? People who work out, people who go to the gym. Where do people who go to the gym hang out? What influencers online do they watch? And when I say hang out, I mean hang out online. What content are they consuming every day? Fitness influencers, people that show how to do workouts, people that show their gym routines going into the gym. So we knew, okay, these are the influencers we want talking about Kalei, our product. You have to do the same thing reverse engineer this for your own app. It's harder for some apps than others. For Kalei, it's pretty straightforward, calorie tracking working out. There's our hand in hand. So workout influencers. For an app like Quitter, for example, which we showed some videos on, it's harder to find influencers. There are no, there are a few actually, but there are much fewer porn influencers like influencers that talk about porn prevention. Then there are influencers that talk about working out because it's a much more sensitive topic, much more to do. And so what Quitter did is they saw, okay, men between the ages of 13 to 18, more than 50% of them have a porn addiction. And so if we go after influencers that target that where their audience is this demographic is mostly made up of young men, then Quitter should be pretty applicable to most of the audience. And that actually worked out. We could see with Jeremiah Jones, that video that went super viral made them over 100K in just 48 hours. It's because his audience is mostly young men. And so that worked really well. You have to do the same thing for your app, figure out where your core audience is and then which influencers they watch. If it's some kind of food app, like a recipe app, then it's probably chef influencers that they're watching how to prepare different dishes. You have to figure it out. Once you have, and this might take experimentation, honestly, you might not get it right the first time. And once you start, you'll start very broad. But then you'll eventually, sorry, you'll start very niche down. You'll start as niche as possible to the core, to the most core demographic that you can. And then you usually expand. So with Cal AI, we started with the hardest core fitness influencers. And at this point, we're working with anyone. We're working with Piper Raquel, who's a girl that has a big audience of younger girls on her, mostly teenage girls. And she is, she promotes all kinds of things. It's mostly just relatable, funny content about being a girl. And so it was unclear in the beginning. Is this going to convert well for Cal AI? But it did convert well. And we hypothesize that is because most of our audience is young girls and teenage girls are often insecure about their bodies and therefore they want to count their calories. So Cal AI actually worked really well. This wasn't an obvious thing in the beginning, but now she's one of our most profitable influencers. So it may not be the influencers that work best for you may not be the most obvious and may take a bunch of experimentation. Once you find the influencer archetype you're targeting, we have to source them. There are many platforms and agencies that claim to do this. But for my experience, they all fucking suck. They all suck. And I just use TikTok and Instagram by their selves to find my influencers. I turn the 4U pages into lead generation engines. So let's see how we're going to do that. So the 4U page method, you want to create a fresh TikTok account and then it's basically just interacting with videos that are in your niche. So let's go to TikTok. If I'm trying to find finished influencers, I'll look up something like Men workouts. Man workouts gym. Okay, weird that no results are found. There definitely are videos to search algorithms for these platforms actually aren't always. Is there anything better that Jami Rossbury? What the fuck dude? Okay, I gotta put a marker to cut this. I do that. Okay, cut, cut right here. I don't what the fuck dude the girl showed in fact. What the fuck? So we're here on TikTok and now I'm going to look up Men workout. Boom. And here we'll get all kinds of different influencer men showing how to do workouts. What you'll want to do is just go through and like bookmark, comment, follow the influencers. I did it because this is just demonstration purposes. But this guy, let's see, 355,000 followers. And if you do this on another video, if you just scroll through and you start liking, commenting, engaging with a bunch of videos in your niche, you will eventually get your for you page to only be these early on when you first create a brand new TikTok account. TikTok won't know what you like. So it will just show you random content. So you want to start by searching for something so you could also search hashtag fitness. And here are a ton of more creative. So you'll want to go through like all of these videos, comment, whatever. Eventually it will turn into your for you page being all your niche and you want to keep going. You want to keep scrolling through liking videos, bookmarking. This is positive reinforcement to the algorithm that is showing you the right content. And at a certain point, you will only get content for of influencers in your niche that you want. It's a lead generation engine, whereas you just need to scroll and then everyone's everyone's an influencer. Some aren't good influencers that you want to work with because maybe they're too small, maybe the reviews aren't consistent, but they're all going to be in your niche and you can work with them. Okay. So that is really like the search method, the field. You could also, you can't do this on a computer. You have to do this on your phone on the app. So it's better to do it there. But you can, after you search, you could sort by like count. And the last three months posted in the last three months to make sure that the creators you're actually you're actually liking videos are are more relevant. So Instagram is basically the same thing. You could also just curate your for-you-page to be all influencers. But there is an additional feature on Instagram called the related accounts method. Basically, if you go on Instagram and you look up some fitness trader, so fitness creator I know is Jeremiah Jones. After you follow that creator, boom, I actually feel bad. I wasn't following him before. There is a drop. Okay, here it goes. There is the suggested for you. And this suggested for you is usually all also similar creators. So Sam Solok, huge fitness influencer. Boom, David Goggins, huge fitness influencer. William Scott, huge fitness influencer. Thomas Lee Fit, fitness influencer. And it just keeps going. So this is also another way to just find more influencers. So the first way is like, okay, you get your for-you-curate-your-for-you-page to just give you influencers. And then the second way is to look at this suggested for you. Find an account, boom, follow them. And then you get a bunch of suggested for you. You go down the rabbit hole and you keep getting all of these influencers. You keep hitting them in their DMs. But we're going to get into that in the next section. So that is generally the best way to find influencers. The next section we'll get into how to reach out to them.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.28,
      "text": "The first step of influencer marketing is finding influencers who would have guessed."
    },
    {
      "start": 6.08,
      "end": 8.32,
      "text": "So I'm going to teach you guys how to do that."
    },
    {
      "start": 9.76,
      "end": 14.88,
      "text": "Before we start hunting down influencers that can promote our apps,"
    },
    {
      "start": 14.88,
      "end": 18.240000000000002,
      "text": "it's very important to know what type of influencer you are looking for."
    },
    {
      "start": 19.12,
      "end": 22.8,
      "text": "The best way to do this is to look at the core demographic of your product"
    },
    {
      "start": 23.6,
      "end": 29.2,
      "text": "and then figure out where they hang out online. For example, Kalei, a calorie tracking app."
    },
    {
      "start": 30.08,
      "end": 34.16,
      "text": "Who's our core demographic? People who work out, people who go to the gym."
    },
    {
      "start": 34.8,
      "end": 39.120000000000005,
      "text": "Where do people who go to the gym hang out? What influencers online do they watch?"
    },
    {
      "start": 39.120000000000005,
      "end": 42.480000000000004,
      "text": "And when I say hang out, I mean hang out online. What content are they consuming every day?"
    },
    {
      "start": 43.76,
      "end": 47.92,
      "text": "Fitness influencers, people that show how to do workouts, people that show their gym routines"
    },
    {
      "start": 47.92,
      "end": 53.519999999999996,
      "text": "going into the gym. So we knew, okay, these are the influencers we want talking about Kalei,"
    },
    {
      "start": 53.519999999999996,
      "end": 59.68,
      "text": "our product. You have to do the same thing reverse engineer this for your own app."
    },
    {
      "start": 60.72,
      "end": 64.0,
      "text": "It's harder for some apps than others. For Kalei, it's pretty straightforward,"
    },
    {
      "start": 64.0,
      "end": 67.04,
      "text": "calorie tracking working out. There's our hand in hand. So workout influencers."
    },
    {
      "start": 67.68,
      "end": 71.04,
      "text": "For an app like Quitter, for example, which we showed some videos on,"
    },
    {
      "start": 72.72,
      "end": 80.8,
      "text": "it's harder to find influencers. There are no, there are a few actually, but there are much"
    },
    {
      "start": 80.8,
      "end": 87.36,
      "text": "fewer porn influencers like influencers that talk about porn prevention. Then there are influencers"
    },
    {
      "start": 87.36,
      "end": 92.96,
      "text": "that talk about working out because it's a much more sensitive topic, much more to do."
    },
    {
      "start": 93.92,
      "end": 101.76,
      "text": "And so what Quitter did is they saw, okay, men between the ages of 13 to 18, more than 50% of them"
    },
    {
      "start": 102.32,
      "end": 109.76,
      "text": "have a porn addiction. And so if we go after influencers that target that where their audience"
    },
    {
      "start": 109.76,
      "end": 117.84,
      "text": "is this demographic is mostly made up of young men, then Quitter should be pretty applicable"
    },
    {
      "start": 117.84,
      "end": 123.68,
      "text": "to most of the audience. And that actually worked out. We could see with Jeremiah Jones,"
    },
    {
      "start": 123.68,
      "end": 127.92,
      "text": "that video that went super viral made them over 100K in just 48 hours."
    },
    {
      "start": 129.04000000000002,
      "end": 135.20000000000002,
      "text": "It's because his audience is mostly young men. And so that worked really well."
    },
    {
      "start": 135.92,
      "end": 140.32,
      "text": "You have to do the same thing for your app, figure out where your core audience is and then"
    },
    {
      "start": 140.32,
      "end": 146.64,
      "text": "which influencers they watch. If it's some kind of food app, like a recipe app, then it's probably"
    },
    {
      "start": 146.64,
      "end": 151.28,
      "text": "chef influencers that they're watching how to prepare different dishes. You have to figure it out."
    },
    {
      "start": 152.48,
      "end": 158.95999999999998,
      "text": "Once you have, and this might take experimentation, honestly, you might not get it right the first time."
    },
    {
      "start": 159.92000000000002,
      "end": 166.0,
      "text": "And once you start, you'll start very broad. But then you'll eventually,"
    },
    {
      "start": 166.0,
      "end": 170.32,
      "text": "sorry, you'll start very niche down. You'll start as niche as possible to the core,"
    },
    {
      "start": 171.28,
      "end": 176.08,
      "text": "to the most core demographic that you can. And then you usually expand. So with Cal AI,"
    },
    {
      "start": 176.08,
      "end": 180.4,
      "text": "we started with the hardest core fitness influencers. And at this point, we're working with anyone."
    },
    {
      "start": 180.4,
      "end": 188.16,
      "text": "We're working with Piper Raquel, who's a girl that has a big audience of younger girls"
    },
    {
      "start": 188.16,
      "end": 194.4,
      "text": "on her, mostly teenage girls. And she is, she promotes all kinds of things. It's mostly just"
    },
    {
      "start": 194.4,
      "end": 201.35999999999999,
      "text": "relatable, funny content about being a girl. And so it was unclear in the beginning. Is this going"
    },
    {
      "start": 201.35999999999999,
      "end": 207.84,
      "text": "to convert well for Cal AI? But it did convert well. And we hypothesize that is because most of our"
    },
    {
      "start": 207.84,
      "end": 214.24,
      "text": "audience is young girls and teenage girls are often insecure about their bodies and therefore they"
    },
    {
      "start": 214.24,
      "end": 218.8,
      "text": "want to count their calories. So Cal AI actually worked really well. This wasn't an obvious thing in"
    },
    {
      "start": 218.8,
      "end": 224.24,
      "text": "the beginning, but now she's one of our most profitable influencers. So it may not be the influencers"
    },
    {
      "start": 224.24,
      "end": 228.4,
      "text": "that work best for you may not be the most obvious and may take a bunch of experimentation."
    },
    {
      "start": 229.44,
      "end": 234.64000000000001,
      "text": "Once you find the influencer archetype you're targeting, we have to source them."
    },
    {
      "start": 235.68,
      "end": 241.20000000000002,
      "text": "There are many platforms and agencies that claim to do this. But for my experience, they all"
    },
    {
      "start": 241.2,
      "end": 249.04,
      "text": "fucking suck. They all suck. And I just use TikTok and Instagram by their selves to find my"
    },
    {
      "start": 249.04,
      "end": 255.44,
      "text": "influencers. I turn the 4U pages into lead generation engines. So let's see how we're going to do that."
    },
    {
      "start": 256.24,
      "end": 260.24,
      "text": "So the 4U page method, you want to create a fresh TikTok account and then it's basically just"
    },
    {
      "start": 260.24,
      "end": 266.88,
      "text": "interacting with videos that are in your niche. So let's go to TikTok."
    },
    {
      "start": 267.36,
      "end": 274.08,
      "text": "If I'm trying to find finished influencers, I'll look up something like"
    },
    {
      "start": 274.96,
      "end": 285.2,
      "text": "Men workouts. Man workouts gym. Okay, weird that no results are found. There definitely"
    },
    {
      "start": 285.2,
      "end": 290.0,
      "text": "are videos to search algorithms for these platforms actually aren't always."
    },
    {
      "start": 290.08,
      "end": 296.32,
      "text": "Is there anything better that Jami Rossbury? What the fuck dude?"
    },
    {
      "start": 298.08,
      "end": 304.16,
      "text": "Okay, I gotta put a marker to cut this. I do that."
    },
    {
      "start": 307.92,
      "end": 312.24,
      "text": "Okay, cut, cut right here. I don't what the fuck dude the girl showed"
    },
    {
      "start": 312.48,
      "end": 316.96000000000004,
      "text": "in fact. What the fuck?"
    },
    {
      "start": 321.84000000000003,
      "end": 327.04,
      "text": "So we're here on TikTok and now I'm going to look up Men workout."
    },
    {
      "start": 329.36,
      "end": 338.24,
      "text": "Boom. And here we'll get all kinds of different influencer men showing how to do workouts."
    },
    {
      "start": 338.72,
      "end": 346.72,
      "text": "What you'll want to do is just go through and like bookmark, comment, follow the influencers."
    },
    {
      "start": 346.72,
      "end": 351.52,
      "text": "I did it because this is just demonstration purposes. But this guy, let's see,"
    },
    {
      "start": 351.52,
      "end": 356.8,
      "text": "355,000 followers. And if you do this on another video, if you just scroll through and you start"
    },
    {
      "start": 356.8,
      "end": 363.52,
      "text": "liking, commenting, engaging with a bunch of videos in your niche, you will eventually get your"
    },
    {
      "start": 363.52,
      "end": 367.91999999999996,
      "text": "for you page to only be these early on when you first create a brand new TikTok account."
    },
    {
      "start": 367.91999999999996,
      "end": 372.4,
      "text": "TikTok won't know what you like. So it will just show you random content. So you want to start"
    },
    {
      "start": 372.4,
      "end": 376.47999999999996,
      "text": "by searching for something so you could also search hashtag fitness."
    },
    {
      "start": 380.24,
      "end": 384.15999999999997,
      "text": "And here are a ton of more creative. So you'll want to go through like all of these videos,"
    },
    {
      "start": 384.15999999999997,
      "end": 391.59999999999997,
      "text": "comment, whatever. Eventually it will turn into your for you page being all your niche and you"
    },
    {
      "start": 391.6,
      "end": 397.12,
      "text": "want to keep going. You want to keep scrolling through liking videos, bookmarking. This is positive"
    },
    {
      "start": 397.12,
      "end": 403.92,
      "text": "reinforcement to the algorithm that is showing you the right content. And at a certain point,"
    },
    {
      "start": 403.92,
      "end": 412.56,
      "text": "you will only get content for of influencers in your niche that you want. It's a lead generation"
    },
    {
      "start": 412.56,
      "end": 417.6,
      "text": "engine, whereas you just need to scroll and then everyone's everyone's an influencer. Some aren't"
    },
    {
      "start": 417.6,
      "end": 421.20000000000005,
      "text": "good influencers that you want to work with because maybe they're too small, maybe the reviews"
    },
    {
      "start": 421.2,
      "end": 425.12,
      "text": "aren't consistent, but they're all going to be in your niche and you can work with them."
    },
    {
      "start": 426.24,
      "end": 432.4,
      "text": "Okay. So that is really like the search method, the field. You could also, you can't do this on"
    },
    {
      "start": 432.4,
      "end": 437.84,
      "text": "a computer. You have to do this on your phone on the app. So it's better to do it there. But you can,"
    },
    {
      "start": 437.84,
      "end": 443.52,
      "text": "after you search, you could sort by like count. And the last three months posted in the last three"
    },
    {
      "start": 443.52,
      "end": 448.96,
      "text": "months to make sure that the creators you're actually you're actually liking videos are are more"
    },
    {
      "start": 448.96,
      "end": 456.15999999999997,
      "text": "relevant. So Instagram is basically the same thing. You could also just curate your for-you-page"
    },
    {
      "start": 456.15999999999997,
      "end": 463.68,
      "text": "to be all influencers. But there is an additional feature on Instagram called the related accounts method."
    },
    {
      "start": 465.03999999999996,
      "end": 469.76,
      "text": "Basically, if you go on Instagram and you look up some fitness trader, so"
    },
    {
      "start": 470.4,
      "end": 483.12,
      "text": "fitness creator I know is Jeremiah Jones. After you follow that creator, boom, I actually feel bad."
    },
    {
      "start": 483.12,
      "end": 490.88,
      "text": "I wasn't following him before. There is a drop. Okay, here it goes. There is the suggested for you."
    },
    {
      "start": 490.88,
      "end": 496.88,
      "text": "And this suggested for you is usually all also similar creators. So Sam Solok, huge"
    },
    {
      "start": 496.88,
      "end": 504.32,
      "text": "fitness influencer. Boom, David Goggins, huge fitness influencer. William Scott, huge fitness"
    },
    {
      "start": 504.32,
      "end": 512.4,
      "text": "influencer. Thomas Lee Fit, fitness influencer. And it just keeps going. So this is also another way"
    },
    {
      "start": 512.4,
      "end": 519.04,
      "text": "to just find more influencers. So the first way is like, okay, you get your for-you-curate-your-for-you-page"
    },
    {
      "start": 519.04,
      "end": 526.48,
      "text": "to just give you influencers. And then the second way is to look at this suggested for you."
    },
    {
      "start": 526.48,
      "end": 531.28,
      "text": "Find an account, boom, follow them. And then you get a bunch of suggested for you. You go down the"
    },
    {
      "start": 531.28,
      "end": 536.48,
      "text": "rabbit hole and you keep getting all of these influencers. You keep hitting them in their DMs. But"
    },
    {
      "start": 536.48,
      "end": 543.6800000000001,
      "text": "we're going to get into that in the next section. So that is generally the best way to find influencers."
    },
    {
      "start": 543.68,
      "end": 553.68,
      "text": "The next section we'll get into how to reach out to them."
    }
  ]
}