{
  "file_name": "009_Lesson_09.faudio-hi-0-Default.mp4",
  "text": " Alright, we're back. Got a little black eye from this weekend. I low-key probably need stitches but I feel like you know, face cuts are kind of cool so might let it ride. Anyways today we're taking a look at Reddit and x.com. Personally I use Instagram and TikTok as my primary source of social media scanning but it's worth touching on the value that Reddit, X and other text slash forum style websites provide. Good framework I use is Instagram and TikTok is a better representation of the general zeitgeist or sort of collective unconscious. The things that manifest themselves there through content sort of ideas and things that people are interested in are generally more mass market whereas on Reddit and x.com it is easier and you are more likely to sort of fall into and you're able to analyze these high intent cult like rabbit holes which are actually extremely important in their own respect. So I'll start off here with a material example. Okay during the last video I spoke a little bit about looks maxing but let's let's go into this Reddit channel. Okay this is obviously a joke but I don't know why it's all women right now. It looks like it's just thirst traps. This is not how it used to be. When I first built UMax it was filled with people like this pretty normal looking dudes asking for advice on how to improve their facial aesthetics. I would bet that part of it here is like the pictures of girls are just more likely to get up votes. But you know let's see this. Okay so we used to actually I used to sponsor so if you go back to looks maxing advice from years ago every single post had a try UMax. I guess someone else probably outbid us recently and not really put any operational effort into UMax anymore. But anyways enough general background what's the key takeaway here. There are a ton of people on the internet that are asking for advice on how to improve their facial aesthetics. They want ratings as well as advice. So I had first seen this on TikTok. I found forums like R-slash looks maxing advice as well as the looks maxing forum. So I think we can find this looks maxing. There's like a dedicated looks maxing forum too. This might be it. Another good example of this is bodybuilding. Oh it may have been deleted. Yeah this used to be a really popular one the forums on bodybuilding.com. Anyways you can go to these forums and you can see what people are asking for. Then the next step there is do your market research which we'll talk about in the next video. And if the products that are solving these problems don't already exist that's a great signal that you can build them and then use these communities as your initial method of penetration and generating distribution traffic awareness that sort of thing. What you'll often find is that the sort of niches and content that people are interested in on short form. So TikTok and Instagram will also have companion forums on Reddit and X as we'll later look into. So if we go to nofap Hmm. I know that there used to be a popular um maybe oh here. Why is it hidden? That's so weird. Okay well there is a Reddit forum of nofap which has 1.2 million members. Um is this quitter? Maybe this is a different application. Anyways when Alex and Connor were building quitter they saw this sort of organic movement on on these different forum websites as well as short form social media. And if you go here and you read these these posts what you'll find is you'll be able to very easily put yourself into the mind of people who are trying to you know achieve these different results. For looks-maxim they want to find out how attractive they are and how they can become more attractive. For nofap they want to figure out how to develop the discipline to be able to overcome their addiction to pornography and masturbation. So these these Reddit forums are an absolute gold mine for for figuring out what the wants and desires are of the really high intent users. So you can identify these either large or quickly growing communities so nofap has been large for a while. On the other end for UMACs um you know looks-maxim was was very high growth at that point. You identify the problems that these people are experiencing and then what are the solutions that they're directly or indirectly asking for. Okay now we can move over to X. Okay so I started here on politics because as I mentioned yesterday this sort of like anti-deep state America first movement is growing very quickly one idea for a product. Um this might be a slightly one of these like study over intellectualized products but would probably go viral nevertheless would be a product where you can input any individuals name and see who they're deeply connected to who they have ties to who they've received funding from um and and essentially identify what the individuals background biases are. Um so politics obviously always super viral there's still very few apps built in that domain so could could be interesting. Um okay I'm gonna keep scrolling a little bit. Um crypto crypto as well as financial X is always very large building strategic tooling for individuals to to source higher quality information could be very interesting. For example I know that these these deep research AI models are very effective at um you know quickly and exhaustively scraping the internet for for different for for news and information on different topics right you could build a product with an interface that makes it really easy to enter a ticker for um um stocks and or uh crypto coins and help identify information that can help these short of short terms swing traders make more informed decisions now I'm not deeply familiar with this industry and I'm sure it'd be difficult to build something that actually captures and creates any amount of alpha for the individual but um an idea nevertheless that may be worth investigating. career I think is very interesting you know I think um I think I I think that we're we're moving towards an increasingly efficient um um let me rephrase I think we're we're moving towards an increasingly uh brutal and difficult and yet at the same time probably efficient job market for new graduates and it's extremely difficult to get a job like I'd like to think of myself as a very uh intelligent and thoughtful individual who would be valuable within any organization and yet I applied to probably over 200 jobs and internships throughout college and I never even got a second round interview I'm not joking I never got a second round interview I got maybe like three or four first round interviews but everybody wrote me off um so it's a brutal job market out there and it's honestly something people are willing to pay a lot for people pay you know 50,000 plus dollars a year for university education with hopes that they'll get a job now any tool that can help people get jobs like actually get the fucking jobs it would be extremely valuable people would pay a lot of money for so I know that there are a lot of people trying to build AI agents for this but you know even something as simple as like a career AI product where it auto applies to jobs for you has your sort of like AI's uh interview helper like Clueley style whatever it may be and and and helps you identify jobs once again using agents to search applies helps build out the best resume for you helps coach you and how to become the most effective um sort of uh employee candidate right that would that would that that product could could absolutely rip like even my younger brother recently I was actually able to help him get a job you know nepotism it is what it is he's smart he deserves the job regardless 15 ADSAT but he as well even with that 15 ADSAT had such a hard time if someone had shown me a tool like this that was actually effective I would have told him to pay hundreds of dollars a month for it or I probably would have bought it for him but you know something along those lines anyways um yeah careers massive not many people have built products in this base successful products rather I should say um so you know that that's an example that was inspired not by me seeing an individual post but like kind of generally understanding the the larger order problems that people nowadays face as well as what the available technology uh could provide in terms of solving it also knowing that none of these products on the market are actually that effective right so we're taking a lot of outside information just on the basis of the category um I don't have like super specific recommendations on how to find and identify problems on on X though I'm sure just by curating your feed and and consuming high quality information you'll be able to more properly identify uh and you know I think that's always important to stay stay in touch with what's going viral at any given moment right Zach for example Zach went insanely viral with his SAT tweet let's see it'll be something along the lines of like it's like um what uh uh let's go from uh what is it Zach got a garrie wait let's see what's Zach's Zach underscore you gotta garrie um um you had to highlights oh yeah here we go um Zach went extremely viral forgetting rejected from so many colleges in spite of being one of the most competent candidates of all time in my opinion like I've spoken to hundreds of you know 17 18 year olds that have reached out asking me for advice Zach blows and these are all fucking smart high achieving kids Zach blows every single one of them out of the water uh and yet he got rejected from like almost every single school that he applied to um reason I bring this up this this was like one of the most viral things in the news at the time right the 30 million views the people are speaking about it on news stations and whatnot if you generally stay up to date with what's going super viral you'll be able to identify the the most pressing problems that people face um and sort of build around it okay um I think that generally concludes my spiel for reddit and x.com as well as scraping other forum websites um I don't have an extremely strict methodology here but rather that you know as you begin to form your idea these can provide more in-depth information and sort of data to help inform your your your process of product ideation this can even serve as the the starting point of where you come with your idea it's not something that I've traditionally done uh but but once again just another another solid data point um cool next up you're gonna have an assignment where you are going to uh think about problems that you experience scroll through social media come up with a ton of different ideas or rather than a ton I should say a bunch of different ideas and then you are going to write a little bit about a few of them in the next unit uh we're gonna go over market research and finalizing your idea before we get into the more material components of building an app uh the modules being design development and distribution so I will see you guys in the next video",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 7.5200000000000005,
      "text": "Alright, we're back. Got a little black eye from this weekend. I low-key probably"
    },
    {
      "start": 7.5200000000000005,
      "end": 14.4,
      "text": "need stitches but I feel like you know, face cuts are kind of cool so might"
    },
    {
      "start": 14.4,
      "end": 23.6,
      "text": "let it ride. Anyways today we're taking a look at Reddit and x.com. Personally I"
    },
    {
      "start": 23.6,
      "end": 29.44,
      "text": "use Instagram and TikTok as my primary source of social media scanning but"
    },
    {
      "start": 29.44,
      "end": 35.84,
      "text": "it's worth touching on the value that Reddit, X and other text slash forum style websites"
    },
    {
      "start": 35.84,
      "end": 43.760000000000005,
      "text": "provide. Good framework I use is Instagram and TikTok is a better representation of the"
    },
    {
      "start": 43.760000000000005,
      "end": 51.84,
      "text": "general zeitgeist or sort of collective unconscious. The things that manifest"
    },
    {
      "start": 52.8,
      "end": 57.6,
      "text": "themselves there through content sort of ideas and things that people are interested in"
    },
    {
      "start": 58.4,
      "end": 68.16,
      "text": "are generally more mass market whereas on Reddit and x.com it is easier and you are more likely to"
    },
    {
      "start": 68.16,
      "end": 77.04,
      "text": "sort of fall into and you're able to analyze these high intent cult like rabbit holes which are"
    },
    {
      "start": 77.04,
      "end": 83.28,
      "text": "actually extremely important in their own respect. So I'll start off here with a material example."
    },
    {
      "start": 84.08,
      "end": 92.4,
      "text": "Okay during the last video I spoke a little bit about looks maxing but let's let's go into this"
    },
    {
      "start": 93.92,
      "end": 103.68,
      "text": "Reddit channel. Okay this is obviously a joke but I don't know why it's all women right now."
    },
    {
      "start": 104.48,
      "end": 109.2,
      "text": "It looks like it's just thirst traps. This is not how it used to be."
    },
    {
      "start": 110.08,
      "end": 119.04,
      "text": "When I first built UMax it was filled with people like this pretty normal looking dudes"
    },
    {
      "start": 119.60000000000001,
      "end": 124.96000000000001,
      "text": "asking for advice on how to improve their facial aesthetics. I would bet that part of it here is"
    },
    {
      "start": 124.96000000000001,
      "end": 133.36,
      "text": "like the pictures of girls are just more likely to get up votes. But you know let's see this."
    },
    {
      "start": 133.52,
      "end": 141.36,
      "text": "Okay so we used to actually I used to sponsor so if you go back to looks maxing advice from years ago"
    },
    {
      "start": 142.4,
      "end": 148.64000000000001,
      "text": "every single post had a try UMax. I guess someone else probably outbid us recently and not really"
    },
    {
      "start": 148.64000000000001,
      "end": 157.68,
      "text": "put any operational effort into UMax anymore. But anyways enough general background what's the"
    },
    {
      "start": 157.68,
      "end": 162.72000000000003,
      "text": "key takeaway here. There are a ton of people on the internet that are asking for advice on how to"
    },
    {
      "start": 162.72,
      "end": 169.92,
      "text": "improve their facial aesthetics. They want ratings as well as advice. So I had first seen this on"
    },
    {
      "start": 169.92,
      "end": 180.24,
      "text": "TikTok. I found forums like R-slash looks maxing advice as well as the looks maxing forum. So I think"
    },
    {
      "start": 180.24,
      "end": 190.4,
      "text": "we can find this looks maxing. There's like a dedicated looks maxing forum too. This might be it."
    },
    {
      "start": 193.12,
      "end": 200.32,
      "text": "Another good example of this is bodybuilding. Oh it may have been deleted."
    },
    {
      "start": 207.04,
      "end": 211.04,
      "text": "Yeah this used to be a really popular one the forums on bodybuilding.com."
    },
    {
      "start": 212.32,
      "end": 218.8,
      "text": "Anyways you can go to these forums and you can see what people are asking for. Then the next step"
    },
    {
      "start": 218.88000000000002,
      "end": 224.08,
      "text": "there is do your market research which we'll talk about in the next video. And if the products that"
    },
    {
      "start": 224.08,
      "end": 230.24,
      "text": "are solving these problems don't already exist that's a great signal that you can build them"
    },
    {
      "start": 230.24,
      "end": 239.44,
      "text": "and then use these communities as your initial method of penetration and generating distribution"
    },
    {
      "start": 239.44,
      "end": 248.8,
      "text": "traffic awareness that sort of thing. What you'll often find is that the sort of"
    },
    {
      "start": 249.76,
      "end": 256.64,
      "text": "niches and content that people are interested in on short form. So TikTok and Instagram will also have"
    },
    {
      "start": 256.64,
      "end": 265.12,
      "text": "companion forums on Reddit and X as we'll later look into. So if we go to nofap"
    },
    {
      "start": 270.4,
      "end": 289.92,
      "text": "Hmm. I know that there used to be a popular um maybe oh here. Why is it hidden? That's so weird."
    },
    {
      "start": 289.92,
      "end": 295.44,
      "text": "Okay well there is a Reddit forum of nofap which has 1.2 million members."
    },
    {
      "start": 296.16,
      "end": 304.64,
      "text": "Um is this quitter? Maybe this is a different application. Anyways when Alex and Connor were building"
    },
    {
      "start": 304.64,
      "end": 310.96,
      "text": "quitter they saw this sort of organic movement on on these different forum websites as well as"
    },
    {
      "start": 310.96,
      "end": 317.44,
      "text": "short form social media. And if you go here and you read these these posts what you'll find is"
    },
    {
      "start": 317.44,
      "end": 323.6,
      "text": "you'll be able to very easily put yourself into the mind of people who are trying to you know achieve"
    },
    {
      "start": 323.6,
      "end": 327.20000000000005,
      "text": "these different results. For looks-maxim they want to find out how attractive they are and how they"
    },
    {
      "start": 327.20000000000005,
      "end": 332.16,
      "text": "can become more attractive. For nofap they want to figure out how to develop the discipline to be"
    },
    {
      "start": 332.16,
      "end": 339.44,
      "text": "able to overcome their addiction to pornography and masturbation. So these these Reddit forums are"
    },
    {
      "start": 339.44,
      "end": 348.24,
      "text": "an absolute gold mine for for figuring out what the wants and desires are of the really high intent"
    },
    {
      "start": 348.24,
      "end": 356.48,
      "text": "users. So you can identify these either large or quickly growing communities so nofap has been"
    },
    {
      "start": 356.48,
      "end": 365.04,
      "text": "large for a while. On the other end for UMACs um you know looks-maxim was was very high growth at"
    },
    {
      "start": 365.04,
      "end": 371.92,
      "text": "that point. You identify the problems that these people are experiencing and then what are the"
    },
    {
      "start": 371.92,
      "end": 378.32,
      "text": "solutions that they're directly or indirectly asking for. Okay now we can move over to X."
    },
    {
      "start": 380.56,
      "end": 386.16,
      "text": "Okay so I started here on politics because as I mentioned yesterday this sort of like"
    },
    {
      "start": 386.72,
      "end": 394.48,
      "text": "anti-deep state America first movement is growing very quickly one idea for a product."
    },
    {
      "start": 395.36,
      "end": 402.88,
      "text": "Um this might be a slightly one of these like study over intellectualized products but would"
    },
    {
      "start": 402.88,
      "end": 409.44,
      "text": "probably go viral nevertheless would be a product where you can input any individuals name"
    },
    {
      "start": 410.56,
      "end": 417.28000000000003,
      "text": "and see who they're deeply connected to who they have ties to who they've received funding from"
    },
    {
      "start": 418.15999999999997,
      "end": 424.88,
      "text": "um and and essentially identify what the individuals background biases are."
    },
    {
      "start": 425.52,
      "end": 431.84,
      "text": "Um so politics obviously always super viral there's still very few apps built in that domain so"
    },
    {
      "start": 431.84,
      "end": 441.59999999999997,
      "text": "could could be interesting. Um okay I'm gonna keep scrolling a little bit."
    },
    {
      "start": 441.76000000000005,
      "end": 456.0,
      "text": "Um crypto crypto as well as financial X is always very large building strategic tooling for"
    },
    {
      "start": 457.44,
      "end": 462.48,
      "text": "individuals to to source higher quality information could be very interesting. For example I know"
    },
    {
      "start": 462.48,
      "end": 472.0,
      "text": "that these these deep research AI models are very effective at um you know quickly and exhaustively"
    },
    {
      "start": 472.0,
      "end": 479.84000000000003,
      "text": "scraping the internet for for different for for news and information on different topics right you"
    },
    {
      "start": 479.84000000000003,
      "end": 487.76,
      "text": "could build a product with an interface that makes it really easy to enter a ticker for um"
    },
    {
      "start": 488.48,
      "end": 495.76,
      "text": "um stocks and or uh crypto coins and help identify information that can help these short of short"
    },
    {
      "start": 495.76,
      "end": 501.28,
      "text": "terms swing traders make more informed decisions now I'm not deeply familiar with this industry and"
    },
    {
      "start": 501.28,
      "end": 506.24,
      "text": "I'm sure it'd be difficult to build something that actually captures and creates any amount of alpha"
    },
    {
      "start": 506.24,
      "end": 513.68,
      "text": "for the individual but um an idea nevertheless that may be worth investigating."
    },
    {
      "start": 514.16,
      "end": 520.56,
      "text": "career I think is very interesting you know I think um I think I"
    },
    {
      "start": 530.88,
      "end": 535.12,
      "text": "I think that we're we're moving towards an increasingly efficient um"
    },
    {
      "start": 535.44,
      "end": 536.48,
      "text": "um"
    },
    {
      "start": 541.36,
      "end": 547.44,
      "text": "let me rephrase I think we're we're moving towards an increasingly uh brutal and difficult"
    },
    {
      "start": 547.44,
      "end": 554.32,
      "text": "and yet at the same time probably efficient job market for new graduates and it's extremely"
    },
    {
      "start": 554.32,
      "end": 560.88,
      "text": "difficult to get a job like I'd like to think of myself as a very uh intelligent and thoughtful"
    },
    {
      "start": 560.96,
      "end": 569.12,
      "text": "individual who would be valuable within any organization and yet I applied to probably over 200 jobs"
    },
    {
      "start": 569.68,
      "end": 574.4,
      "text": "and internships throughout college and I never even got a second round interview"
    },
    {
      "start": 575.04,
      "end": 581.4399999999999,
      "text": "I'm not joking I never got a second round interview I got maybe like three or four first round"
    },
    {
      "start": 581.4399999999999,
      "end": 585.92,
      "text": "interviews but everybody wrote me off um"
    },
    {
      "start": 586.0,
      "end": 592.56,
      "text": "so it's a brutal job market out there and it's honestly something people are willing to pay a lot for"
    },
    {
      "start": 592.56,
      "end": 599.68,
      "text": "people pay you know 50,000 plus dollars a year for university education with hopes that they'll get a job"
    },
    {
      "start": 599.68,
      "end": 605.68,
      "text": "now any tool that can help people get jobs like actually get the fucking jobs"
    },
    {
      "start": 605.68,
      "end": 611.28,
      "text": "it would be extremely valuable people would pay a lot of money for so I know that there are a lot of"
    },
    {
      "start": 611.28,
      "end": 618.72,
      "text": "people trying to build AI agents for this but you know even something as simple as like a career AI"
    },
    {
      "start": 618.72,
      "end": 626.48,
      "text": "product where it auto applies to jobs for you has your sort of like AI's uh interview helper like"
    },
    {
      "start": 626.48,
      "end": 634.72,
      "text": "Clueley style whatever it may be and and and helps you identify jobs once again using agents to search"
    },
    {
      "start": 635.36,
      "end": 640.56,
      "text": "applies helps build out the best resume for you helps coach you and how to become the most"
    },
    {
      "start": 640.56,
      "end": 647.4399999999999,
      "text": "effective um sort of uh employee candidate right that would that would"
    },
    {
      "start": 649.4399999999999,
      "end": 654.0799999999999,
      "text": "that that product could could absolutely rip like even my younger brother recently I was actually"
    },
    {
      "start": 654.0799999999999,
      "end": 660.64,
      "text": "able to help him get a job you know nepotism it is what it is he's smart he deserves the job"
    },
    {
      "start": 660.64,
      "end": 669.92,
      "text": "regardless 15 ADSAT but he as well even with that 15 ADSAT had such a hard time if someone had shown"
    },
    {
      "start": 669.92,
      "end": 675.68,
      "text": "me a tool like this that was actually effective I would have told him to pay hundreds of dollars a"
    },
    {
      "start": 675.68,
      "end": 681.4399999999999,
      "text": "month for it or I probably would have bought it for him but you know something along those lines"
    },
    {
      "start": 682.16,
      "end": 689.52,
      "text": "anyways um yeah careers massive not many people have built products in this base successful"
    },
    {
      "start": 689.52,
      "end": 697.76,
      "text": "products rather I should say um so you know that that's an example that was inspired not by me seeing"
    },
    {
      "start": 697.76,
      "end": 704.16,
      "text": "an individual post but like kind of generally understanding the the larger order problems that"
    },
    {
      "start": 704.16,
      "end": 709.52,
      "text": "people nowadays face as well as what the available technology uh could provide in terms of"
    },
    {
      "start": 709.52,
      "end": 714.56,
      "text": "solving it also knowing that none of these products on the market are actually that effective"
    },
    {
      "start": 714.56,
      "end": 718.8,
      "text": "right so we're taking a lot of outside information just on the basis of the category um"
    },
    {
      "start": 721.2,
      "end": 727.36,
      "text": "I don't have like super specific recommendations on how to find and identify problems on on"
    },
    {
      "start": 727.36,
      "end": 728.72,
      "text": "X though"
    },
    {
      "start": 733.6800000000001,
      "end": 739.92,
      "text": "I'm sure just by curating your feed and and consuming high quality information you'll be able to"
    },
    {
      "start": 739.92,
      "end": 747.28,
      "text": "more properly identify uh and you know I think that's always important to stay stay in touch with"
    },
    {
      "start": 747.28,
      "end": 753.28,
      "text": "what's going viral at any given moment right Zach for example Zach went insanely viral with his"
    },
    {
      "start": 754.24,
      "end": 759.8399999999999,
      "text": "SAT tweet let's see it'll be something along the lines of like it's like um"
    },
    {
      "start": 762.3199999999999,
      "end": 770.88,
      "text": "what uh uh let's go from uh what is it Zach got a garrie"
    },
    {
      "start": 770.96,
      "end": 779.84,
      "text": "wait let's see what's Zach's Zach underscore you gotta garrie"
    },
    {
      "start": 791.04,
      "end": 791.52,
      "text": "um"
    },
    {
      "start": 791.52,
      "end": 792.48,
      "text": "um"
    },
    {
      "start": 794.3199999999999,
      "end": 797.68,
      "text": "you had to highlights oh yeah here we go um"
    },
    {
      "start": 800.24,
      "end": 805.36,
      "text": "Zach went extremely viral forgetting rejected from so many colleges in spite of being"
    },
    {
      "start": 805.92,
      "end": 813.04,
      "text": "one of the most competent candidates of all time in my opinion like I've spoken to hundreds of"
    },
    {
      "start": 813.04,
      "end": 818.88,
      "text": "you know 17 18 year olds that have reached out asking me for advice Zach blows and these are all"
    },
    {
      "start": 818.88,
      "end": 824.96,
      "text": "fucking smart high achieving kids Zach blows every single one of them out of the water uh and yet"
    },
    {
      "start": 824.96,
      "end": 831.84,
      "text": "he got rejected from like almost every single school that he applied to um reason I bring this up"
    },
    {
      "start": 831.84,
      "end": 837.84,
      "text": "this this was like one of the most viral things in the news at the time right the 30 million views"
    },
    {
      "start": 837.84,
      "end": 842.24,
      "text": "the people are speaking about it on news stations and whatnot if you generally stay up to date"
    },
    {
      "start": 842.24,
      "end": 847.68,
      "text": "with what's going super viral you'll be able to identify the the most pressing problems that people"
    },
    {
      "start": 847.68,
      "end": 856.3199999999999,
      "text": "face um and sort of build around it okay um I think that generally concludes my spiel for"
    },
    {
      "start": 856.3199999999999,
      "end": 862.0,
      "text": "reddit and x.com as well as scraping other forum websites um I don't have an extremely strict"
    },
    {
      "start": 862.0,
      "end": 869.92,
      "text": "methodology here but rather that you know as you begin to form your idea these can provide more in-depth"
    },
    {
      "start": 870.7199999999999,
      "end": 877.52,
      "text": "information and sort of data to help inform your your your process of product ideation"
    },
    {
      "start": 878.16,
      "end": 882.8,
      "text": "this can even serve as the the starting point of where you come with your idea it's not something"
    },
    {
      "start": 882.8,
      "end": 888.9599999999999,
      "text": "that I've traditionally done uh but but once again just another another solid data point um"
    },
    {
      "start": 889.68,
      "end": 895.8399999999999,
      "text": "cool next up you're gonna have an assignment where you are going to uh think about problems that"
    },
    {
      "start": 895.84,
      "end": 902.48,
      "text": "you experience scroll through social media come up with a ton of different ideas or rather than"
    },
    {
      "start": 902.48,
      "end": 907.44,
      "text": "a ton I should say a bunch of different ideas and then you are going to write a little bit about a"
    },
    {
      "start": 907.44,
      "end": 916.88,
      "text": "few of them in the next unit uh we're gonna go over market research and finalizing your idea before"
    },
    {
      "start": 916.88,
      "end": 924.72,
      "text": "we get into the more material components of building an app uh the modules being design development"
    },
    {
      "start": 924.72,
      "end": 929.36,
      "text": "and distribution so I will see you guys in the next video"
    }
  ]
}