{
  "file_name": "040_Lesson_40.faudio-hi-0-Default.mp4",
  "text": " So I know I just showed a bunch of examples of influencer marketing, but what truly is it? Influencer marketing is basically when you have someone who already has a loyal following promote your product and ideally this is done in a very authentic way where the audience will actually believe that your the influencer you're working with uses the product actually likes the product is genuinely a supporter and therefore they're going to trust the influencer saying that it's good product and they will believe that your product is actually a good product. There's actually been a study done recently. Apparently people trust influencers more than doctors which is pretty insane. Maybe it's not all genes are users but it's a trend that's increasing a lot of people. I actually saw some other article that showed a even bigger number than this but more and more people are starting to trust influencers over any authority figure. So this is something that is only going to be getting bigger influencer marketing as a space and as a marketing channel. It's only going to get more powerful. You could think of it as a transfer of trust. The trust that the audience has in the influencer will be transferred to trusting your product. It's social proof. The influencer is saying it's a good app and their audience will believe them and then it's an emotional connection because if they really support the influencer if they feel like they know them this is kind of called a cult like following when the influencers a deep deep connection with their audience then when the influencer uses something their audience who wants to be exactly like the influencer will go get it and that's really how you have to look at this. A lot of these influencers will just get views and we'll get into that more but that's what you want to stay away from because views alone are worth nothing. You need views that are tied to an influencer which is tied to an audience that trusts them. The audience doesn't trust them if the audience doesn't support them if the audience doesn't like them they will not buy something that influencers themselves. They won't want to be like the influencer and they won't use something that influencer uses or supports. The bottom line is that people trust people. People do not trust companies. So having a person represent your brand and influencer represented and influencers support it that's what these audiences will trust. Cool. Let's move on.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.4,
      "text": "So I know I just showed a bunch of examples of influencer marketing, but what"
    },
    {
      "start": 5.4,
      "end": 10.24,
      "text": "truly is it? Influencer marketing is basically when you have someone who already"
    },
    {
      "start": 10.24,
      "end": 15.76,
      "text": "has a loyal following promote your product and ideally this is done in a"
    },
    {
      "start": 15.76,
      "end": 21.32,
      "text": "very authentic way where the audience will actually believe that your the"
    },
    {
      "start": 21.32,
      "end": 24.76,
      "text": "influencer you're working with uses the product actually likes the product is"
    },
    {
      "start": 24.76,
      "end": 29.84,
      "text": "genuinely a supporter and therefore they're going to trust the influencer"
    },
    {
      "start": 29.84,
      "end": 34.56,
      "text": "saying that it's good product and they will believe that your product is"
    },
    {
      "start": 34.56,
      "end": 38.8,
      "text": "actually a good product. There's actually been a study done recently. Apparently"
    },
    {
      "start": 38.8,
      "end": 45.08,
      "text": "people trust influencers more than doctors which is pretty insane. Maybe it's"
    },
    {
      "start": 45.08,
      "end": 49.879999999999995,
      "text": "not all genes are users but it's a trend that's increasing a lot of people. I"
    },
    {
      "start": 49.879999999999995,
      "end": 53.72,
      "text": "actually saw some other article that showed a even bigger number than this but"
    },
    {
      "start": 53.72,
      "end": 57.36,
      "text": "more and more people are starting to trust influencers over any authority"
    },
    {
      "start": 57.36,
      "end": 63.68,
      "text": "figure. So this is something that is only going to be getting bigger influencer"
    },
    {
      "start": 63.68,
      "end": 67.52,
      "text": "marketing as a space and as a marketing channel. It's only going to get more"
    },
    {
      "start": 67.52,
      "end": 73.32,
      "text": "powerful. You could think of it as a transfer of trust. The trust that the"
    },
    {
      "start": 73.32,
      "end": 77.6,
      "text": "audience has in the influencer will be transferred to trusting your product."
    },
    {
      "start": 77.6,
      "end": 83.92,
      "text": "It's social proof. The influencer is saying it's a good app and their audience"
    },
    {
      "start": 83.92,
      "end": 88.92,
      "text": "will believe them and then it's an emotional connection because if they really"
    },
    {
      "start": 88.92,
      "end": 93.44,
      "text": "support the influencer if they feel like they know them this is kind of called a"
    },
    {
      "start": 93.44,
      "end": 97.52,
      "text": "cult like following when the influencers a deep deep connection with their"
    },
    {
      "start": 97.52,
      "end": 102.52000000000001,
      "text": "audience then when the influencer uses something their audience who wants to be"
    },
    {
      "start": 102.52000000000001,
      "end": 106.6,
      "text": "exactly like the influencer will go get it and that's really how you have to"
    },
    {
      "start": 106.6,
      "end": 111.2,
      "text": "look at this. A lot of these influencers will just get views and we'll get into"
    },
    {
      "start": 111.2,
      "end": 114.44,
      "text": "that more but that's what you want to stay away from because views alone are"
    },
    {
      "start": 114.44,
      "end": 121.60000000000001,
      "text": "worth nothing. You need views that are tied to an influencer which is tied to an"
    },
    {
      "start": 121.60000000000001,
      "end": 125.76,
      "text": "audience that trusts them. The audience doesn't trust them if the audience"
    },
    {
      "start": 125.76,
      "end": 129.56,
      "text": "doesn't support them if the audience doesn't like them they will not buy"
    },
    {
      "start": 129.56,
      "end": 132.56,
      "text": "something that influencers themselves. They won't want to be like the influencer"
    },
    {
      "start": 132.56,
      "end": 139.56,
      "text": "and they won't use something that influencer uses or supports. The bottom"
    },
    {
      "start": 139.56,
      "end": 144.0,
      "text": "line is that people trust people. People do not trust companies. So having a"
    },
    {
      "start": 144.0,
      "end": 148.92000000000002,
      "text": "person represent your brand and influencer represented and influencers support"
    },
    {
      "start": 148.92000000000002,
      "end": 153.16,
      "text": "it that's what these audiences will trust."
    },
    {
      "start": 154.28,
      "end": 157.28,
      "text": "Cool. Let's move on."
    }
  ]
}