{
  "file_name": "038_Lesson_38.faudio-hi-0-Default.mp4",
  "text": " So before we get into any specific channel, it is very important that you understand what goes viral on social media. So the key metrics are watch time, plus people sharing, plus engagement. Well, actually engagement is included in people sharing, but basically just getting someone to watch your video and then have an interaction. So whether that's sharing the video, commenting, hardening the video. That is what ultimately causes the algorithm to pick it up and show it to more people. And there are many ways to skin a cat and go viral. The hook is by far the most important. You need to have a scroll stopping moment. And there are many different ways to do this. You need to capture the attention. And these users, the average time a teenager is spending on their phone nowadays is fucking ridiculous. It's like seven hours a day that they're just sitting there scrolling TikTok. And so they see hundreds of not thousands of videos. What's to say they would stop on your video? Why are you so special? You need something that's going to fucking catch their attention and get them to stop. So there are a few examples that I've pulled. These are not the only ways to get someone's attention. But these are pretty common ones that you'll see. So one is a fight. Everyone loves watching a fight at school. What's the most, what's the biggest event that always happens where everyone just surrounds people in a cafeteria or pulls out their phone, starts recording, shares it to their friends. A fight. People are fighting and everyone wants to see. Fight. It's just human nature that people want to watch them. So. I don't know what they're fighting, but yeah, she's swung at her. And this video got 415,000 likes. And I don't know if we could pull this, but at least a few, yeah, 7.6 million views. Now this guy then goes in and just talks the rest of the video and talks about. I don't even know what he talks about. But this was the hook that got people to stop and watch. They even did. Oh my god. Oh my god. I hate it. I hate it. I hate it. I hate it. I hate it. This is. And then the rest is like, okay, you got people to stop. Now him talking. That's like get the watch. I'm get people to watch. Get people to comment. Share. Like, let's read some of these comments. I mean, people are talking about the fight. Let's, let's, what does he even tell us? He's talking about the fight. And then you do something on the same topic to get the watch time, get people to share, get people to like and engage. Okay. The next scroll stopping moment that we're going to go over is another human desire, an urge a primal and neat thing is sex people are gonna stop if they see a hot girl let's see don't fucking die like this bro there's no fucking hack bro there is no boom catches your attention with a hot girl and the rest of the videos like you got a lot of fucking die like this bro it's not a hot girl anymore the hook got you to stop and then the rest like it's motivation it gets gets you to like the video gets you to comment maybe share it to a friend trick them and thinking it's a hot girl and it's motivation as well and so that is another good way to hook someone in and there are a lot of variations by the way of how to use any of these hooks like this sex hook a lot of times it's used for different motivation pages to be like to catch your attention and they're like you got to lock in man you're being too distracted but then there's also a lot of other people doing that like the quitter guys they have a whole channel dedicated to this Connor and Alex where they show a video of some hot girl and then it cuts to like the goon police is what they call it's actually see if we get pulled up right now goon police yeah this is their account so let's see what they're doing oh you have been doing police very nice so beautiful baby so they're just basically making fun of people that are that are doing it it's getting their attention and then drives them to quitter that's their hook their hook is sex the next scroll-solving moment is getting an influential figure now at a certain point for celebrities you no longer need a hook for for I guess influencers I'll say not celebrities because that doesn't necessarily imply that they're on social media but when people think of influencers they mostly think of tiktokers those kind of people so early on they need hooks to get people to stop and then watch to hear what they're whatever they're gonna say but then if you become famous enough you become the hook why does mr. Beast use his face on every single thumbnail every single thumbnail I was mr. Beast face because he is the hook he is the scroll-solving moment you see his face and you associate that with good content you know you're gonna get something good you know you're gonna get what you want it's the same thing with on tiktok you're scrolling you see someone famous you see a famous mr. Beast video you're going to stop and scroll so let's see how it's used one dollar or mr. a gift so that was passed the hook the hook by the way is always like the first three seconds and right away you could see mr. Beast boom mr. Beast right there it's very possible and mr. Beast isn't even talking he doesn't need to talk for people to know it's him and for him to be used as the hook he's just there and this video this guy alone he's pretty famous it's four million followers but notice how this was his most popular video ever one of them I see there's a 24 million view on but this video 22.8 million views and that's not a coincidence that's because it's a collab with mr. Beast mr. Beast whose way more famous is used as the hook whereas the other ones it's the same exact video but it's just without mr. Beast hooking them in there's also the curiosity hook let's watch this about the universe let me tell you a secret about the universe I want to know a secret about the universe what's this secret you could say adjutant at this point he kind of is the influential figure hook or like him alone seeing his face a lot of people numb and are drawn to him but he was doing this before he was famous this is actually part of how he got famous as he would say these bold things he would make these statements you would draw people in with curiosity and that's how obviously did a lot of controversial stuff too but you need the hooks everybody always says so whatever then he keeps talking gets watched on blah blah blah so okay then there is the urgency plus camera angle and this was actually I wanted to show this one because it was more relevant it was an app and it will watch this for a silent breakdown what they do well I'm gonna be waiting for work thank god I got this thing installed there's the fit let's get dressed oh thank god I'm gonna go know hat but it's fire let's go this guy wakes up in bed he it's a first person point of view is like shit I'm gonna be late for throws off the cover jumps out of bed the viewers strong on ticked out there like what is this who's this guy that's like jumping out of bed you don't even have time to react and think you see this guy that's just fuck coming to be late for work it's like a relatable thing it's urgent it's there's a lot of urgent see there for work the viewers hooked instant hook right there and then he goes into his out got I got this thing which shows I don't actually know that his that he's just coming to this but it shows how to choose your outfit well thank god three million likes tens of millions of views you need your scroll-sopping moment is to give you ideas of how to get people's attention the rest of the video does not matter as much I'd say the hook is 50 is at least 50% of the work going into a video after that you're just trying to get them to enjoy what they watch you want something relating to the hook otherwise there's swipe off after the hook ends you want to keep keep them interested and then ideally they'll share the video or like if if you can pull that off",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 8.6,
      "text": "So before we get into any specific channel, it is very important that you understand what goes viral on social media."
    },
    {
      "start": 8.6,
      "end": 15.200000000000001,
      "text": "So the key metrics are watch time, plus people sharing, plus engagement."
    },
    {
      "start": 15.200000000000001,
      "end": 22.0,
      "text": "Well, actually engagement is included in people sharing, but basically just getting someone to watch your video and then have an interaction."
    },
    {
      "start": 22.0,
      "end": 26.2,
      "text": "So whether that's sharing the video, commenting, hardening the video."
    },
    {
      "start": 27.2,
      "end": 33.2,
      "text": "That is what ultimately causes the algorithm to pick it up and show it to more people."
    },
    {
      "start": 33.2,
      "end": 37.2,
      "text": "And there are many ways to skin a cat and go viral."
    },
    {
      "start": 37.2,
      "end": 41.2,
      "text": "The hook is by far the most important."
    },
    {
      "start": 41.2,
      "end": 45.2,
      "text": "You need to have a scroll stopping moment."
    },
    {
      "start": 45.2,
      "end": 48.2,
      "text": "And there are many different ways to do this."
    },
    {
      "start": 48.2,
      "end": 50.2,
      "text": "You need to capture the attention."
    },
    {
      "start": 50.2,
      "end": 55.2,
      "text": "And these users, the average time a teenager is spending on their phone nowadays is fucking ridiculous."
    },
    {
      "start": 55.2,
      "end": 59.2,
      "text": "It's like seven hours a day that they're just sitting there scrolling TikTok."
    },
    {
      "start": 59.2,
      "end": 63.2,
      "text": "And so they see hundreds of not thousands of videos."
    },
    {
      "start": 63.2,
      "end": 65.2,
      "text": "What's to say they would stop on your video?"
    },
    {
      "start": 65.2,
      "end": 67.2,
      "text": "Why are you so special?"
    },
    {
      "start": 67.2,
      "end": 72.2,
      "text": "You need something that's going to fucking catch their attention and get them to stop."
    },
    {
      "start": 72.2,
      "end": 74.2,
      "text": "So there are a few examples that I've pulled."
    },
    {
      "start": 74.2,
      "end": 78.2,
      "text": "These are not the only ways to get someone's attention."
    },
    {
      "start": 78.2,
      "end": 82.2,
      "text": "But these are pretty common ones that you'll see."
    },
    {
      "start": 82.2,
      "end": 84.2,
      "text": "So one is a fight."
    },
    {
      "start": 84.2,
      "end": 87.2,
      "text": "Everyone loves watching a fight at school."
    },
    {
      "start": 87.2,
      "end": 92.2,
      "text": "What's the most, what's the biggest event that always happens where everyone just surrounds people in a cafeteria"
    },
    {
      "start": 92.2,
      "end": 96.2,
      "text": "or pulls out their phone, starts recording, shares it to their friends."
    },
    {
      "start": 96.2,
      "end": 97.2,
      "text": "A fight."
    },
    {
      "start": 97.2,
      "end": 99.2,
      "text": "People are fighting and everyone wants to see."
    },
    {
      "start": 99.2,
      "end": 100.2,
      "text": "Fight."
    },
    {
      "start": 100.2,
      "end": 103.2,
      "text": "It's just human nature that people want to watch them."
    },
    {
      "start": 103.2,
      "end": 104.2,
      "text": "So."
    },
    {
      "start": 104.2,
      "end": 115.2,
      "text": "I don't know what they're fighting, but yeah, she's swung at her."
    },
    {
      "start": 115.2,
      "end": 119.2,
      "text": "And this video got 415,000 likes."
    },
    {
      "start": 119.2,
      "end": 125.2,
      "text": "And I don't know if we could pull this, but at least a few, yeah, 7.6 million views."
    },
    {
      "start": 125.2,
      "end": 129.2,
      "text": "Now this guy then goes in and just talks the rest of the video and talks about."
    },
    {
      "start": 129.2,
      "end": 131.2,
      "text": "I don't even know what he talks about."
    },
    {
      "start": 131.2,
      "end": 135.2,
      "text": "But this was the hook that got people to stop and watch."
    },
    {
      "start": 135.2,
      "end": 136.2,
      "text": "They even did."
    },
    {
      "start": 136.2,
      "end": 137.2,
      "text": "Oh my god."
    },
    {
      "start": 137.2,
      "end": 138.2,
      "text": "Oh my god."
    },
    {
      "start": 138.2,
      "end": 139.2,
      "text": "I hate it."
    },
    {
      "start": 139.2,
      "end": 140.2,
      "text": "I hate it."
    },
    {
      "start": 140.2,
      "end": 141.2,
      "text": "I hate it."
    },
    {
      "start": 141.2,
      "end": 142.2,
      "text": "I hate it."
    },
    {
      "start": 142.2,
      "end": 143.2,
      "text": "I hate it."
    },
    {
      "start": 143.2,
      "end": 144.2,
      "text": "This is."
    },
    {
      "start": 144.2,
      "end": 148.2,
      "text": "And then the rest is like, okay, you got people to stop."
    },
    {
      "start": 148.2,
      "end": 149.2,
      "text": "Now him talking."
    },
    {
      "start": 149.2,
      "end": 150.2,
      "text": "That's like get the watch."
    },
    {
      "start": 150.2,
      "end": 151.2,
      "text": "I'm get people to watch."
    },
    {
      "start": 151.2,
      "end": 152.2,
      "text": "Get people to comment."
    },
    {
      "start": 152.2,
      "end": 153.2,
      "text": "Share."
    },
    {
      "start": 153.2,
      "end": 155.2,
      "text": "Like, let's read some of these comments."
    },
    {
      "start": 155.2,
      "end": 157.2,
      "text": "I mean, people are talking about the fight."
    },
    {
      "start": 157.2,
      "end": 159.2,
      "text": "Let's, let's, what does he even tell us?"
    },
    {
      "start": 159.2,
      "end": 167.2,
      "text": "He's talking about the fight."
    },
    {
      "start": 167.2,
      "end": 175.2,
      "text": "And then you do something on the same topic to get the watch time, get people to share,"
    },
    {
      "start": 175.2,
      "end": 177.2,
      "text": "get people to like and engage."
    },
    {
      "start": 177.2,
      "end": 181.2,
      "text": "Okay."
    },
    {
      "start": 181.2,
      "end": 186.2,
      "text": "The next scroll stopping moment that we're going to go over is another human desire,"
    },
    {
      "start": 186.2,
      "end": 191.29999999999998,
      "text": "an urge a primal and neat thing is sex people are gonna stop if they see a"
    },
    {
      "start": 191.29999999999998,
      "end": 194.85999999999999,
      "text": "hot girl let's see"
    },
    {
      "start": 198.28,
      "end": 206.29999999999998,
      "text": "don't fucking die like this bro there's no fucking hack bro there is no boom"
    },
    {
      "start": 206.29999999999998,
      "end": 212.67999999999998,
      "text": "catches your attention with a hot girl and the rest of the videos like"
    },
    {
      "start": 212.68,
      "end": 218.28,
      "text": "you got a lot of fucking die like this bro it's not a hot girl anymore the hook got"
    },
    {
      "start": 218.28,
      "end": 222.12,
      "text": "you to stop and then the rest like it's motivation it gets gets you to"
    },
    {
      "start": 222.12,
      "end": 226.44,
      "text": "like the video gets you to comment maybe share it to a friend trick them"
    },
    {
      "start": 226.44,
      "end": 233.72,
      "text": "and thinking it's a hot girl and it's motivation as well and so that is"
    },
    {
      "start": 233.72,
      "end": 238.52,
      "text": "another good way to hook someone in and there are a lot of variations by the way of"
    },
    {
      "start": 238.52,
      "end": 243.68,
      "text": "how to use any of these hooks like this sex hook a lot of times it's used for"
    },
    {
      "start": 243.68,
      "end": 248.08,
      "text": "different motivation pages to be like to catch your attention and they're like"
    },
    {
      "start": 248.08,
      "end": 252.92000000000002,
      "text": "you got to lock in man you're being too distracted but then there's also a lot"
    },
    {
      "start": 252.92000000000002,
      "end": 256.16,
      "text": "of other people doing that like the quitter guys they have a whole channel"
    },
    {
      "start": 256.16,
      "end": 261.64,
      "text": "dedicated to this Connor and Alex where they show a video of some hot girl and"
    },
    {
      "start": 261.64,
      "end": 266.62,
      "text": "then it cuts to like the goon police is what they call it's actually see if we"
    },
    {
      "start": 266.62,
      "end": 269.34000000000003,
      "text": "get pulled up right now"
    },
    {
      "start": 269.74,
      "end": 273.18,
      "text": "goon police"
    },
    {
      "start": 275.18,
      "end": 281.78000000000003,
      "text": "yeah this is their account so let's see what they're doing"
    },
    {
      "start": 282.41999999999996,
      "end": 291.14,
      "text": "oh you have been doing police"
    },
    {
      "start": 291.14,
      "end": 298.61999999999995,
      "text": "very nice so beautiful baby so they're just basically making fun of people that"
    },
    {
      "start": 298.61999999999995,
      "end": 303.05999999999995,
      "text": "are that are doing it it's getting their attention and then drives them to"
    },
    {
      "start": 303.05999999999995,
      "end": 308.29999999999995,
      "text": "quitter that's their hook their hook is sex the next scroll-solving moment is"
    },
    {
      "start": 308.3,
      "end": 315.74,
      "text": "getting an influential figure now at a certain point for celebrities you no"
    },
    {
      "start": 315.74,
      "end": 319.90000000000003,
      "text": "longer need a hook for for I guess influencers I'll say not celebrities because"
    },
    {
      "start": 319.90000000000003,
      "end": 323.78000000000003,
      "text": "that doesn't necessarily imply that they're on social media but when people think"
    },
    {
      "start": 323.78000000000003,
      "end": 327.22,
      "text": "of influencers they mostly think of tiktokers those kind of people so early on"
    },
    {
      "start": 327.22,
      "end": 330.46000000000004,
      "text": "they need hooks to get people to stop and then watch to hear what they're whatever"
    },
    {
      "start": 330.46000000000004,
      "end": 336.38,
      "text": "they're gonna say but then if you become famous enough you become the hook why"
    },
    {
      "start": 336.38,
      "end": 344.42,
      "text": "does mr. Beast use his face on every single thumbnail every single thumbnail"
    },
    {
      "start": 344.42,
      "end": 350.1,
      "text": "I was mr. Beast face because he is the hook he is the scroll-solving moment you"
    },
    {
      "start": 350.1,
      "end": 353.9,
      "text": "see his face and you associate that with good content you know you're gonna get"
    },
    {
      "start": 353.9,
      "end": 356.94,
      "text": "something good you know you're gonna get what you want it's the same thing with"
    },
    {
      "start": 356.94,
      "end": 360.21999999999997,
      "text": "on tiktok you're scrolling you see someone famous you see a famous mr. Beast"
    },
    {
      "start": 360.21999999999997,
      "end": 365.02,
      "text": "video you're going to stop and scroll so let's see how it's used one dollar or"
    },
    {
      "start": 365.02,
      "end": 370.9,
      "text": "mr. a gift so that was passed the hook the hook by the way is always like the"
    },
    {
      "start": 370.9,
      "end": 375.88,
      "text": "first three seconds and right away you could see mr. Beast boom mr. Beast"
    },
    {
      "start": 375.88,
      "end": 383.34,
      "text": "right there it's very possible and mr. Beast isn't even talking he doesn't need to"
    },
    {
      "start": 383.34,
      "end": 388.5,
      "text": "talk for people to know it's him and for him to be used as the hook he's just"
    },
    {
      "start": 388.5,
      "end": 392.62,
      "text": "there and this video this guy alone he's pretty famous it's four million followers"
    },
    {
      "start": 392.62,
      "end": 398.58,
      "text": "but notice how this was his most popular video ever one of them I see there's a"
    },
    {
      "start": 398.58,
      "end": 403.42,
      "text": "24 million view on but this video 22.8 million views and that's not a coincidence"
    },
    {
      "start": 403.42,
      "end": 406.98,
      "text": "that's because it's a collab with mr. Beast mr. Beast whose way more famous is"
    },
    {
      "start": 406.98,
      "end": 411.74,
      "text": "used as the hook whereas the other ones it's the same exact video but it's just"
    },
    {
      "start": 411.74,
      "end": 419.54,
      "text": "without mr. Beast hooking them in there's also the curiosity hook let's watch"
    },
    {
      "start": 419.54,
      "end": 427.22,
      "text": "this about the universe let me tell you a secret about the universe I want to"
    },
    {
      "start": 427.22,
      "end": 432.16,
      "text": "know a secret about the universe what's this secret you could say adjutant at"
    },
    {
      "start": 432.16,
      "end": 436.22,
      "text": "this point he kind of is the influential figure hook or like him alone seeing his face a lot of"
    },
    {
      "start": 436.22,
      "end": 440.5,
      "text": "people numb and are drawn to him but he was doing this before he was famous this is actually part"
    },
    {
      "start": 440.5,
      "end": 445.06,
      "text": "of how he got famous as he would say these bold things he would make these statements"
    },
    {
      "start": 445.06,
      "end": 452.3,
      "text": "you would draw people in with curiosity and that's how obviously did a lot of"
    },
    {
      "start": 452.3,
      "end": 456.86,
      "text": "controversial stuff too but you need the hooks everybody always says so whatever"
    },
    {
      "start": 456.86,
      "end": 462.74,
      "text": "then he keeps talking gets watched on blah blah blah so okay then there is the urgency"
    },
    {
      "start": 462.74,
      "end": 466.7,
      "text": "plus camera angle and this was actually I wanted to show this one because it was more relevant"
    },
    {
      "start": 466.7,
      "end": 473.74,
      "text": "it was an app and it will watch this for a silent breakdown what they do"
    },
    {
      "start": 473.74,
      "end": 481.02,
      "text": "well I'm gonna be waiting for work thank god I got this thing installed there's the fit"
    },
    {
      "start": 481.02,
      "end": 494.62,
      "text": "let's get dressed oh thank god I'm gonna go know hat but it's fire let's go this guy wakes"
    },
    {
      "start": 494.62,
      "end": 499.4,
      "text": "up in bed he it's a first person point of view is like shit I'm gonna be late for throws"
    },
    {
      "start": 499.4,
      "end": 505.46,
      "text": "off the cover jumps out of bed the viewers strong on ticked out there like what is this who's"
    },
    {
      "start": 505.46,
      "end": 509.66,
      "text": "this guy that's like jumping out of bed you don't even have time to react and think you see"
    },
    {
      "start": 509.66,
      "end": 514.9,
      "text": "this guy that's just fuck coming to be late for work it's like a relatable thing it's urgent"
    },
    {
      "start": 514.9,
      "end": 520.9,
      "text": "it's there's a lot of urgent see there for work the viewers hooked instant hook right there"
    },
    {
      "start": 520.9,
      "end": 525.3,
      "text": "and then he goes into his out got I got this thing which shows I don't actually know"
    },
    {
      "start": 525.3,
      "end": 529.42,
      "text": "that his that he's just coming to this but it shows how to choose your outfit"
    },
    {
      "start": 529.42,
      "end": 538.9,
      "text": "well thank god three million likes tens of millions of views you need your scroll-sopping"
    },
    {
      "start": 538.9,
      "end": 544.86,
      "text": "moment is to give you ideas of how to get people's attention the rest of the video does"
    },
    {
      "start": 544.86,
      "end": 553.66,
      "text": "not matter as much I'd say the hook is 50 is at least 50% of the work going into a video"
    },
    {
      "start": 553.66,
      "end": 558.34,
      "text": "after that you're just trying to get them to enjoy what they watch you want something relating"
    },
    {
      "start": 558.34,
      "end": 564.0600000000001,
      "text": "to the hook otherwise there's swipe off after the hook ends you want to keep keep them"
    },
    {
      "start": 564.06,
      "end": 570.38,
      "text": "interested and then ideally they'll share the video or like if if you can pull that off"
    }
  ]
}