{
  "file_name": "047_Lesson_47.faudio-hi-0-Default.mp4",
  "text": " Alright, now that you guys have a good understanding of some of the examples of organic content, let's dive into these types. The first thing that all of you guys should fucking write down is that all content, especially organic content, need to invoke an emotion. What's gonna make them stop scrolling and watch your video? Is it the dopamine hit? Is it because it pisses them off? Rage bait? Does it draw a FOMO? Do they want to be a part of this movement? What is it? So that's first things first. Next, we'll dive into faceless specifically. So faceless, as I mentioned before, doesn't really feature a human behind the camera, like actually filming the video. But it does feature edits, trending audios, trending styles, maybe viral hooks, viral formats. And so if you think about this in the lens of how do I grab attention? We can go through and go back, go back through the content we went through before. For example, this video for Riz, right? This video goes through a text. So you're watching this. There's so many videos that are being bought in the market. So fucking annoying. But it has so many clips in the background of cutting food, like that fucking satisfying videos. And then it has like who the fuck is love maker, right? You already think to yourself, who's love maker? Then you're like, where is this going? Because a lot of people don't even go to the comments and be like, oh, they're plugging Riz app, right? But then it keeps going. They keep watching. Like, oh my god, where's this gonna go? I can't see the next text. I can't see the next text. Next thing you know, they get fucking plugged by Riz, right? Fucking here. Oh, might have missed it. But we went through it earlier. I think it's right here. Oh, it's over here. I got you. Got you guys right there. All right, Riz gets plugged because they were engaged like what's gonna happen next. This one would be Goom Police, right? We took clips of these fucking only thing girls, post themselves online and rage-baited guys. Right? We have so many comments of guys being pissed off at us and mad at us. We have DMs from some of these girls being like, you can't use this, but it made free rights because we edited it. We're not just ripping their content. And then they understand what quitter is. They're like, what the fuck is quitter? What is Goom Police? They click on the link. And next thing you know, they are landing page to Quigooning. And so now they're aware of it. They might not have converted, right? But they'll be aware of us when they see an influencer post or a Gena content or ads, they're more likely to convert down the line. Now what else is faceless? You've got hooks. This is organic actually. This is faceless. We'll get back to organic. So another one, Minecraft Parkour. All these videos plug Riz and show text every single day in DMs. Are you alright? It's been something. And so it's literally what it's doing and plug is Riz. And it makes it like, honestly, this feeds into what people want because people want drama and controversy and be like, what's happening? What's happening? What's happening? And then it shows that Riz is the reason that's saving the day. Riz app is the hero of that story. And I think faceless, like, does some faceless rip into I have some buddies and friends and people in the industry that we know that like make hundreds of thousand dollars on faceless. Yes. Right? It may work for your app. It may not. We highly recommend literally trying every single distribution strategy here. Test them thoroughly and find the one that works for you. We didn't do faceless like Quitter until probably like month four to month five in Fones is what started. Riz started with faceless. They ripped this format and ripped views and went super viral and they just kept doing it and changing iterating. So I recommend looking up trending formats and styles. Look up the Riz app. There's a tool, I'll give you guys at the end of this, called the social growth engineers, but they do case studies on these apps. Get into the Twitter bubble. See what people are doing and talking about. You can really become privy to what's happening, what's going viral on the internet and then apply it for your app. But yeah, faceless, recommend you can use CapCut, you can edit, you can hire editors, but generally speaking, it's carousels. There are people who can hire for this, which we'll go over later on. But generally speaking, it's a rip and run strategy. Okay, UGC. Now, UGC is content made by creators. Just for your guys to say, if you're going to go out and find creators, right, and maybe you want to go to like freelancing sites or you want to go to Twitter. Some of these creators in the e-commerce space think of UGC as like, I'm going to make a video for you, get paid like 500 bucks for you to run it as an ad. That's not the UGC we're doing. We're doing UGC where these creators post two to three times a day on a separate TikTok account that they warm up and will show you how to create accounts, warm them up properly, and then you can eventually train someone to do that. But we want people to post at least two to three times a day with visual hooks, text on screen hooks, skits, et cetera. So when it comes to UGC, you have skits or relatable stories. This kind of goes that turbo-learn approach where it was like, oh my god, my teachers don't know about this. App demos is usually like a text on screen or visual hook, which I'll walk you guys through, one for Twitter, one for raise, then goes into demo. And then another one is like the hook where it's like a huge claim. And this is best for, honestly, I think UGC can rip for conversions if you find a style that works or you're in an industry that already has ripping styles and you can iterate on it. I never suggest fully copying anyone. I think that's retarded. However, like you can don't have to reinvent the wheel and you can iterate on it. You can't really do that. I don't want it for your app. How can you make it better? Transparently, which a lot of you guys probably know this, but I studied Blake and Zach's Influenza Marketing Strategy and put her own spin to it. We started paying people 20% of the front and say the full contract size. We had to make custom tailored video ideas for the influencers because we didn't have one feature that would basically stop people from scrolling and download the app. So going into organic content, right? So we went through faceless right here. Here's one. This is an app called Conch AI. They are a basically Chrome plugin for Chat GBT, but this is my buddy Jude. So he said this absurd. Someone please help me. That's exactly why I made this website called I really don't want to write this paper. You'd be prompt to add some roughen sources and add your old essay. So keep in mind this, I don't really want it to paper.com was a viral format at the time. A lot of people in the space were ripping this format and getting a ton of views and say iterate it on it. But as you can see guys, they're posting two or three times a day on their main account, which you can do as well, where you can create separate TikToks and Instagrams. But they test everything. Look at all the fucking hoaxer texting. Look at all the fucking styles they're testing, people. And now not everything goes viral, but then next thing you know, they have up here, if I show you, they have 15 million views. That probably made them hundreds of thousands of dollars just because they were consistent and disciplined with posting. Another one, I would say, is that space, so let's don't need that. Okay, the raise app that we talked about. So this is a visual and text on the screen hook, right? It's visual because she just got out of the shower. You can see she has tan lines and then she's saying how to get tan and then in parentheses, if you never get tan. And then she shows the app. It's a direct plug of the app. And she shows how it works and then all these girls downloaded this because I want to use this. And then if you look at her account, she only has 1,500 followers, but there's so many of these posts of girls. My hunch is they probably like hide-and-match girls have filmed videos and they did the posting to make it easier. But like here we go, UV9 no problem. But also like if you see here, like look, it kind of looks like she's fucking naked, right? That's a visual hook. People stop and like what the fuck? But it shows the app. And so they keep posting 2 to 3 times a day consistently to get to work. Turbo learn, right? This was a viral strategy. You know this because when she goes through this whole thing, you don't even listen to it yet. She shows Turbo learn, right? And this is like one of those fucking like crystal girls, like bullshit, whatever. But this girl is 15,000 followers now and she's a Turbo AI diva. That's like her brand. She's been posting so much but she tried all of these styles, 14K, 13K, 121K. And the one we watch I think got 10 million, yeah right here. So she iterated on that style and that's iterated on more but she doesn't rip 10 millions of views of every single video. She has to test and study. So another one is for Quitter, right? So we realize that if you have a visual hook of lotion or tissues, etc., it'll go viral. So this was one, he was caught gooning, right? Stage that. This was morning routine addicted to corn, like show the thing, show all the visual hooks. And then what happens? Most guys have fucking post-loc clarity, clarity. I hate lust, right? POV, this is you after work. But we test so many fucking styles. Like we have to test everything to see if it'll work. All right, that is UGC, right? I would make sure you guys understand you want to post two to three times a day on your account after you warm it up. You usually warm up your account for four days roughly by acting like a real user and we'll have a very extensive walkthrough and how you can do that. But generally speaking, like look at what other apps are doing in space. See what's working and how can you iterate it for your own app. That is probably the best advice I can give anyone if they're looking to go viral and organic, right? Everyone people tell you, oh, I can do it for you. You can hire an agency, but none of that stuff generally works. I would just say final works for you. You guys try it yourself, rip it, and eventually you can start hiring people to do it. Now if you have the cash to hire someone, there are a bunch of resources we'll be giving at the end of distribution. Who you can hire, we'll recommend. And I guess best thoughts to go about doing it. I lost the word of my head. But, okay, read it. So, we didn't go over Reddit case studies because I think Reddit is very niche and but it can work well. When we started Quitter, the first thing we're doing was Reddit. And so just realize that the Reddit guys is a lot of your accounts will get banned. A lot of the times you get kicked out of these subreddits because they're going to realize that you're pushing these apps and they don't want shit pushed. There's very strong Reddit communities. But the purpose of Reddit is to do storytelling posts where you build this like rock hitting rock bottom. The app is the hero and you found it and you make it for your organic so it seems like someone's really posted about it and you're not like hard pushing and hard selling your app. I would say for like a week or two just talking communities as a normal person and you push the app. You can also go on some sites and buy Reddit accounts with exists in karma. So generally it was I was struggling with blank until I tried this. That can generally be too pushy. But if you build this into a story, you're good. And guess what? You can use AI to help you out. Don't make this harder than it has to be. And so for example, this is one that we had to go vile for quitter. So not sure when it became controversial to say this maybe it always was but porn is absolutely warped how people see love sex and relationships. Keep in mind this is a sex gender and dating subreddit. It doesn't matter that it's been around forever. So I have a lot of things we've rightly left behind. No one who's built anything meaningful legacy. This also looks like it's written by an idiot. I think we did that on purpose because I came and fucking read it. But it comes down to me a lot. I say we're from it the more obviously became porn is mental junk food zero. And then we edited it. And if anyone if it's of any help to someone I personally use quitter, right? So they plug quitter at the end. This is about being a Christian. It was severe point. He edited it. We found this app so we posted it at ripped views and then we. You know how come any. Why a lot of Christian men Alex is going to come and say what's up. Mr. Slaser itself. We're going over our quitter reddit high level. Why a lot of Christian men fail at falling to porn. And then we edit it after it rips views and say that quitter is what helps them. And so it became super organic. A lot of the moderators wouldn't get rid of this and then we'd rip fucking engagement and then we'd edit quitter in there and it would stay. Last one we're going over is X right so previously Twitter. So X is fun because it can be cheap and really effective if you put a lot of shots up. So you really want memes and day of thread. Those are the biggest ones. So like a meme for example would be right here. So one meme is like anti porn quitter contripsing little tas account getting banned for child safety. This was July 25th. So like little T was like basically saying hey I'm going to drop only fans and we always advance to with her on Twitter and be like you shouldn't drop an only fans X Y and Z and then we I'm pretty sure paid this person a post this. We did anti corn app right porn quitter seeks to buy only fans shut down like 125k. We said J calls down to Twitter. We paid all of these accounts generally like couple hundred bucks to post this. So here's the biggest one everyone saw anti porn app quitter seeks to buy only fans shut it down. It's got 11 million fucking impressions. This guy probably brought in like a hundred grand 200 grand over the course of a week off of this alone and then we put the link here. I got almost a million impressions. Now this one's super viral. People to this day are always like you guys going to buy only fans. It's like yeah I have a cool 5 billion laying around and some people think we're real and I'm like you're an idiot. But what I would say is dude people know this but we paid this account like a hundred bucks because he posts like 20 times a day. But he's doing is charging 50 to 100 bucks per Twitter thread or Twitter post and we know that he already has followers and so he is more likely to a viral. Another one I would say and show is like this. So we paid this masculine page right to do a thread on us. And what they did was show that porn is the worst drug for young men and here's why and people tend to read this stuff and it goes through like clips of what it does, how it affects you and then eventually goes like you want to quit porn here's quitter. And so you're only paying a couple hundred bucks for this stuff and you can also apply the same view guarantee model to it. So you're putting a lot of shots on net for Twitter X and what this will do is build a story and reach and drive conversions. I did in a day like the more people that have seen your app understand your app and know what it is are likely to convert on the next push right. So if you have someone that sees it five or six times I have a download on that seventh eighth ninth time they've seen it like I need to download this or we realize with quitter people tended men young men specifically tended to download our app at night because they probably just jerked off they post not clear to have to delete this thing and get off this. What can you do to help they know quitter. So generally speaking right understand that each piece of organic content has its own role in the funnel. However, you got to should know that there is a chance that it could be the main role. So faceless generally like we use faceless as awareness right and hit volume. Does it drive downloads? Yes, but you need more shots on net with that you have to post a tumour volume. For example, influencers, influencers one post could drive a ton of value. Like our faceless video for quitter I think I showed you guys this if I go to quitter. So this reel that we posted we post a lot of these right we put a lot of these different sour things for testing around. This one that got 2 million views because it was like 1.2 million views for how much you goon. I don't honestly know this converted a lot but guess what people know quitter is people are fucking commenting out the wazoo and liking this thing it's hilarious and they're like what's quitter and then they'll see an influencer post or they'll see an organic post and convert. So faceless generally is good for awareness and from there you will drive downloads. UGC I think is fucking amazing especially if you can crack it for your industry because it's real people doing it and people trust real people. Reddit I think is when you're starting off it's great it's gritty it's story driven you can get your first couple thousand dollars a ten thousand dollars months from it especially if you find that it's subreddits X as well it's something that's on the cheaper end but you really have to understand the algorithm in your industry and how to invoke an emotion. If you can pull an emotion out of Reddit and X you will win those games like fuck it actually you can pull an emotion out of faceless you just read it and X you will win right think about what do you want the viewer to feel what's going to stop them from scrolling make them read your content and build trust with you. So",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 6.12,
      "text": "Alright, now that you guys have a good understanding of some of the examples of organic content,"
    },
    {
      "start": 6.12,
      "end": 7.92,
      "text": "let's dive into these types."
    },
    {
      "start": 7.92,
      "end": 13.02,
      "text": "The first thing that all of you guys should fucking write down is that all content, especially"
    },
    {
      "start": 13.02,
      "end": 15.56,
      "text": "organic content, need to invoke an emotion."
    },
    {
      "start": 15.56,
      "end": 18.18,
      "text": "What's gonna make them stop scrolling and watch your video?"
    },
    {
      "start": 18.18,
      "end": 19.62,
      "text": "Is it the dopamine hit?"
    },
    {
      "start": 19.62,
      "end": 21.48,
      "text": "Is it because it pisses them off?"
    },
    {
      "start": 21.48,
      "end": 22.48,
      "text": "Rage bait?"
    },
    {
      "start": 22.48,
      "end": 23.48,
      "text": "Does it draw a FOMO?"
    },
    {
      "start": 23.48,
      "end": 25.92,
      "text": "Do they want to be a part of this movement?"
    },
    {
      "start": 25.92,
      "end": 27.400000000000002,
      "text": "What is it?"
    },
    {
      "start": 27.400000000000002,
      "end": 28.84,
      "text": "So that's first things first."
    },
    {
      "start": 28.84,
      "end": 31.759999999999998,
      "text": "Next, we'll dive into faceless specifically."
    },
    {
      "start": 31.759999999999998,
      "end": 37.480000000000004,
      "text": "So faceless, as I mentioned before, doesn't really feature a human behind the camera,"
    },
    {
      "start": 37.480000000000004,
      "end": 39.6,
      "text": "like actually filming the video."
    },
    {
      "start": 39.6,
      "end": 47.120000000000005,
      "text": "But it does feature edits, trending audios, trending styles, maybe viral hooks, viral formats."
    },
    {
      "start": 47.120000000000005,
      "end": 51.28,
      "text": "And so if you think about this in the lens of how do I grab attention?"
    },
    {
      "start": 51.28,
      "end": 56.64,
      "text": "We can go through and go back, go back through the content we went through before."
    },
    {
      "start": 56.64,
      "end": 59.88,
      "text": "For example, this video for Riz, right?"
    },
    {
      "start": 59.88,
      "end": 61.8,
      "text": "This video goes through a text."
    },
    {
      "start": 61.8,
      "end": 62.8,
      "text": "So you're watching this."
    },
    {
      "start": 62.8,
      "end": 64.48,
      "text": "There's so many videos that are being bought in the market."
    },
    {
      "start": 64.48,
      "end": 65.48,
      "text": "So fucking annoying."
    },
    {
      "start": 65.48,
      "end": 72.28,
      "text": "But it has so many clips in the background of cutting food, like that fucking satisfying"
    },
    {
      "start": 72.28,
      "end": 73.28,
      "text": "videos."
    },
    {
      "start": 73.28,
      "end": 76.0,
      "text": "And then it has like who the fuck is love maker, right?"
    },
    {
      "start": 76.0,
      "end": 77.48,
      "text": "You already think to yourself, who's love maker?"
    },
    {
      "start": 77.48,
      "end": 78.72,
      "text": "Then you're like, where is this going?"
    },
    {
      "start": 78.72,
      "end": 82.04,
      "text": "Because a lot of people don't even go to the comments and be like, oh, they're plugging"
    },
    {
      "start": 82.04,
      "end": 83.04,
      "text": "Riz app, right?"
    },
    {
      "start": 83.04,
      "end": 84.04,
      "text": "But then it keeps going."
    },
    {
      "start": 84.04,
      "end": 85.04,
      "text": "They keep watching."
    },
    {
      "start": 85.04,
      "end": 86.04,
      "text": "Like, oh my god, where's this gonna go?"
    },
    {
      "start": 86.04,
      "end": 87.04,
      "text": "I can't see the next text."
    },
    {
      "start": 87.04,
      "end": 88.04,
      "text": "I can't see the next text."
    },
    {
      "start": 88.04,
      "end": 95.48,
      "text": "Next thing you know, they get fucking plugged by Riz, right?"
    },
    {
      "start": 95.48,
      "end": 97.48,
      "text": "Fucking here."
    },
    {
      "start": 97.48,
      "end": 100.64,
      "text": "Oh, might have missed it."
    },
    {
      "start": 100.64,
      "end": 103.60000000000001,
      "text": "But we went through it earlier."
    },
    {
      "start": 103.60000000000001,
      "end": 104.60000000000001,
      "text": "I think it's right here."
    },
    {
      "start": 104.60000000000001,
      "end": 105.80000000000001,
      "text": "Oh, it's over here."
    },
    {
      "start": 105.80000000000001,
      "end": 106.80000000000001,
      "text": "I got you."
    },
    {
      "start": 106.80000000000001,
      "end": 108.24000000000001,
      "text": "Got you guys right there."
    },
    {
      "start": 108.24000000000001,
      "end": 113.88000000000001,
      "text": "All right, Riz gets plugged because they were engaged like what's gonna happen next."
    },
    {
      "start": 113.88,
      "end": 116.36,
      "text": "This one would be Goom Police, right?"
    },
    {
      "start": 116.36,
      "end": 123.88,
      "text": "We took clips of these fucking only thing girls, post themselves online and rage-baited guys."
    },
    {
      "start": 123.88,
      "end": 124.88,
      "text": "Right?"
    },
    {
      "start": 124.88,
      "end": 128.24,
      "text": "We have so many comments of guys being pissed off at us and mad at us."
    },
    {
      "start": 128.24,
      "end": 131.32,
      "text": "We have DMs from some of these girls being like, you can't use this, but it made free"
    },
    {
      "start": 131.32,
      "end": 133.32,
      "text": "rights because we edited it."
    },
    {
      "start": 133.32,
      "end": 135.28,
      "text": "We're not just ripping their content."
    },
    {
      "start": 135.28,
      "end": 136.28,
      "text": "And then they understand what quitter is."
    },
    {
      "start": 136.28,
      "end": 137.51999999999998,
      "text": "They're like, what the fuck is quitter?"
    },
    {
      "start": 137.51999999999998,
      "end": 138.51999999999998,
      "text": "What is Goom Police?"
    },
    {
      "start": 138.51999999999998,
      "end": 140.44,
      "text": "They click on the link."
    },
    {
      "start": 140.44,
      "end": 144.12,
      "text": "And next thing you know, they are landing page to Quigooning."
    },
    {
      "start": 144.12,
      "end": 145.12,
      "text": "And so now they're aware of it."
    },
    {
      "start": 145.12,
      "end": 147.24,
      "text": "They might not have converted, right?"
    },
    {
      "start": 147.24,
      "end": 150.64,
      "text": "But they'll be aware of us when they see an influencer post or a Gena content or ads,"
    },
    {
      "start": 150.64,
      "end": 154.32,
      "text": "they're more likely to convert down the line."
    },
    {
      "start": 154.32,
      "end": 156.32,
      "text": "Now what else is faceless?"
    },
    {
      "start": 156.32,
      "end": 157.8,
      "text": "You've got hooks."
    },
    {
      "start": 157.8,
      "end": 160.24,
      "text": "This is organic actually."
    },
    {
      "start": 160.24,
      "end": 161.24,
      "text": "This is faceless."
    },
    {
      "start": 161.24,
      "end": 162.32,
      "text": "We'll get back to organic."
    },
    {
      "start": 162.32,
      "end": 164.76,
      "text": "So another one, Minecraft Parkour."
    },
    {
      "start": 164.76,
      "end": 168.76,
      "text": "All these videos plug Riz and show text every single day in DMs."
    },
    {
      "start": 168.76,
      "end": 169.76,
      "text": "Are you alright?"
    },
    {
      "start": 169.76,
      "end": 170.76,
      "text": "It's been something."
    },
    {
      "start": 170.76,
      "end": 175.16,
      "text": "And so it's literally what it's doing and plug is Riz."
    },
    {
      "start": 175.16,
      "end": 181.76,
      "text": "And it makes it like, honestly, this feeds into what people want because people want drama"
    },
    {
      "start": 181.76,
      "end": 183.44,
      "text": "and controversy and be like, what's happening?"
    },
    {
      "start": 183.44,
      "end": 184.44,
      "text": "What's happening?"
    },
    {
      "start": 184.44,
      "end": 185.44,
      "text": "What's happening?"
    },
    {
      "start": 185.44,
      "end": 188.07999999999998,
      "text": "And then it shows that Riz is the reason that's saving the day."
    },
    {
      "start": 188.07999999999998,
      "end": 192.51999999999998,
      "text": "Riz app is the hero of that story."
    },
    {
      "start": 192.51999999999998,
      "end": 196.88,
      "text": "And I think faceless, like, does some faceless rip into I have some buddies and friends and"
    },
    {
      "start": 196.88,
      "end": 200.96,
      "text": "people in the industry that we know that like make hundreds of thousand dollars on faceless."
    },
    {
      "start": 200.96,
      "end": 201.96,
      "text": "Yes."
    },
    {
      "start": 201.96,
      "end": 202.96,
      "text": "Right?"
    },
    {
      "start": 202.96,
      "end": 203.96,
      "text": "It may work for your app."
    },
    {
      "start": 203.96,
      "end": 204.96,
      "text": "It may not."
    },
    {
      "start": 204.96,
      "end": 208.76,
      "text": "We highly recommend literally trying every single distribution strategy here."
    },
    {
      "start": 208.76,
      "end": 211.48,
      "text": "Test them thoroughly and find the one that works for you."
    },
    {
      "start": 211.48,
      "end": 215.35999999999999,
      "text": "We didn't do faceless like Quitter until probably like month four to month five in Fones"
    },
    {
      "start": 215.35999999999999,
      "end": 216.35999999999999,
      "text": "is what started."
    },
    {
      "start": 216.35999999999999,
      "end": 218.35999999999999,
      "text": "Riz started with faceless."
    },
    {
      "start": 218.35999999999999,
      "end": 222.35999999999999,
      "text": "They ripped this format and ripped views and went super viral and they just kept doing"
    },
    {
      "start": 222.35999999999999,
      "end": 224.4,
      "text": "it and changing iterating."
    },
    {
      "start": 224.4,
      "end": 228.32,
      "text": "So I recommend looking up trending formats and styles."
    },
    {
      "start": 228.32,
      "end": 230.20000000000002,
      "text": "Look up the Riz app."
    },
    {
      "start": 230.20000000000002,
      "end": 234.20000000000002,
      "text": "There's a tool, I'll give you guys at the end of this, called the social growth engineers,"
    },
    {
      "start": 234.20000000000002,
      "end": 236.56,
      "text": "but they do case studies on these apps."
    },
    {
      "start": 236.56,
      "end": 237.56,
      "text": "Get into the Twitter bubble."
    },
    {
      "start": 237.56,
      "end": 238.84,
      "text": "See what people are doing and talking about."
    },
    {
      "start": 238.84,
      "end": 243.4,
      "text": "You can really become privy to what's happening, what's going viral on the internet and then"
    },
    {
      "start": 243.4,
      "end": 244.84,
      "text": "apply it for your app."
    },
    {
      "start": 244.84,
      "end": 250.32,
      "text": "But yeah, faceless, recommend you can use CapCut, you can edit, you can hire editors,"
    },
    {
      "start": 250.32,
      "end": 252.04000000000002,
      "text": "but generally speaking, it's carousels."
    },
    {
      "start": 252.04,
      "end": 256.4,
      "text": "There are people who can hire for this, which we'll go over later on."
    },
    {
      "start": 256.4,
      "end": 259.8,
      "text": "But generally speaking, it's a rip and run strategy."
    },
    {
      "start": 259.8,
      "end": 261.28,
      "text": "Okay, UGC."
    },
    {
      "start": 261.28,
      "end": 266.03999999999996,
      "text": "Now, UGC is content made by creators."
    },
    {
      "start": 266.03999999999996,
      "end": 269.52,
      "text": "Just for your guys to say, if you're going to go out and find creators, right, and maybe"
    },
    {
      "start": 269.52,
      "end": 273.59999999999997,
      "text": "you want to go to like freelancing sites or you want to go to Twitter."
    },
    {
      "start": 273.59999999999997,
      "end": 276.84,
      "text": "Some of these creators in the e-commerce space think of UGC as like, I'm going to make"
    },
    {
      "start": 276.84,
      "end": 281.12,
      "text": "a video for you, get paid like 500 bucks for you to run it as an ad."
    },
    {
      "start": 281.12,
      "end": 282.96,
      "text": "That's not the UGC we're doing."
    },
    {
      "start": 282.96,
      "end": 287.4,
      "text": "We're doing UGC where these creators post two to three times a day on a separate TikTok"
    },
    {
      "start": 287.4,
      "end": 291.68,
      "text": "account that they warm up and will show you how to create accounts, warm them up properly,"
    },
    {
      "start": 291.68,
      "end": 294.56,
      "text": "and then you can eventually train someone to do that."
    },
    {
      "start": 294.56,
      "end": 299.12,
      "text": "But we want people to post at least two to three times a day with visual hooks, text on"
    },
    {
      "start": 299.12,
      "end": 301.52,
      "text": "screen hooks, skits, et cetera."
    },
    {
      "start": 301.52,
      "end": 304.32,
      "text": "So when it comes to UGC, you have skits or relatable stories."
    },
    {
      "start": 304.32,
      "end": 307.6,
      "text": "This kind of goes that turbo-learn approach where it was like, oh my god, my teachers"
    },
    {
      "start": 307.6,
      "end": 309.40000000000003,
      "text": "don't know about this."
    },
    {
      "start": 309.40000000000003,
      "end": 313.72,
      "text": "App demos is usually like a text on screen or visual hook, which I'll walk you guys through,"
    },
    {
      "start": 313.72,
      "end": 317.6,
      "text": "one for Twitter, one for raise, then goes into demo."
    },
    {
      "start": 317.6,
      "end": 319.88,
      "text": "And then another one is like the hook where it's like a huge claim."
    },
    {
      "start": 319.88,
      "end": 324.84000000000003,
      "text": "And this is best for, honestly, I think UGC can rip for conversions if you find a style"
    },
    {
      "start": 324.84000000000003,
      "end": 328.52000000000004,
      "text": "that works or you're in an industry that already has ripping styles and you can iterate"
    },
    {
      "start": 328.52000000000004,
      "end": 329.52000000000004,
      "text": "on it."
    },
    {
      "start": 329.52000000000004,
      "end": 331.32000000000005,
      "text": "I never suggest fully copying anyone."
    },
    {
      "start": 331.32000000000005,
      "end": 332.92,
      "text": "I think that's retarded."
    },
    {
      "start": 332.92,
      "end": 337.24,
      "text": "However, like you can don't have to reinvent the wheel and you can iterate on it."
    },
    {
      "start": 337.24,
      "end": 338.24,
      "text": "You can't really do that."
    },
    {
      "start": 338.24,
      "end": 339.24,
      "text": "I don't want it for your app."
    },
    {
      "start": 339.24,
      "end": 340.24,
      "text": "How can you make it better?"
    },
    {
      "start": 340.24,
      "end": 343.48,
      "text": "Transparently, which a lot of you guys probably know this, but I studied Blake and Zach's"
    },
    {
      "start": 343.48,
      "end": 346.40000000000003,
      "text": "Influenza Marketing Strategy and put her own spin to it."
    },
    {
      "start": 346.40000000000003,
      "end": 349.72,
      "text": "We started paying people 20% of the front and say the full contract size."
    },
    {
      "start": 349.72,
      "end": 354.36,
      "text": "We had to make custom tailored video ideas for the influencers because we didn't have"
    },
    {
      "start": 354.36,
      "end": 358.92,
      "text": "one feature that would basically stop people from scrolling and download the app."
    },
    {
      "start": 358.92,
      "end": 362.36,
      "text": "So going into organic content, right?"
    },
    {
      "start": 362.36,
      "end": 364.92,
      "text": "So we went through faceless right here."
    },
    {
      "start": 364.92,
      "end": 365.92,
      "text": "Here's one."
    },
    {
      "start": 365.92,
      "end": 368.52000000000004,
      "text": "This is an app called Conch AI."
    },
    {
      "start": 368.52000000000004,
      "end": 374.6,
      "text": "They are a basically Chrome plugin for Chat GBT, but this is my buddy Jude."
    },
    {
      "start": 374.6,
      "end": 375.6,
      "text": "So he said this absurd."
    },
    {
      "start": 375.6,
      "end": 376.6,
      "text": "Someone please help me."
    },
    {
      "start": 376.6,
      "end": 386.24,
      "text": "That's exactly why I made this website called I really don't want to write this paper."
    },
    {
      "start": 386.24,
      "end": 389.48,
      "text": "You'd be prompt to add some roughen sources and add your old essay."
    },
    {
      "start": 389.48,
      "end": 394.64,
      "text": "So keep in mind this, I don't really want it to paper.com was a viral format at the"
    },
    {
      "start": 394.64,
      "end": 395.64,
      "text": "time."
    },
    {
      "start": 395.64,
      "end": 398.15999999999997,
      "text": "A lot of people in the space were ripping this format and getting a ton of views and say"
    },
    {
      "start": 398.15999999999997,
      "end": 399.36,
      "text": "iterate it on it."
    },
    {
      "start": 399.36,
      "end": 403.59999999999997,
      "text": "But as you can see guys, they're posting two or three times a day on their main account,"
    },
    {
      "start": 403.59999999999997,
      "end": 406.96,
      "text": "which you can do as well, where you can create separate TikToks and Instagrams."
    },
    {
      "start": 406.96,
      "end": 408.96,
      "text": "But they test everything."
    },
    {
      "start": 408.96,
      "end": 410.52,
      "text": "Look at all the fucking hoaxer texting."
    },
    {
      "start": 410.52,
      "end": 414.15999999999997,
      "text": "Look at all the fucking styles they're testing, people."
    },
    {
      "start": 414.15999999999997,
      "end": 417.88,
      "text": "And now not everything goes viral, but then next thing you know, they have up here, if"
    },
    {
      "start": 417.88,
      "end": 420.36,
      "text": "I show you, they have 15 million views."
    },
    {
      "start": 420.6,
      "end": 424.8,
      "text": "That probably made them hundreds of thousands of dollars just because they were consistent"
    },
    {
      "start": 424.8,
      "end": 427.0,
      "text": "and disciplined with posting."
    },
    {
      "start": 427.0,
      "end": 430.8,
      "text": "Another one, I would say, is that space, so let's don't need that."
    },
    {
      "start": 430.8,
      "end": 432.84000000000003,
      "text": "Okay, the raise app that we talked about."
    },
    {
      "start": 432.84000000000003,
      "end": 437.36,
      "text": "So this is a visual and text on the screen hook, right?"
    },
    {
      "start": 437.36,
      "end": 438.76,
      "text": "It's visual because she just got out of the shower."
    },
    {
      "start": 438.76,
      "end": 442.8,
      "text": "You can see she has tan lines and then she's saying how to get tan and then in parentheses,"
    },
    {
      "start": 442.8,
      "end": 444.40000000000003,
      "text": "if you never get tan."
    },
    {
      "start": 444.40000000000003,
      "end": 445.8,
      "text": "And then she shows the app."
    },
    {
      "start": 445.8,
      "end": 449.56,
      "text": "It's a direct plug of the app."
    },
    {
      "start": 449.56,
      "end": 452.44,
      "text": "And she shows how it works and then all these girls downloaded this because I want to use"
    },
    {
      "start": 452.44,
      "end": 453.44,
      "text": "this."
    },
    {
      "start": 453.44,
      "end": 458.12,
      "text": "And then if you look at her account, she only has 1,500 followers, but there's so many"
    },
    {
      "start": 458.12,
      "end": 461.56,
      "text": "of these posts of girls."
    },
    {
      "start": 461.56,
      "end": 464.84000000000003,
      "text": "My hunch is they probably like hide-and-match girls have filmed videos and they did the posting"
    },
    {
      "start": 464.84000000000003,
      "end": 467.36,
      "text": "to make it easier."
    },
    {
      "start": 467.36,
      "end": 471.32,
      "text": "But like here we go, UV9 no problem."
    },
    {
      "start": 471.32,
      "end": 477.72,
      "text": "But also like if you see here, like look, it kind of looks like she's fucking naked, right?"
    },
    {
      "start": 477.72,
      "end": 478.72,
      "text": "That's a visual hook."
    },
    {
      "start": 478.72,
      "end": 480.44000000000005,
      "text": "People stop and like what the fuck?"
    },
    {
      "start": 480.44000000000005,
      "end": 481.44000000000005,
      "text": "But it shows the app."
    },
    {
      "start": 481.44000000000005,
      "end": 485.92,
      "text": "And so they keep posting 2 to 3 times a day consistently to get to work."
    },
    {
      "start": 485.92,
      "end": 486.92,
      "text": "Turbo learn, right?"
    },
    {
      "start": 486.92,
      "end": 488.72,
      "text": "This was a viral strategy."
    },
    {
      "start": 488.72,
      "end": 493.68,
      "text": "You know this because when she goes through this whole thing, you don't even listen to it"
    },
    {
      "start": 493.68,
      "end": 495.32000000000005,
      "text": "yet."
    },
    {
      "start": 495.32000000000005,
      "end": 496.96000000000004,
      "text": "She shows Turbo learn, right?"
    },
    {
      "start": 496.96000000000004,
      "end": 501.48,
      "text": "And this is like one of those fucking like crystal girls, like bullshit, whatever."
    },
    {
      "start": 501.48,
      "end": 505.96000000000004,
      "text": "But this girl is 15,000 followers now and she's a Turbo AI diva."
    },
    {
      "start": 505.96000000000004,
      "end": 507.68,
      "text": "That's like her brand."
    },
    {
      "start": 507.68,
      "end": 512.6800000000001,
      "text": "She's been posting so much but she tried all of these styles, 14K, 13K, 121K."
    },
    {
      "start": 512.6800000000001,
      "end": 515.76,
      "text": "And the one we watch I think got 10 million, yeah right here."
    },
    {
      "start": 515.76,
      "end": 519.5600000000001,
      "text": "So she iterated on that style and that's iterated on more but she doesn't rip 10 millions"
    },
    {
      "start": 519.5600000000001,
      "end": 521.28,
      "text": "of views of every single video."
    },
    {
      "start": 521.28,
      "end": 523.64,
      "text": "She has to test and study."
    },
    {
      "start": 523.64,
      "end": 526.96,
      "text": "So another one is for Quitter, right?"
    },
    {
      "start": 526.96,
      "end": 536.04,
      "text": "So we realize that if you have a visual hook of lotion or tissues, etc., it'll go viral."
    },
    {
      "start": 536.04,
      "end": 542.0799999999999,
      "text": "So this was one, he was caught gooning, right?"
    },
    {
      "start": 542.0799999999999,
      "end": 543.0799999999999,
      "text": "Stage that."
    },
    {
      "start": 543.0799999999999,
      "end": 547.68,
      "text": "This was morning routine addicted to corn, like show the thing, show all the visual hooks."
    },
    {
      "start": 547.68,
      "end": 550.0799999999999,
      "text": "And then what happens?"
    },
    {
      "start": 550.0799999999999,
      "end": 555.24,
      "text": "Most guys have fucking post-loc clarity, clarity."
    },
    {
      "start": 555.24,
      "end": 556.24,
      "text": "I hate lust, right?"
    },
    {
      "start": 556.24,
      "end": 557.64,
      "text": "POV, this is you after work."
    },
    {
      "start": 557.64,
      "end": 559.88,
      "text": "But we test so many fucking styles."
    },
    {
      "start": 559.88,
      "end": 565.76,
      "text": "Like we have to test everything to see if it'll work."
    },
    {
      "start": 565.8,
      "end": 568.8,
      "text": "All right, that is UGC, right?"
    },
    {
      "start": 568.8,
      "end": 573.4399999999999,
      "text": "I would make sure you guys understand you want to post two to three times a day on your"
    },
    {
      "start": 573.4399999999999,
      "end": 574.92,
      "text": "account after you warm it up."
    },
    {
      "start": 574.92,
      "end": 578.68,
      "text": "You usually warm up your account for four days roughly by acting like a real user and we'll"
    },
    {
      "start": 578.68,
      "end": 581.4,
      "text": "have a very extensive walkthrough and how you can do that."
    },
    {
      "start": 581.4,
      "end": 585.56,
      "text": "But generally speaking, like look at what other apps are doing in space."
    },
    {
      "start": 585.56,
      "end": 588.6,
      "text": "See what's working and how can you iterate it for your own app."
    },
    {
      "start": 588.6,
      "end": 594.2,
      "text": "That is probably the best advice I can give anyone if they're looking to go viral and"
    },
    {
      "start": 594.2,
      "end": 595.2,
      "text": "organic, right?"
    },
    {
      "start": 595.24,
      "end": 597.2800000000001,
      "text": "Everyone people tell you, oh, I can do it for you."
    },
    {
      "start": 597.2800000000001,
      "end": 601.24,
      "text": "You can hire an agency, but none of that stuff generally works."
    },
    {
      "start": 601.24,
      "end": 603.0,
      "text": "I would just say final works for you."
    },
    {
      "start": 603.0,
      "end": 607.24,
      "text": "You guys try it yourself, rip it, and eventually you can start hiring people to do it."
    },
    {
      "start": 607.24,
      "end": 612.0400000000001,
      "text": "Now if you have the cash to hire someone, there are a bunch of resources we'll be giving"
    },
    {
      "start": 612.0400000000001,
      "end": 613.84,
      "text": "at the end of distribution."
    },
    {
      "start": 613.84,
      "end": 616.96,
      "text": "Who you can hire, we'll recommend."
    },
    {
      "start": 616.96,
      "end": 621.0,
      "text": "And I guess best thoughts to go about doing it."
    },
    {
      "start": 621.0,
      "end": 622.5600000000001,
      "text": "I lost the word of my head."
    },
    {
      "start": 622.5600000000001,
      "end": 623.88,
      "text": "But, okay, read it."
    },
    {
      "start": 623.88,
      "end": 628.84,
      "text": "So, we didn't go over Reddit case studies because I think Reddit is very niche and but it"
    },
    {
      "start": 628.84,
      "end": 629.84,
      "text": "can work well."
    },
    {
      "start": 629.84,
      "end": 632.96,
      "text": "When we started Quitter, the first thing we're doing was Reddit."
    },
    {
      "start": 632.96,
      "end": 637.28,
      "text": "And so just realize that the Reddit guys is a lot of your accounts will get banned."
    },
    {
      "start": 637.28,
      "end": 640.6,
      "text": "A lot of the times you get kicked out of these subreddits because they're going to realize"
    },
    {
      "start": 640.6,
      "end": 643.32,
      "text": "that you're pushing these apps and they don't want shit pushed."
    },
    {
      "start": 643.32,
      "end": 645.08,
      "text": "There's very strong Reddit communities."
    },
    {
      "start": 645.08,
      "end": 649.76,
      "text": "But the purpose of Reddit is to do storytelling posts where you build this like rock hitting"
    },
    {
      "start": 649.76,
      "end": 651.08,
      "text": "rock bottom."
    },
    {
      "start": 651.08,
      "end": 654.64,
      "text": "The app is the hero and you found it and you make it for your organic so it seems like"
    },
    {
      "start": 654.64,
      "end": 658.2800000000001,
      "text": "someone's really posted about it and you're not like hard pushing and hard selling your"
    },
    {
      "start": 658.2800000000001,
      "end": 660.2800000000001,
      "text": "app."
    },
    {
      "start": 660.2800000000001,
      "end": 663.64,
      "text": "I would say for like a week or two just talking communities as a normal person and you"
    },
    {
      "start": 663.64,
      "end": 664.76,
      "text": "push the app."
    },
    {
      "start": 664.76,
      "end": 669.48,
      "text": "You can also go on some sites and buy Reddit accounts with exists in karma."
    },
    {
      "start": 669.48,
      "end": 673.2800000000001,
      "text": "So generally it was I was struggling with blank until I tried this."
    },
    {
      "start": 673.2800000000001,
      "end": 674.88,
      "text": "That can generally be too pushy."
    },
    {
      "start": 674.88,
      "end": 676.6800000000001,
      "text": "But if you build this into a story, you're good."
    },
    {
      "start": 676.68,
      "end": 677.68,
      "text": "And guess what?"
    },
    {
      "start": 677.68,
      "end": 679.0799999999999,
      "text": "You can use AI to help you out."
    },
    {
      "start": 679.0799999999999,
      "end": 683.0,
      "text": "Don't make this harder than it has to be."
    },
    {
      "start": 683.0,
      "end": 687.4399999999999,
      "text": "And so for example, this is one that we had to go vile for quitter."
    },
    {
      "start": 687.4399999999999,
      "end": 693.64,
      "text": "So not sure when it became controversial to say this maybe it always was but porn is"
    },
    {
      "start": 693.64,
      "end": 696.56,
      "text": "absolutely warped how people see love sex and relationships."
    },
    {
      "start": 696.56,
      "end": 699.2399999999999,
      "text": "Keep in mind this is a sex gender and dating subreddit."
    },
    {
      "start": 699.2399999999999,
      "end": 702.7199999999999,
      "text": "It doesn't matter that it's been around forever."
    },
    {
      "start": 702.7199999999999,
      "end": 705.28,
      "text": "So I have a lot of things we've rightly left behind."
    },
    {
      "start": 705.28,
      "end": 709.0,
      "text": "No one who's built anything meaningful legacy."
    },
    {
      "start": 709.0,
      "end": 711.0,
      "text": "This also looks like it's written by an idiot."
    },
    {
      "start": 711.0,
      "end": 715.36,
      "text": "I think we did that on purpose because I came and fucking read it."
    },
    {
      "start": 715.36,
      "end": 717.4399999999999,
      "text": "But it comes down to me a lot."
    },
    {
      "start": 717.4399999999999,
      "end": 720.4,
      "text": "I say we're from it the more obviously became porn is mental junk food zero."
    },
    {
      "start": 720.4,
      "end": 721.4,
      "text": "And then we edited it."
    },
    {
      "start": 721.4,
      "end": 726.12,
      "text": "And if anyone if it's of any help to someone I personally use quitter, right?"
    },
    {
      "start": 726.12,
      "end": 729.28,
      "text": "So they plug quitter at the end."
    },
    {
      "start": 729.28,
      "end": 730.28,
      "text": "This is about being a Christian."
    },
    {
      "start": 730.28,
      "end": 731.52,
      "text": "It was severe point."
    },
    {
      "start": 731.52,
      "end": 732.52,
      "text": "He edited it."
    },
    {
      "start": 732.52,
      "end": 739.52,
      "text": "We found this app so we posted it at ripped views and then we."
    },
    {
      "start": 739.52,
      "end": 740.76,
      "text": "You know how come any."
    },
    {
      "start": 740.76,
      "end": 744.72,
      "text": "Why a lot of Christian men Alex is going to come and say what's up."
    },
    {
      "start": 744.72,
      "end": 745.92,
      "text": "Mr. Slaser itself."
    },
    {
      "start": 745.92,
      "end": 750.28,
      "text": "We're going over our quitter reddit high level."
    },
    {
      "start": 750.28,
      "end": 752.72,
      "text": "Why a lot of Christian men fail at falling to porn."
    },
    {
      "start": 752.72,
      "end": 757.72,
      "text": "And then we edit it after it rips views and say that quitter is what helps them."
    },
    {
      "start": 757.72,
      "end": 759.64,
      "text": "And so it became super organic."
    },
    {
      "start": 759.64,
      "end": 765.64,
      "text": "A lot of the moderators wouldn't get rid of this and then we'd rip fucking engagement"
    },
    {
      "start": 765.64,
      "end": 770.4,
      "text": "and then we'd edit quitter in there and it would stay."
    },
    {
      "start": 770.4,
      "end": 773.44,
      "text": "Last one we're going over is X right so previously Twitter."
    },
    {
      "start": 773.44,
      "end": 779.52,
      "text": "So X is fun because it can be cheap and really effective if you put a lot of shots up."
    },
    {
      "start": 779.52,
      "end": 782.32,
      "text": "So you really want memes and day of thread."
    },
    {
      "start": 782.32,
      "end": 783.32,
      "text": "Those are the biggest ones."
    },
    {
      "start": 783.32,
      "end": 790.24,
      "text": "So like a meme for example would be right here."
    },
    {
      "start": 790.24,
      "end": 794.32,
      "text": "So one meme is like anti porn quitter contripsing little tas account getting banned for child"
    },
    {
      "start": 794.32,
      "end": 795.32,
      "text": "safety."
    },
    {
      "start": 795.32,
      "end": 796.32,
      "text": "This was July 25th."
    },
    {
      "start": 796.32,
      "end": 799.6400000000001,
      "text": "So like little T was like basically saying hey I'm going to drop only fans and we always"
    },
    {
      "start": 799.6400000000001,
      "end": 804.84,
      "text": "advance to with her on Twitter and be like you shouldn't drop an only fans X Y and Z"
    },
    {
      "start": 804.84,
      "end": 808.84,
      "text": "and then we I'm pretty sure paid this person a post this."
    },
    {
      "start": 808.84,
      "end": 814.52,
      "text": "We did anti corn app right porn quitter seeks to buy only fans shut down like 125k."
    },
    {
      "start": 814.52,
      "end": 816.5600000000001,
      "text": "We said J calls down to Twitter."
    },
    {
      "start": 816.5600000000001,
      "end": 821.5600000000001,
      "text": "We paid all of these accounts generally like couple hundred bucks to post this."
    },
    {
      "start": 821.5600000000001,
      "end": 826.1600000000001,
      "text": "So here's the biggest one everyone saw anti porn app quitter seeks to buy only fans shut"
    },
    {
      "start": 826.1600000000001,
      "end": 827.1600000000001,
      "text": "it down."
    },
    {
      "start": 827.1600000000001,
      "end": 829.1600000000001,
      "text": "It's got 11 million fucking impressions."
    },
    {
      "start": 829.1600000000001,
      "end": 832.84,
      "text": "This guy probably brought in like a hundred grand 200 grand over the course of a week"
    },
    {
      "start": 832.84,
      "end": 835.36,
      "text": "off of this alone and then we put the link here."
    },
    {
      "start": 835.36,
      "end": 837.1600000000001,
      "text": "I got almost a million impressions."
    },
    {
      "start": 837.16,
      "end": 838.8399999999999,
      "text": "Now this one's super viral."
    },
    {
      "start": 838.8399999999999,
      "end": 841.48,
      "text": "People to this day are always like you guys going to buy only fans."
    },
    {
      "start": 841.48,
      "end": 844.48,
      "text": "It's like yeah I have a cool 5 billion laying around and some people think we're real"
    },
    {
      "start": 844.48,
      "end": 848.52,
      "text": "and I'm like you're an idiot."
    },
    {
      "start": 848.52,
      "end": 852.0,
      "text": "But what I would say is dude people know this but we paid this account like a hundred bucks"
    },
    {
      "start": 852.0,
      "end": 853.8399999999999,
      "text": "because he posts like 20 times a day."
    },
    {
      "start": 853.8399999999999,
      "end": 858.8,
      "text": "But he's doing is charging 50 to 100 bucks per Twitter thread or Twitter post and we know"
    },
    {
      "start": 858.8,
      "end": 865.6,
      "text": "that he already has followers and so he is more likely to a viral."
    },
    {
      "start": 865.6,
      "end": 870.44,
      "text": "Another one I would say and show is like this."
    },
    {
      "start": 870.44,
      "end": 873.88,
      "text": "So we paid this masculine page right to do a thread on us."
    },
    {
      "start": 873.88,
      "end": 877.96,
      "text": "And what they did was show that porn is the worst drug for young men and here's why and"
    },
    {
      "start": 877.96,
      "end": 882.44,
      "text": "people tend to read this stuff and it goes through like clips of what it does, how it affects"
    },
    {
      "start": 882.44,
      "end": 885.76,
      "text": "you and then eventually goes like you want to quit porn here's quitter."
    },
    {
      "start": 885.76,
      "end": 889.0400000000001,
      "text": "And so you're only paying a couple hundred bucks for this stuff and you can also apply"
    },
    {
      "start": 889.0400000000001,
      "end": 891.32,
      "text": "the same view guarantee model to it."
    },
    {
      "start": 892.0400000000001,
      "end": 897.8000000000001,
      "text": "So you're putting a lot of shots on net for Twitter X and what this will do is build"
    },
    {
      "start": 897.8000000000001,
      "end": 900.5600000000001,
      "text": "a story and reach and drive conversions."
    },
    {
      "start": 900.5600000000001,
      "end": 903.8000000000001,
      "text": "I did in a day like the more people that have seen your app understand your app and know"
    },
    {
      "start": 903.8000000000001,
      "end": 907.0400000000001,
      "text": "what it is are likely to convert on the next push right."
    },
    {
      "start": 907.0400000000001,
      "end": 909.72,
      "text": "So if you have someone that sees it five or six times I have a download on that seventh"
    },
    {
      "start": 909.72,
      "end": 914.6,
      "text": "eighth ninth time they've seen it like I need to download this or we realize with quitter"
    },
    {
      "start": 914.6,
      "end": 918.7600000000001,
      "text": "people tended men young men specifically tended to download our app at night because they"
    },
    {
      "start": 918.76,
      "end": 922.08,
      "text": "probably just jerked off they post not clear to have to delete this thing and get off"
    },
    {
      "start": 922.08,
      "end": 923.08,
      "text": "this."
    },
    {
      "start": 923.08,
      "end": 925.48,
      "text": "What can you do to help they know quitter."
    },
    {
      "start": 925.48,
      "end": 930.8,
      "text": "So generally speaking right understand that each piece of organic content has its own"
    },
    {
      "start": 930.8,
      "end": 932.72,
      "text": "role in the funnel."
    },
    {
      "start": 932.72,
      "end": 936.72,
      "text": "However, you got to should know that there is a chance that it could be the main role."
    },
    {
      "start": 936.72,
      "end": 940.68,
      "text": "So faceless generally like we use faceless as awareness right and hit volume."
    },
    {
      "start": 940.68,
      "end": 942.3199999999999,
      "text": "Does it drive downloads?"
    },
    {
      "start": 942.3199999999999,
      "end": 947.4,
      "text": "Yes, but you need more shots on net with that you have to post a tumour volume."
    },
    {
      "start": 947.4,
      "end": 951.68,
      "text": "For example, influencers, influencers one post could drive a ton of value."
    },
    {
      "start": 951.68,
      "end": 965.52,
      "text": "Like our faceless video for quitter I think I showed you guys this if I go to quitter."
    },
    {
      "start": 965.52,
      "end": 971.48,
      "text": "So this reel that we posted we post a lot of these right we put a lot of these different"
    },
    {
      "start": 971.48,
      "end": 973.64,
      "text": "sour things for testing around."
    },
    {
      "start": 973.64,
      "end": 979.6800000000001,
      "text": "This one that got 2 million views because it was like 1.2 million views for how much you"
    },
    {
      "start": 979.6800000000001,
      "end": 980.6800000000001,
      "text": "goon."
    },
    {
      "start": 980.6800000000001,
      "end": 984.6,
      "text": "I don't honestly know this converted a lot but guess what people know quitter is people"
    },
    {
      "start": 984.6,
      "end": 987.6,
      "text": "are fucking commenting out the wazoo and liking this thing it's hilarious and they're like"
    },
    {
      "start": 987.6,
      "end": 991.64,
      "text": "what's quitter and then they'll see an influencer post or they'll see an organic post and convert."
    },
    {
      "start": 991.64,
      "end": 996.72,
      "text": "So faceless generally is good for awareness and from there you will drive downloads."
    },
    {
      "start": 996.72,
      "end": 1002.32,
      "text": "UGC I think is fucking amazing especially if you can crack it for your industry because"
    },
    {
      "start": 1002.32,
      "end": 1005.44,
      "text": "it's real people doing it and people trust real people."
    },
    {
      "start": 1005.44,
      "end": 1009.0400000000001,
      "text": "Reddit I think is when you're starting off it's great it's gritty it's story driven you"
    },
    {
      "start": 1009.0400000000001,
      "end": 1012.24,
      "text": "can get your first couple thousand dollars a ten thousand dollars months from it especially"
    },
    {
      "start": 1012.24,
      "end": 1017.32,
      "text": "if you find that it's subreddits X as well it's something that's on the cheaper end but"
    },
    {
      "start": 1017.32,
      "end": 1021.2,
      "text": "you really have to understand the algorithm in your industry and how to invoke an emotion."
    },
    {
      "start": 1021.2,
      "end": 1025.04,
      "text": "If you can pull an emotion out of Reddit and X you will win those games like fuck it actually"
    },
    {
      "start": 1025.04,
      "end": 1028.3999999999999,
      "text": "you can pull an emotion out of faceless you just read it and X you will win right think"
    },
    {
      "start": 1028.3999999999999,
      "end": 1032.08,
      "text": "about what do you want the viewer to feel what's going to stop them from scrolling make them read"
    },
    {
      "start": 1032.08,
      "end": 1034.48,
      "text": "your content and build trust with you."
    },
    {
      "start": 1034.48,
      "end": 1034.6399999999999,
      "text": "So"
    }
  ]
}