{
  "file_name": "051_Lesson_51.faudio-hi-0-Default.mp4",
  "text": " So there are many different channels to run paid ads on paper click ads. Meta, which is one of the most popular, if not the most popular, that was kind of the OG platform was Facebook ads. Now it's under the umbrella of Meta. This lets you run ads on Instagram in Reels, on Instagram Stories, Facebook as you're scrolling through the timeline, banner ads on the website, the whole nine yards. It's very inclusive. Their algorithm is by far one of the best. It's been around the longest. It's really really solid platform. Everything was pretty much based on this. Then we go to TikTok ads, which it's a little more simplistic. It's just ads directly in TikTok. There's a lot you could do here. You can do you can just post a video and it comes up as an ad. You can do a partnership ad. You can do this on Instagram too, by the way. It's called a Spark Ad where you have someone post from their account and then you put ads spend behind it. This is how you can branch influencer marketing and paper click marketing together. Apple search ads, which is not the first thing people think of when they think of search ads, or sorry, when they think of paper click ads in general. Apple search ads is actually really, really overlooked. There's a lot of potential there for new apps. It's basically just bidding on keywords. The reason it's so good is because it is the only platform where the attribution is one to one. Apple has all these privacy rules that really stop you from knowing exactly where your users came from knowing how profitable each channel was. Apple search ads is the one exception. In that platform, you can know and therefore it's a great one to run on because there's very little if any uncertainty. If it's profitable. It's also easy to settle and we'll get into that. Google ads, Google ads, there are a bunch of different ways to run Google ads. There are search ads, search term ads. So if you Google something, you could place a bid where you're like the highlighted first result, the sponsored first result. But what's more popular as of recently with apps is Google UAC ads and Google UAC ads are going to look this up. It is, they're basically universal app campaigns and they let you run, basically ads everywhere for your app. You can run, like you set it up once and then it will show the ads across all Google platforms. So it will show ads on the Google Play Store, it will show ads on YouTube, it will show ads on the Google Display Network which is basically ads running within other apps. Google search. So Google UAC is a big thing and I know many people that have apps doing millions of dollars a month and Google UAC is their biggest spender, biggest contributor to that. App love and app love is a platform that personally I never used but there's been a lot of buzz around it recently. There's some rumors like you have to be spending at least 30K a day in order to get on the platform. It's basically just running ads within other apps, running video ads within other apps. And I've heard good things but I've also heard bad things. I used very mixed. I wouldn't recommend really spending too much time thinking about this by the point that you would need to run app love and ads. Your app will already be very successful and you can hire someone to do it. And by the way, I do want you guys to take into account something is that I, with Cali, so we initially started out with influencer marketing exclusively. And then we decided hey, okay, we know there's big opportunity with paid ads as well. So we're going to keep doing what we're best at influencers. And then let's use an agency on the side to run our ads. And so we did that. It worked out decently well. We were spending a few thousand dollars a day profitably. But then with pretty much anything, I'm very against agencies long term. They're good for short term sometimes, but not long term. We decided we want to really start scaling this. And agency is they move too slow for our pace. Number one rule of business speed. And so we decided to take it in house. I started learning. I started watching a lot of podcasts talking on my friends who are great with paid ads. And where was that going with this? Oh, well, it we started running again. And there are a lot of ups and downs with paid ads. Some of the biggest problems come from the smallest things generally once you're set up. You're good to go and scale the only issues come from attribution issues, which we'll get into. Which is all about Apple's privacy rules. But the reason why I wanted to say that is because I started. I did not start the face. I did not start the ad platform. I did not set up initially running paper click ads for Cali. We had an engine to do it. Then I took over. I started it from scratch. However, we only scaled it so far before bringing in someone else to continue scaling in with us. And that's something you should honestly keep in mind for every section is you only need to know up to a certain point where you're making enough money or you could then hire someone to replace you. And that's basically what we did. We just waited until we were making enough where it made sense to bring someone on and the ads were going to pay for their salary. And so I'm going to teach you enough where you could get to that point. However, I'm definitely not a master at this. I'm definitely not the best in the world. I know how to get it going. I know how to hire for it higher. Some of the best in the world. Once you have it going. But keep in mind, this is going to be pretty high level. We're going to go through all the principal strategies. And we'll also talk about how you should hire someone at what point should hire someone to. So the last one here is Snapchat ads. And Snapchat ads, we've run them once. They weren't profitable for us. We're going to try them again. I think may have jumped the gun. Haven't done enough testing. But it's Snapchat stories or Snapchat spotlight as you're scrolling through. You can see ads. For some people, it's very profitable. Very profitable. It's a channel that most people don't actually look into. So your CPMs, I don't know why, but that includes CPM, your cost per thousand views is relatively inexpensive.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.88,
      "text": "So there are many different channels to run paid ads on paper click ads."
    },
    {
      "start": 5.88,
      "end": 12.64,
      "text": "Meta, which is one of the most popular, if not the most popular, that was kind of the"
    },
    {
      "start": 12.64,
      "end": 15.08,
      "text": "OG platform was Facebook ads."
    },
    {
      "start": 15.08,
      "end": 17.8,
      "text": "Now it's under the umbrella of Meta."
    },
    {
      "start": 17.8,
      "end": 24.04,
      "text": "This lets you run ads on Instagram in Reels, on Instagram Stories, Facebook as you're"
    },
    {
      "start": 24.04,
      "end": 29.560000000000002,
      "text": "scrolling through the timeline, banner ads on the website, the whole nine yards."
    },
    {
      "start": 30.56,
      "end": 32.199999999999996,
      "text": "It's very inclusive."
    },
    {
      "start": 32.199999999999996,
      "end": 34.519999999999996,
      "text": "Their algorithm is by far one of the best."
    },
    {
      "start": 34.519999999999996,
      "end": 36.48,
      "text": "It's been around the longest."
    },
    {
      "start": 36.48,
      "end": 39.839999999999996,
      "text": "It's really really solid platform."
    },
    {
      "start": 39.839999999999996,
      "end": 42.76,
      "text": "Everything was pretty much based on this."
    },
    {
      "start": 42.76,
      "end": 46.519999999999996,
      "text": "Then we go to TikTok ads, which it's a little more simplistic."
    },
    {
      "start": 46.519999999999996,
      "end": 48.64,
      "text": "It's just ads directly in TikTok."
    },
    {
      "start": 48.64,
      "end": 50.2,
      "text": "There's a lot you could do here."
    },
    {
      "start": 50.2,
      "end": 53.879999999999995,
      "text": "You can do you can just post a video and it comes up as an ad."
    },
    {
      "start": 53.879999999999995,
      "end": 54.96,
      "text": "You can do a partnership ad."
    },
    {
      "start": 54.96,
      "end": 56.72,
      "text": "You can do this on Instagram too, by the way."
    },
    {
      "start": 56.72,
      "end": 61.0,
      "text": "It's called a Spark Ad where you have someone post from their account and then you put ads"
    },
    {
      "start": 61.0,
      "end": 62.28,
      "text": "spend behind it."
    },
    {
      "start": 62.28,
      "end": 67.16,
      "text": "This is how you can branch influencer marketing and paper click marketing together."
    },
    {
      "start": 67.16,
      "end": 73.16,
      "text": "Apple search ads, which is not the first thing people think of when they think of search ads,"
    },
    {
      "start": 73.16,
      "end": 76.2,
      "text": "or sorry, when they think of paper click ads in general."
    },
    {
      "start": 76.2,
      "end": 80.8,
      "text": "Apple search ads is actually really, really overlooked."
    },
    {
      "start": 80.8,
      "end": 84.08,
      "text": "There's a lot of potential there for new apps."
    },
    {
      "start": 84.08,
      "end": 86.36,
      "text": "It's basically just bidding on keywords."
    },
    {
      "start": 86.36,
      "end": 91.44,
      "text": "The reason it's so good is because it is the only platform where the attribution is"
    },
    {
      "start": 91.44,
      "end": 92.92,
      "text": "one to one."
    },
    {
      "start": 92.92,
      "end": 100.64,
      "text": "Apple has all these privacy rules that really stop you from knowing exactly where your"
    },
    {
      "start": 100.64,
      "end": 103.96000000000001,
      "text": "users came from knowing how profitable each channel was."
    },
    {
      "start": 103.96000000000001,
      "end": 106.72,
      "text": "Apple search ads is the one exception."
    },
    {
      "start": 106.72,
      "end": 113.6,
      "text": "In that platform, you can know and therefore it's a great one to run on because there's"
    },
    {
      "start": 114.32,
      "end": 116.52,
      "text": "very little if any uncertainty."
    },
    {
      "start": 116.52,
      "end": 117.91999999999999,
      "text": "If it's profitable."
    },
    {
      "start": 117.91999999999999,
      "end": 122.91999999999999,
      "text": "It's also easy to settle and we'll get into that."
    },
    {
      "start": 122.91999999999999,
      "end": 126.96,
      "text": "Google ads, Google ads, there are a bunch of different ways to run Google ads."
    },
    {
      "start": 126.96,
      "end": 129.32,
      "text": "There are search ads, search term ads."
    },
    {
      "start": 129.32,
      "end": 134.56,
      "text": "So if you Google something, you could place a bid where you're like the highlighted first"
    },
    {
      "start": 134.56,
      "end": 136.95999999999998,
      "text": "result, the sponsored first result."
    },
    {
      "start": 136.96,
      "end": 143.96,
      "text": "But what's more popular as of recently with apps is Google UAC ads and Google UAC ads"
    },
    {
      "start": 146.28,
      "end": 149.04000000000002,
      "text": "are going to look this up."
    },
    {
      "start": 149.04000000000002,
      "end": 156.04000000000002,
      "text": "It is, they're basically universal app campaigns and they let you run, basically ads everywhere"
    },
    {
      "start": 158.36,
      "end": 159.36,
      "text": "for your app."
    },
    {
      "start": 159.36,
      "end": 164.56,
      "text": "You can run, like you set it up once and then it will show the ads across all Google platforms."
    },
    {
      "start": 164.56,
      "end": 168.08,
      "text": "So it will show ads on the Google Play Store, it will show ads on YouTube, it will show"
    },
    {
      "start": 168.08,
      "end": 174.16,
      "text": "ads on the Google Display Network which is basically ads running within other apps."
    },
    {
      "start": 174.16,
      "end": 175.4,
      "text": "Google search."
    },
    {
      "start": 175.4,
      "end": 181.0,
      "text": "So Google UAC is a big thing and I know many people that have apps doing millions of dollars"
    },
    {
      "start": 181.0,
      "end": 187.64000000000001,
      "text": "a month and Google UAC is their biggest spender, biggest contributor to that."
    },
    {
      "start": 187.64000000000001,
      "end": 191.72,
      "text": "App love and app love is a platform that personally I never used but there's been a lot of"
    },
    {
      "start": 191.72,
      "end": 193.24,
      "text": "buzz around it recently."
    },
    {
      "start": 193.24,
      "end": 197.74,
      "text": "There's some rumors like you have to be spending at least 30K a day in order to get on the"
    },
    {
      "start": 197.74,
      "end": 198.74,
      "text": "platform."
    },
    {
      "start": 198.74,
      "end": 205.36,
      "text": "It's basically just running ads within other apps, running video ads within other apps."
    },
    {
      "start": 205.36,
      "end": 208.44,
      "text": "And I've heard good things but I've also heard bad things."
    },
    {
      "start": 208.44,
      "end": 210.12,
      "text": "I used very mixed."
    },
    {
      "start": 210.12,
      "end": 214.4,
      "text": "I wouldn't recommend really spending too much time thinking about this by the point that"
    },
    {
      "start": 214.4,
      "end": 216.44,
      "text": "you would need to run app love and ads."
    },
    {
      "start": 216.44,
      "end": 219.52,
      "text": "Your app will already be very successful and you can hire someone to do it."
    },
    {
      "start": 219.52,
      "end": 228.88,
      "text": "And by the way, I do want you guys to take into account something is that I, with Cali,"
    },
    {
      "start": 228.88,
      "end": 233.36,
      "text": "so we initially started out with influencer marketing exclusively."
    },
    {
      "start": 233.36,
      "end": 238.76000000000002,
      "text": "And then we decided hey, okay, we know there's big opportunity with paid ads as well."
    },
    {
      "start": 238.76000000000002,
      "end": 242.36,
      "text": "So we're going to keep doing what we're best at influencers."
    },
    {
      "start": 242.36,
      "end": 249.20000000000002,
      "text": "And then let's use an agency on the side to run our ads."
    },
    {
      "start": 249.2,
      "end": 253.07999999999998,
      "text": "And so we did that."
    },
    {
      "start": 253.07999999999998,
      "end": 254.67999999999998,
      "text": "It worked out decently well."
    },
    {
      "start": 254.67999999999998,
      "end": 260.84,
      "text": "We were spending a few thousand dollars a day profitably."
    },
    {
      "start": 260.84,
      "end": 264.52,
      "text": "But then with pretty much anything, I'm very against agencies long term."
    },
    {
      "start": 264.52,
      "end": 268.03999999999996,
      "text": "They're good for short term sometimes, but not long term."
    },
    {
      "start": 268.03999999999996,
      "end": 270.15999999999997,
      "text": "We decided we want to really start scaling this."
    },
    {
      "start": 270.15999999999997,
      "end": 272.59999999999997,
      "text": "And agency is they move too slow for our pace."
    },
    {
      "start": 272.59999999999997,
      "end": 275.59999999999997,
      "text": "Number one rule of business speed."
    },
    {
      "start": 275.59999999999997,
      "end": 278.12,
      "text": "And so we decided to take it in house."
    },
    {
      "start": 278.12,
      "end": 279.12,
      "text": "I started learning."
    },
    {
      "start": 279.12,
      "end": 285.08,
      "text": "I started watching a lot of podcasts talking on my friends who are great with paid ads."
    },
    {
      "start": 285.08,
      "end": 290.2,
      "text": "And where was that going with this?"
    },
    {
      "start": 290.2,
      "end": 295.08,
      "text": "Oh, well, it we started running again."
    },
    {
      "start": 295.08,
      "end": 298.96,
      "text": "And there are a lot of ups and downs with paid ads."
    },
    {
      "start": 298.96,
      "end": 305.24,
      "text": "Some of the biggest problems come from the smallest things generally once you're set up."
    },
    {
      "start": 305.24,
      "end": 311.64,
      "text": "You're good to go and scale the only issues come from attribution issues, which we'll get"
    },
    {
      "start": 311.64,
      "end": 314.12,
      "text": "into."
    },
    {
      "start": 314.12,
      "end": 316.6,
      "text": "Which is all about Apple's privacy rules."
    },
    {
      "start": 316.6,
      "end": 322.32,
      "text": "But the reason why I wanted to say that is because I started."
    },
    {
      "start": 322.32,
      "end": 325.08,
      "text": "I did not start the face."
    },
    {
      "start": 325.08,
      "end": 330.0,
      "text": "I did not start the ad platform."
    },
    {
      "start": 330.0,
      "end": 335.28,
      "text": "I did not set up initially running paper click ads for Cali."
    },
    {
      "start": 335.28,
      "end": 336.48,
      "text": "We had an engine to do it."
    },
    {
      "start": 336.48,
      "end": 337.48,
      "text": "Then I took over."
    },
    {
      "start": 337.48,
      "end": 339.32,
      "text": "I started it from scratch."
    },
    {
      "start": 339.32,
      "end": 345.72,
      "text": "However, we only scaled it so far before bringing in someone else to continue scaling"
    },
    {
      "start": 345.72,
      "end": 346.72,
      "text": "in with us."
    },
    {
      "start": 346.72,
      "end": 350.84,
      "text": "And that's something you should honestly keep in mind for every section is you only need"
    },
    {
      "start": 350.84,
      "end": 355.92,
      "text": "to know up to a certain point where you're making enough money or you could then hire someone"
    },
    {
      "start": 355.92,
      "end": 357.24,
      "text": "to replace you."
    },
    {
      "start": 357.24,
      "end": 358.24,
      "text": "And that's basically what we did."
    },
    {
      "start": 358.24,
      "end": 361.48,
      "text": "We just waited until we were making enough where it made sense to bring someone on and"
    },
    {
      "start": 361.48,
      "end": 364.04,
      "text": "the ads were going to pay for their salary."
    },
    {
      "start": 364.04,
      "end": 367.16,
      "text": "And so I'm going to teach you enough where you could get to that point."
    },
    {
      "start": 367.16,
      "end": 370.2,
      "text": "However, I'm definitely not a master at this."
    },
    {
      "start": 370.2,
      "end": 372.48,
      "text": "I'm definitely not the best in the world."
    },
    {
      "start": 372.48,
      "end": 374.88,
      "text": "I know how to get it going."
    },
    {
      "start": 374.88,
      "end": 377.0,
      "text": "I know how to hire for it higher."
    },
    {
      "start": 377.0,
      "end": 378.68,
      "text": "Some of the best in the world."
    },
    {
      "start": 378.68,
      "end": 380.96000000000004,
      "text": "Once you have it going."
    },
    {
      "start": 380.96000000000004,
      "end": 383.76,
      "text": "But keep in mind, this is going to be pretty high level."
    },
    {
      "start": 384.24,
      "end": 387.24,
      "text": "We're going to go through all the principal strategies."
    },
    {
      "start": 387.24,
      "end": 393.4,
      "text": "And we'll also talk about how you should hire someone at what point should hire someone"
    },
    {
      "start": 393.4,
      "end": 394.4,
      "text": "to."
    },
    {
      "start": 394.4,
      "end": 396.48,
      "text": "So the last one here is Snapchat ads."
    },
    {
      "start": 396.48,
      "end": 399.28,
      "text": "And Snapchat ads, we've run them once."
    },
    {
      "start": 399.28,
      "end": 401.03999999999996,
      "text": "They weren't profitable for us."
    },
    {
      "start": 401.03999999999996,
      "end": 402.03999999999996,
      "text": "We're going to try them again."
    },
    {
      "start": 402.03999999999996,
      "end": 404.03999999999996,
      "text": "I think may have jumped the gun."
    },
    {
      "start": 404.03999999999996,
      "end": 406.0,
      "text": "Haven't done enough testing."
    },
    {
      "start": 406.0,
      "end": 410.8,
      "text": "But it's Snapchat stories or Snapchat spotlight as you're scrolling through."
    },
    {
      "start": 410.8,
      "end": 412.36,
      "text": "You can see ads."
    },
    {
      "start": 412.36,
      "end": 414.36,
      "text": "For some people, it's very profitable."
    },
    {
      "start": 414.36,
      "end": 416.36,
      "text": "Very profitable."
    },
    {
      "start": 416.36,
      "end": 419.04,
      "text": "It's a channel that most people don't actually look into."
    },
    {
      "start": 419.04,
      "end": 424.40000000000003,
      "text": "So your CPMs, I don't know why, but that includes CPM, your cost per thousand views is relatively"
    },
    {
      "start": 424.40000000000003,
      "end": 425.08000000000004,
      "text": "inexpensive."
    }
  ]
}