{
  "file_name": "059_Lesson_59.faudio-hi-0-Default.mp4",
  "text": " Hey everyone welcome back to the distribution module my name is Alex Slater and I'll be interjecting my input on how to be successful at Reddit and X marketing. We'll start with X just for now and like I love X because it's how we started and because there are a lot of theme pages that post a lot of times a day so like you can get very low CPMs and I think at the start we used to pay like 50 to 100 bucks per tweet and per thread. This is one of the first ones we've ever done. They said 237,000 views. We probably paid maybe like $100 maximum. I remember that being our maximum at the time and this is August 22nd so almost a year ago today will be first launched quitter. Now this is very intentional. Pawn is the worst drug for young men. Very clear hook, very scary outcome. The worst drug and the reason this does so well is not only is it not widely known and accepted yet that pawn is like damaging for people but also because it's very normalized because it's like people consume a lot. So when they hear all right I'm consuming this thing every day or every week whatever and now it's apparently being compared as the worst drug ever now you have my attention now I want to read the thread. So then it carries on it's kind of like a funnel it's like a week in a brain but and then you keep going down more more stuff more stuff it lowers yourself a steam and then in your head you're learning about how damaging pawn is and they're boom quitter push. Do you want to quit pawn but you keep failing? Why? Because you don't have the right tools that's about to change. I found an app that can help you quit pawn meet quitter and I think maybe this premise specifically would have made us $500 to $1000 but like in our first week of launch this is really good and that's a 10X ROI so I don't hate it and I'm going to show you some far better tweets very very shortly. What I would change about this though is like it's a very clear push and you can see like the drop off from light so it started at 500 now it's only at 16 but the views are what matters and you know even though the push is super super hard I think mine share is important and the more people that are aware that quitter is for quitting pawn there is apps and there are solutions out there for this kind of stuff the word will spread and you'll eventually get interaction. So yeah I love tweets and there are like way more examples of this so the psych wizard psych wizard is another account we partnered with this had 750,000 views I think for this spread I think we paid $300, $400 because I structured it like a bonus I'll be like all right bro I'll give you $100 base and then if you get this amount of views I'll give you an extra 200, 300, 400 and I just do remember getting an argument with this guy because he tried to charge us like $400, $500 and to meet the time that was like way too much money and Apple Payouts weren't hitting yet so like so yeah but I remember this doing very well for us I think this spread specifically made like two to two and a half thousand dollars and again look at the day a year ago today so one of them are most successful threads this at 2k likes and look instead of it saying porn is the worst drug for young men at the top it's also in the image and what I've noticed about the x algorithm is like images do the best like text is very easy to scroll past but images capture attention and they induce the most dopamine and that's how you can you know convert and have more viral tweets more often so yeah same kind of format porn will defeat your inner drive in self confidence but then as you could see we skip straight to the push straight to the push instead of it being like multiple threads down it's like hit straight away so this entire thread is like a marketing like marketing material there's nothing else and this kind of serves as like the prerequisite like okay pour with the feet self confidence oh make it weak you'll get sidetracked you will it will decrease your will power and people are like sitting here reading it mean like no I don't want this I want to be the strongest man I can be I want to be the richest I want to be the best looking and it's like okay if port like if if no one okay if the reader has not achieved these things or they feel weak or they feel sidetracked and they consume porn and we're telling you is the worst drug for young men that might be like a connection that people make and they're like okay maybe this is damaging me maybe this is holding back and when they see the quitter ad they're like okay I'll just give it a try so they click on the link and then they go to the app store and they're like oh 20,000 five star reviews and it looks fucking amazing I'm just gonna pay for it oh so I'm just gonna download it and then they end up paying and then everything we make from the tweet we can just reinvest into more and more threads and keep scaling so that's one version of the tweets very very simple format these kind of deep fried tweets go viral maybe like once every two three days so you won't be able to put out mascara that pissing people off well you could spread awareness doing that but like if you're looking for the intense ROI I would space them out maybe two or three maybe one week apart and yeah like the solid strategy really helped in the beginning you can totally rip this forward ever news and it maybe you're you had a calorie tracking app and it's like obesity is reducing birth rates this is why you need to track your calories whatever okay so now now onto some experimental tweets I saw a lot of news pages post like two pictures slideshows where it'd be like one company and then another company and then like a headline kind of like a new like a news headline but on Twitter obviously so I came up with this idea where maybe we could do the same for quitter and announce news because Twitter is kind of like where everyone gets like instant news and I would I would just make it a joke or a meme and it feels super serious because it's on Twitter but it's not so I was like okay what could be the most controversial and get people hyped up and get people being like holy shit this is sick like like for example I give you like a real quick example imagine it's like breaking news the US has shot five bombs towards Russia and there's USA flagging and it's Kim's jump and then it's Putin on the right people would blow that shit up especially if it came from like a respected news source that would go superviral so I decided to pick one of these theme pages that like post a bunch of memes all day so for example this guy had 135k followers but you can see he gets solid view views and likes like 132k likes and then obviously a bunch of them flock a bunch of them flock and then he has 1k likes and then 168k likes so yeah so I was like okay I'm gonna throw some shots at the dartboard and hopefully it goes well and I was like okay quitter buys only fans and shuts it down that was my vision quitter buys only fans and shuts it down and you know the first couple times I didn't go well as you can see this only got 1.6k likes and then we tried another account and it was like 1k likes and I was like oh this is solid but it's not like super viral and I was I just believed in myself I was like maybe we just have a few more attempts for a few more hundred dollar bills these guys and see what happens and then we launched this oh shit then we launched this I paid a hundred dollars I paid a hundred dollars for this for this tweet guess how much this made me probably close to a hundred thousand dollars from one tweet one tweet this got 11.4 million views 143,000 likes and an insane amount of traction in the comments so people like holy shit like no way this is happening and then look at the link 848,000 views yeah there's made us a lot of money and if it wasn't for my belief and if it wasn't for my understanding of the algorithm and to keep pushing and like obsessing over what's going viral and trying like frame that towards quitter and marketing this wouldn't have happened and you know what's really cool about this as well after I went viral on Twitter I was like okay they've probably go viral on Instagram and I just did the exact same format put it on Instagram that ripped as well another 200,000 likes 300,000 likes and probably a hundred million views total all platforms so it's very successful and you know I think a lot of people go into this app game and they think oh yeah short form let's pay for creators like push the app like 10 seconds into the video but there are so many other strategies that just people just overlook maybe because it isn't talked about enough but don't underestimate Twitter and I'm about to get to read it next but just don't underestimate these platforms and yeah peace out boys that's my segment",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 4.5600000000000005,
      "text": "Hey everyone welcome back to the distribution module my name is Alex Slater and I'll be"
    },
    {
      "start": 4.5600000000000005,
      "end": 9.84,
      "text": "interjecting my input on how to be successful at Reddit and X marketing. We'll start with"
    },
    {
      "start": 9.84,
      "end": 16.32,
      "text": "X just for now and like I love X because it's how we started and because there are a lot"
    },
    {
      "start": 16.32,
      "end": 22.88,
      "text": "of theme pages that post a lot of times a day so like you can get very low CPMs and I think"
    },
    {
      "start": 22.88,
      "end": 29.16,
      "text": "at the start we used to pay like 50 to 100 bucks per tweet and per thread. This is one of"
    },
    {
      "start": 29.16,
      "end": 35.64,
      "text": "the first ones we've ever done. They said 237,000 views. We probably paid maybe like $100"
    },
    {
      "start": 35.64,
      "end": 40.84,
      "text": "maximum. I remember that being our maximum at the time and this is August 22nd so almost a"
    },
    {
      "start": 40.84,
      "end": 45.879999999999995,
      "text": "year ago today will be first launched quitter. Now this is very intentional. Pawn is the worst"
    },
    {
      "start": 45.879999999999995,
      "end": 52.44,
      "text": "drug for young men. Very clear hook, very scary outcome. The worst drug and the reason this"
    },
    {
      "start": 52.44,
      "end": 59.48,
      "text": "does so well is not only is it not widely known and accepted yet that pawn is like damaging"
    },
    {
      "start": 59.48,
      "end": 64.44,
      "text": "for people but also because it's very normalized because it's like people consume a lot. So when"
    },
    {
      "start": 64.44,
      "end": 69.72,
      "text": "they hear all right I'm consuming this thing every day or every week whatever and now it's"
    },
    {
      "start": 69.72,
      "end": 75.16,
      "text": "apparently being compared as the worst drug ever now you have my attention now I want to read the"
    },
    {
      "start": 75.16,
      "end": 80.6,
      "text": "thread. So then it carries on it's kind of like a funnel it's like a week in a brain but"
    },
    {
      "start": 81.32,
      "end": 86.67999999999999,
      "text": "and then you keep going down more more stuff more stuff it lowers yourself a steam and then in"
    },
    {
      "start": 86.67999999999999,
      "end": 92.91999999999999,
      "text": "your head you're learning about how damaging pawn is and they're boom quitter push. Do you want to"
    },
    {
      "start": 92.91999999999999,
      "end": 97.96,
      "text": "quit pawn but you keep failing? Why? Because you don't have the right tools that's about to change."
    },
    {
      "start": 97.96,
      "end": 105.47999999999999,
      "text": "I found an app that can help you quit pawn meet quitter and I think maybe this premise specifically"
    },
    {
      "start": 105.48,
      "end": 111.64,
      "text": "would have made us $500 to $1000 but like in our first week of launch this is really good and that's"
    },
    {
      "start": 111.64,
      "end": 119.0,
      "text": "a 10X ROI so I don't hate it and I'm going to show you some far better tweets very very shortly."
    },
    {
      "start": 119.88000000000001,
      "end": 124.36,
      "text": "What I would change about this though is like it's a very clear push and you can see like the"
    },
    {
      "start": 124.36,
      "end": 131.56,
      "text": "drop off from light so it started at 500 now it's only at 16 but the views are what matters and"
    },
    {
      "start": 132.52,
      "end": 138.68,
      "text": "you know even though the push is super super hard I think mine share is important and the more"
    },
    {
      "start": 138.68,
      "end": 144.04,
      "text": "people that are aware that quitter is for quitting pawn there is apps and there are solutions out there"
    },
    {
      "start": 144.04,
      "end": 149.16,
      "text": "for this kind of stuff the word will spread and you'll eventually get interaction. So yeah I love"
    },
    {
      "start": 149.16,
      "end": 154.6,
      "text": "tweets and there are like way more examples of this so the psych wizard psych wizard is another"
    },
    {
      "start": 154.6,
      "end": 161.16,
      "text": "account we partnered with this had 750,000 views I think for this spread I think we paid"
    },
    {
      "start": 162.04,
      "end": 169.56,
      "text": "$300, $400 because I structured it like a bonus I'll be like all right bro I'll give you $100"
    },
    {
      "start": 169.56,
      "end": 174.2,
      "text": "base and then if you get this amount of views I'll give you an extra 200, 300, 400 and I just"
    },
    {
      "start": 174.2,
      "end": 179.8,
      "text": "do remember getting an argument with this guy because he tried to charge us like $400, $500 and"
    },
    {
      "start": 179.8,
      "end": 184.92000000000002,
      "text": "to meet the time that was like way too much money and Apple Payouts weren't hitting yet so like"
    },
    {
      "start": 185.96,
      "end": 190.28,
      "text": "so yeah but I remember this doing very well for us I think this spread specifically made like"
    },
    {
      "start": 190.28,
      "end": 196.76,
      "text": "two to two and a half thousand dollars and again look at the day a year ago today so one of them"
    },
    {
      "start": 196.76,
      "end": 203.0,
      "text": "are most successful threads this at 2k likes and look instead of it saying porn is the worst"
    },
    {
      "start": 203.0,
      "end": 208.76,
      "text": "drug for young men at the top it's also in the image and what I've noticed about the x algorithm is"
    },
    {
      "start": 208.76,
      "end": 215.96,
      "text": "like images do the best like text is very easy to scroll past but images capture attention and"
    },
    {
      "start": 215.96,
      "end": 221.24,
      "text": "they induce the most dopamine and that's how you can you know convert and have more viral tweets"
    },
    {
      "start": 221.24,
      "end": 227.72,
      "text": "more often so yeah same kind of format porn will defeat your inner drive in self confidence but then"
    },
    {
      "start": 227.72,
      "end": 233.88,
      "text": "as you could see we skip straight to the push straight to the push instead of it being like multiple"
    },
    {
      "start": 233.88,
      "end": 241.16,
      "text": "threads down it's like hit straight away so this entire thread is like a marketing like marketing material"
    },
    {
      "start": 242.12,
      "end": 248.04,
      "text": "there's nothing else and this kind of serves as like the prerequisite like okay pour with the"
    },
    {
      "start": 248.04,
      "end": 252.6,
      "text": "feet self confidence oh make it weak you'll get sidetracked you will it will decrease your will"
    },
    {
      "start": 252.6,
      "end": 257.08,
      "text": "power and people are like sitting here reading it mean like no I don't want this I want to be the"
    },
    {
      "start": 257.08,
      "end": 261.48,
      "text": "strongest man I can be I want to be the richest I want to be the best looking and it's like okay if"
    },
    {
      "start": 261.48,
      "end": 266.6,
      "text": "port like if if no one okay if the reader has not achieved these things or they feel weak or they"
    },
    {
      "start": 266.6,
      "end": 271.40000000000003,
      "text": "feel sidetracked and they consume porn and we're telling you is the worst drug for young men"
    },
    {
      "start": 272.28000000000003,
      "end": 276.84000000000003,
      "text": "that might be like a connection that people make and they're like okay maybe this is damaging me"
    },
    {
      "start": 276.84000000000003,
      "end": 281.8,
      "text": "maybe this is holding back and when they see the quitter ad they're like okay I'll just give it a try"
    },
    {
      "start": 281.8,
      "end": 288.84000000000003,
      "text": "so they click on the link and then they go to the app store and they're like oh 20,000 five star"
    },
    {
      "start": 288.84000000000003,
      "end": 294.28000000000003,
      "text": "reviews and it looks fucking amazing I'm just gonna pay for it oh so I'm just gonna download it"
    },
    {
      "start": 294.28,
      "end": 297.96,
      "text": "and then they end up paying and then everything we make from the tweet we can just reinvest into"
    },
    {
      "start": 297.96,
      "end": 306.76,
      "text": "more and more threads and keep scaling so that's one version of the tweets very very simple format"
    },
    {
      "start": 308.44,
      "end": 314.2,
      "text": "these kind of deep fried tweets go viral maybe like once every two three days so you won't be"
    },
    {
      "start": 314.2,
      "end": 318.91999999999996,
      "text": "able to put out mascara that pissing people off well you could spread awareness doing that but like"
    },
    {
      "start": 318.91999999999996,
      "end": 323.55999999999995,
      "text": "if you're looking for the intense ROI I would space them out maybe two or three maybe one"
    },
    {
      "start": 323.56,
      "end": 331.16,
      "text": "week apart and yeah like the solid strategy really helped in the beginning you can totally rip this"
    },
    {
      "start": 331.16,
      "end": 337.48,
      "text": "forward ever news and it maybe you're you had a calorie tracking app and it's like obesity is"
    },
    {
      "start": 337.48,
      "end": 344.68,
      "text": "reducing birth rates this is why you need to track your calories whatever"
    },
    {
      "start": 344.84000000000003,
      "end": 358.52,
      "text": "okay so now now onto some experimental tweets I saw a lot of news pages post like two pictures"
    },
    {
      "start": 358.52,
      "end": 364.36,
      "text": "slideshows where it'd be like one company and then another company and then like a headline"
    },
    {
      "start": 364.92,
      "end": 370.6,
      "text": "kind of like a new like a news headline but on Twitter obviously so I came up with this idea"
    },
    {
      "start": 371.24,
      "end": 376.04,
      "text": "where maybe we could do the same for quitter and announce news because Twitter is kind of like"
    },
    {
      "start": 376.04,
      "end": 382.76000000000005,
      "text": "where everyone gets like instant news and I would I would just make it a joke or a meme and it feels"
    },
    {
      "start": 382.76000000000005,
      "end": 386.92,
      "text": "super serious because it's on Twitter but it's not so I was like okay what could be the most"
    },
    {
      "start": 386.92,
      "end": 392.76000000000005,
      "text": "controversial and get people hyped up and get people being like holy shit this is sick like"
    },
    {
      "start": 393.88,
      "end": 397.32000000000005,
      "text": "like for example I give you like a real quick example imagine it's like"
    },
    {
      "start": 397.48,
      "end": 405.48,
      "text": "breaking news the US has shot five bombs towards Russia and there's USA flagging and it's Kim's"
    },
    {
      "start": 405.48,
      "end": 410.28,
      "text": "jump and then it's Putin on the right people would blow that shit up especially if it came from"
    },
    {
      "start": 410.28,
      "end": 416.92,
      "text": "like a respected news source that would go superviral so I decided to pick one of these theme"
    },
    {
      "start": 417.48,
      "end": 423.56,
      "text": "pages that like post a bunch of memes all day so for example this guy had 135k followers"
    },
    {
      "start": 423.56,
      "end": 430.2,
      "text": "but you can see he gets solid view views and likes like 132k likes and then obviously a bunch of"
    },
    {
      "start": 430.2,
      "end": 437.0,
      "text": "them flock a bunch of them flock and then he has 1k likes and then 168k likes so yeah"
    },
    {
      "start": 438.68,
      "end": 443.8,
      "text": "so I was like okay I'm gonna throw some shots at the dartboard and hopefully it goes well and I was"
    },
    {
      "start": 443.8,
      "end": 452.12,
      "text": "like okay quitter buys only fans and shuts it down that was my vision quitter buys only fans and"
    },
    {
      "start": 452.12,
      "end": 458.76,
      "text": "shuts it down and you know the first couple times I didn't go well as you can see this only got"
    },
    {
      "start": 458.76,
      "end": 465.96,
      "text": "1.6k likes and then we tried another account and it was like 1k likes and I was like oh this is solid"
    },
    {
      "start": 465.96,
      "end": 471.56,
      "text": "but it's not like super viral and I was I just believed in myself I was like maybe we just have"
    },
    {
      "start": 471.56,
      "end": 477.16,
      "text": "a few more attempts for a few more hundred dollar bills these guys and see what happens and then we"
    },
    {
      "start": 477.24,
      "end": 486.44,
      "text": "launched this oh shit then we launched this I paid a hundred dollars I paid a hundred dollars for"
    },
    {
      "start": 486.44,
      "end": 489.48,
      "text": "this for this tweet guess how much this made me"
    },
    {
      "start": 494.04,
      "end": 503.16,
      "text": "probably close to a hundred thousand dollars from one tweet one tweet"
    },
    {
      "start": 503.24,
      "end": 513.88,
      "text": "this got 11.4 million views 143,000 likes and an insane amount of traction in the comments"
    },
    {
      "start": 513.88,
      "end": 519.96,
      "text": "so people like holy shit like no way this is happening and then look at the link"
    },
    {
      "start": 521.32,
      "end": 530.84,
      "text": "848,000 views yeah there's made us a lot of money and if it wasn't for my belief and if it"
    },
    {
      "start": 530.84,
      "end": 536.76,
      "text": "wasn't for my understanding of the algorithm and to keep pushing and like obsessing over what's"
    },
    {
      "start": 536.76,
      "end": 541.72,
      "text": "going viral and trying like frame that towards quitter and marketing this wouldn't have happened"
    },
    {
      "start": 543.0,
      "end": 547.64,
      "text": "and you know what's really cool about this as well after I went viral on Twitter I was like okay"
    },
    {
      "start": 547.64,
      "end": 552.84,
      "text": "they've probably go viral on Instagram and I just did the exact same format put it on Instagram"
    },
    {
      "start": 553.5600000000001,
      "end": 562.12,
      "text": "that ripped as well another 200,000 likes 300,000 likes and probably a hundred million views total"
    },
    {
      "start": 562.12,
      "end": 570.0400000000001,
      "text": "all platforms so it's very successful and you know I think a lot of people go into this app game"
    },
    {
      "start": 570.0400000000001,
      "end": 575.5600000000001,
      "text": "and they think oh yeah short form let's pay for creators like push the app like 10 seconds into"
    },
    {
      "start": 575.5600000000001,
      "end": 581.1600000000001,
      "text": "the video but there are so many other strategies that just people just overlook maybe because it"
    },
    {
      "start": 581.16,
      "end": 587.64,
      "text": "isn't talked about enough but don't underestimate Twitter and I'm about to get to read it next but"
    },
    {
      "start": 587.64,
      "end": 603.88,
      "text": "just don't underestimate these platforms and yeah peace out boys that's my segment"
    }
  ]
}