{
  "file_name": "031_Lesson_31.faudio-hi-0-Default.mp4",
  "text": " Hey everyone, welcome back to finally the tutorial on how to rebuild a successful app from scratch. Now a slight change of plan, we will be rebuilding Cal AI from scratch, focusing on like the fundamental feature, which pretty much is the taking a picture of your food and estimating the calories instead of your mix. The reason for this is because OpenAI and ChatGPT, they are limiting me from rating other people's faces, which is totally fair and there's not a problem. Cal AI, a little bit of background. Cal AI makes free and a half million dollars a month, they have almost 10 million downloads, and I'm going to run you through exactly how I would rebuild it from scratch and what kind of version I would launch into the market if I wanted to make a competitor, for example. Now I will preface this by saying I don't suggest you make a competitor to Cal AI, I mean even if you do, there is a lot of competition and a lot of people have tried and failed, but I want you to more use this tutorial as a kind of a visual representation on how you can build a super successful app from scratch and then you can translate these same concepts, these same execution I'm doing now into other ideas and other apps. So let's get started. The first thing you need to do is to download Xcode and once you've downloaded it, go to the top left, click Settings and log into your Apple account. You log in by clicking this plus icon on the bottom left, clicking Apple account, continue and then entering your details, super simple stuff. Once you've done that, you will click Create New Project, app next, call it Cal AI or whatever else you want to call it, and then make sure you come up with your own organization identifier. You can do like com.slater or com.maphia or com.whatever else, but it's totally unique and you need to come up with your own name. This can't be repeated by other people and you can't just copy the one I've written down. So I'm just going to do Mafia Tutorial. You can leave all of this as a standard and then choose a folder and destination where you'd want to code in. So I'm happy with the GitHub folder so I'll just click Create, bottom right and bomb. Your app is now live and in business. So this is going to load a preview. This is going to load a preview of what you're coding on the left side and like this will show, okay, so the left side is the back end and the right side is the front end. Everything you're typing on the left side will display itself in some shape or form on the front end if you're building the front end view. Obviously like the functions and stuff you won't be able to like see. But as you can see, if I just changed this from hello well to hello mafia, this update in real time and you can see exactly what you are building, which is super cool. So the way I usually like to start building apps is kind of mapping up the design first and you know people can say that this isn't necessarily productive but I like to do it because it gives me a vision of what the app is and that inspires me to and motivates me to keep building, keep building, keep building. Whereas if you're just working on a feature and the rest of it isn't built, you might be like, eh, I'm not super happy with this but if you start creating a brand around it and start doing the designs, it feels more real and more tangible and that pushes you to keep building. At least that's how I operate. So I'm going to start with like fontway.bold.font.title and if you watch this tutorial I suggested earlier like these concepts are really easy to understand. I'm not going to go into details on how to code but I will kind of give you a little bit about kind of what I'm doing where necessary. So okay, so that's the title. We'll do a spacer and then we'll do a button with the label of an image and this is when you opened SF symbols. I told you guys down at this earlier. So open SF symbols and we're going to go for a camera icon. So what do camera.circle? Is there a circle.fill? Let's see circle.fill. Okay, there is. So I'm going to copy this, this name and I'm going to do image system name. Actually I'm going to make this a bit bigger for you guys. Image system name, camera.circle.fill. So as you can see time the little circle in the corner now. Great. Now we'll do dot resizable. Scalpel to fit. Frame.Witth. I'm going to say width 45. Is that big enough? No. 90? Okay, I mean I'll do like AC. It's a fine balance. That's all good and then for the color I'm going to go red. Cool. Like a little like camera red recording icon which is sick. Okay, now inside this, inside this bracket you do the logic which will get to very very soon. So what this should do is you click on this it will then open your camera and there should be another button where you can click and snap a photo. That photo should then be sent back to the chat TbT API and then that will analyze the calories and estimate it and then you'll take that data that chat TbT is analyzed also where it's like estimate the calories and display that on the front end for the user. So that's our objective today and then we'll get into the pay all the energy I'll soon. So let's stop billing us. So what I would do is take this logic. Actually we'll just copy that entire file. Then we go to chattbt.com. Now close this. Hey chattbt. I'm coding a calorie tracker app and I want you to write me the code for a function that allows me to press the button shown below. Pull up the camera and when a photo is snapped it should send it back to the JGPT API and estimate the calories and also display the name of the food item it sees. Don't use any packages just use a standard API call and then I'm going to send it my code. Maybe I could have written this better but it doesn't have to be perfect. If you ask a question and it fucks up or isn't the result you're expecting you can always go back and say hey can we change this or I meant this thing or I meant to say or explain the bug. If this doesn't work just be like okay look it didn't estimate the calories it estimated the width of the food whatever it is but the prompt doesn't have to be perfect at least that's my tick so I would post this let's see what it says while we wait I'm going to take a civil water. Signed note chattbt.5 takes a hell of a long time to reply it honestly I love for O because it was incredibly accurate and fast so you know it is what it is but apparently the chattbt.5 makes less mistakes and thinks deeper about certain topics so you don't have to keep going back and forth because it did make the occasional mistakes okay this is important. You got to so I'll give you a quick background for Apple you need to clearly state why you're using certain features for example the camera or the microphone or the photo library you need to add and do this with me copy and as camera uses description go to xcode click cally i top left with us what you named it go into info click this plus icon paste it in click return it should then pull up the full name and then you can write we use your camera so you can take a picture of food and estimate the calories bomb you need to do this avoid your camera one work straight up very central okay well send me a massive massive code result and it's all in one file which you know isn't optimal but for the sake of the tutorial I think it's clearer and easier so we're going to stick with this okay it's just finished so I would copy this and not by the way this whole chat will be in the course materials you can go into this and also copy the exact code I'm I'm I'm taking here right now and then copy and paste the entire file back into it and let's see any errors two errors so what I would do is I would copy the errors if you do get them and they are occasional but they do happen I'm just going to show you how to navigate this you'd post I got two errors fix these for me please I'm going to paste the errors and it should know what's causing it like it should have the knowledge and intelligence to find out what is causing it and fix it for us you know what we can do in the meantime we can go to platform.openai.com platform.openai.com making account if you haven't already in the top right there should be a button to create an account okay look as you can see the sign up do that I already have an account so I don't ooh it would lock me up but I will make an incognito by my bad platform.openai.com once you assign then go to I believe manage projects yep API keys and then create a new secret key I'm going to call this one Cal AI clone and just pick the quitter project and this will create a secret key usually you can't reveal this but I'm like I'm going to delete this afterwards but copy the key and make sure you paste it into whoa like into this your your open AI API key so we'll do that right now that's how China GBT knows which account to build so incredibly important and you won't be able to do a function call about it that's very important to know as well okay let's get back to all right so sending back the full fixed file which means we're going to need to paste in the open AI key again but that's not an issue takes like a second by the way I intend to keep this process very broad and uncut just because like this is like the real grind you are seeing like directly behind the scenes of the building process and like if I do fast cuts a lot of you guys won't understand and I think it's very important to see the building process in its floors in its successes I kind of kind of adjust of how long it takes but we'll always prove this like eventually once it gets it right that's like the bulk of the work all right cool hopefully this work was hopefully this works so paste it in and no errors great all right now let's go back to our API key copy it and then paste it in the your opening API API such tongue twister your opening AI API key all right paste it in bomb and run of ships running to my phone oh no okay I've just run it on the simulator so let's see how it looks simulators are a little bit different to the preview by the way but I like using the simulator I guess let's test camera bomb camera right there amazing which is great and should work but because it's in the simulator and it has no physical camera you won't be able to see what it's doing so what we should do is run this I guess they great it works now please add functionality to upload stuff from your photo library as well in the meantime I'm going to find a picture of food on the simulator picture of lasagna actually lasagna is like so misleading because everything's like melted together but we'll try it we'll do this this picture it's going to hold down on it click save to photos this is just for the tutorial by the way usually in practice when people have their real phones they could just take a picture very simple but for the safety of the tutorial I will show you how this works okay so it's going to send like the full complete code again is that right seems like it it should be fast at this time because it's only changing a few lines but then we will need to find our API key again I'm going to tell it in future if there are any more changes we need to do after this to just use the API key that I provided but like I hope this is an example of like it's not super complex like yes there's a lot of back and forth from repetition and trying to like mold the AI to do you want but that's the game and once it's built once sorry she's the same word twice once it's built once I suppose you don't need to really build it again there's just slight improvements that you have to make but once I built this feature and I can just change the code slightly to improve it like I don't need to get this entire thing written written written again have to keep going back to AI I just make small changes and will I will say as well once you've built this app this example you can just go out there and market it you don't need to do much else like it can be very simple as long as it helps a select few people and makes their life maybe five to ten percent better that's all that matters and like the distribution of having an AI estimate the calories even if it isn't perfect is super helpful even if it sucks it can suck calie I launched and it launched with one feature and the tracking wasn't great they slowly started improving it but they still made hundreds of thousands of dollars before that point so I wouldn't over index on like getting a technical part I'm you know like I'd focus on just building MVP okay so that should be good and again I'm gonna have to get my API key annoying but hey all good so here we go paste it in run it on the simulator by the way to run I'm using command R so it's the Apple symbol in your keyboard plus let's okay let's see there we go so now I can choose from library and I'm gonna select the that's me I'm gonna select the lasagna and it's saying analyzing boom we have fucking built calie I okay that's how you do it right I'm launching a competitor Blake and Zach and Henry and Jake watch out because my calie I is going to destroy the market I'm gonna make way more money than you and you guys suck look how accurate that is come on now all right awesome boys we have something tangible now there are there are a bunch of improvements and changes you can make how much of it is totally relevant I don't know but like I'm telling you and I know this sucks but you could fully go to market with this product right now and how long did it take me like 17 minutes and that's just with like a bit of back and forth of AI 17 minutes and I've built the main feature that calie made hundreds of thousands of dollars with there we go this is the new age of software boys welcome to the fucking mafia new age okay great now let's go back to our course assignment all right well it looks like that's it for the core feature like we built it boys we have built it and we can do another test real quick just just for reference let's get like ice cream ice cream let's see if this works as well so we're going to images er we'll get this ice cream looks good but if it estimates the hand that would be so funny how many calories do you think are in a hand all right bomb analyzing let's go chocolate ice cream there we fucking go boys okay next module we'll go through the paywall and onboarding and we'll show you guys how to make money and how to turn this free product and easy to use products paywall it and then before the paywall just convince people why this is relevant to them and why they should pay see boys",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 7.48,
      "text": "Hey everyone, welcome back to finally the tutorial on how to rebuild a successful app from scratch."
    },
    {
      "start": 7.48,
      "end": 14.120000000000001,
      "text": "Now a slight change of plan, we will be rebuilding Cal AI from scratch, focusing on like the fundamental feature,"
    },
    {
      "start": 14.120000000000001,
      "end": 19.96,
      "text": "which pretty much is the taking a picture of your food and estimating the calories instead of your mix."
    },
    {
      "start": 19.96,
      "end": 26.560000000000002,
      "text": "The reason for this is because OpenAI and ChatGPT, they are limiting me from rating other people's faces,"
    },
    {
      "start": 26.56,
      "end": 31.279999999999998,
      "text": "which is totally fair and there's not a problem. Cal AI, a little bit of background."
    },
    {
      "start": 31.279999999999998,
      "end": 35.92,
      "text": "Cal AI makes free and a half million dollars a month, they have almost 10 million downloads,"
    },
    {
      "start": 35.92,
      "end": 45.12,
      "text": "and I'm going to run you through exactly how I would rebuild it from scratch and what kind of version I would launch into the market"
    },
    {
      "start": 45.12,
      "end": 47.4,
      "text": "if I wanted to make a competitor, for example."
    },
    {
      "start": 47.4,
      "end": 53.36,
      "text": "Now I will preface this by saying I don't suggest you make a competitor to Cal AI,"
    },
    {
      "start": 53.48,
      "end": 58.88,
      "text": "I mean even if you do, there is a lot of competition and a lot of people have tried and failed,"
    },
    {
      "start": 58.88,
      "end": 64.56,
      "text": "but I want you to more use this tutorial as a kind of a visual representation on how you can build"
    },
    {
      "start": 64.56,
      "end": 69.92,
      "text": "a super successful app from scratch and then you can translate these same concepts,"
    },
    {
      "start": 69.92,
      "end": 74.32,
      "text": "these same execution I'm doing now into other ideas and other apps."
    },
    {
      "start": 74.32,
      "end": 80.08,
      "text": "So let's get started. The first thing you need to do is to download Xcode and once you've downloaded it,"
    },
    {
      "start": 80.08,
      "end": 86.88,
      "text": "go to the top left, click Settings and log into your Apple account. You log in by clicking this plus icon on the bottom left,"
    },
    {
      "start": 86.88,
      "end": 91.44,
      "text": "clicking Apple account, continue and then entering your details, super simple stuff."
    },
    {
      "start": 93.2,
      "end": 101.44,
      "text": "Once you've done that, you will click Create New Project, app next, call it Cal AI or whatever else you want to call it,"
    },
    {
      "start": 101.44,
      "end": 105.6,
      "text": "and then make sure you come up with your own organization identifier."
    },
    {
      "start": 105.6,
      "end": 113.28,
      "text": "You can do like com.slater or com.maphia or com.whatever else, but it's totally unique and you need to come up"
    },
    {
      "start": 113.28,
      "end": 118.39999999999999,
      "text": "with your own name. This can't be repeated by other people and you can't just copy the one I've written down."
    },
    {
      "start": 118.39999999999999,
      "end": 127.44,
      "text": "So I'm just going to do Mafia Tutorial. You can leave all of this as a standard and then choose a folder"
    },
    {
      "start": 127.44,
      "end": 132.16,
      "text": "and destination where you'd want to code in. So I'm happy with the GitHub folder so I'll just click Create,"
    },
    {
      "start": 132.16,
      "end": 138.4,
      "text": "bottom right and bomb. Your app is now live and in business. So this is going to load a preview."
    },
    {
      "start": 142.16,
      "end": 149.35999999999999,
      "text": "This is going to load a preview of what you're coding on the left side and like this will show,"
    },
    {
      "start": 149.35999999999999,
      "end": 153.28,
      "text": "okay, so the left side is the back end and the right side is the front end. Everything you're typing on"
    },
    {
      "start": 153.28,
      "end": 158.72,
      "text": "the left side will display itself in some shape or form on the front end if you're building the front"
    },
    {
      "start": 158.72,
      "end": 163.6,
      "text": "end view. Obviously like the functions and stuff you won't be able to like see. But as you can see,"
    },
    {
      "start": 163.6,
      "end": 170.96,
      "text": "if I just changed this from hello well to hello mafia, this update in real time and you can see"
    },
    {
      "start": 170.96,
      "end": 180.24,
      "text": "exactly what you are building, which is super cool. So the way I usually like to start building apps"
    },
    {
      "start": 180.24,
      "end": 187.68,
      "text": "is kind of mapping up the design first and you know people can say that this isn't necessarily"
    },
    {
      "start": 187.68,
      "end": 194.08,
      "text": "productive but I like to do it because it gives me a vision of what the app is and that inspires me"
    },
    {
      "start": 194.08,
      "end": 198.0,
      "text": "to and motivates me to keep building, keep building, keep building. Whereas if you're just working on"
    },
    {
      "start": 198.0,
      "end": 203.92000000000002,
      "text": "a feature and the rest of it isn't built, you might be like, eh, I'm not super happy with this but if"
    },
    {
      "start": 203.92000000000002,
      "end": 209.28,
      "text": "you start creating a brand around it and start doing the designs, it feels more real and more tangible"
    },
    {
      "start": 209.28,
      "end": 213.92000000000002,
      "text": "and that pushes you to keep building. At least that's how I operate. So I'm going to start with like"
    },
    {
      "start": 213.92,
      "end": 221.2,
      "text": "fontway.bold.font.title and if you watch this tutorial I suggested earlier like these concepts"
    },
    {
      "start": 221.2,
      "end": 226.16,
      "text": "are really easy to understand. I'm not going to go into details on how to code but I will kind of give"
    },
    {
      "start": 226.16,
      "end": 231.04,
      "text": "you a little bit about kind of what I'm doing where necessary. So okay, so that's the title. We'll do"
    },
    {
      "start": 231.04,
      "end": 240.16,
      "text": "a spacer and then we'll do a button with the label of an image and this is when you opened SF symbols."
    },
    {
      "start": 240.16,
      "end": 246.24,
      "text": "I told you guys down at this earlier. So open SF symbols and we're going to go for a camera icon."
    },
    {
      "start": 246.24,
      "end": 254.16,
      "text": "So what do camera.circle? Is there a circle.fill? Let's see circle.fill. Okay, there is. So I'm going to"
    },
    {
      "start": 254.16,
      "end": 258.88,
      "text": "copy this, this name and I'm going to do image system name. Actually I'm going to make this a bit bigger"
    },
    {
      "start": 258.88,
      "end": 265.12,
      "text": "for you guys. Image system name, camera.circle.fill. So as you can see time the little circle in the corner now."
    },
    {
      "start": 265.2,
      "end": 273.2,
      "text": "Great. Now we'll do dot resizable. Scalpel to fit. Frame.Witth. I'm going to say width 45. Is that big enough? No. 90?"
    },
    {
      "start": 274.24,
      "end": 280.08,
      "text": "Okay, I mean I'll do like AC. It's a fine balance. That's all good and then for the color I'm going to go"
    },
    {
      "start": 283.04,
      "end": 290.64,
      "text": "red. Cool. Like a little like camera red recording icon which is sick. Okay, now inside this,"
    },
    {
      "start": 290.64,
      "end": 297.59999999999997,
      "text": "inside this bracket you do the logic which will get to very very soon. So what this should do is you"
    },
    {
      "start": 297.59999999999997,
      "end": 303.36,
      "text": "click on this it will then open your camera and there should be another button where you can click"
    },
    {
      "start": 303.36,
      "end": 309.52,
      "text": "and snap a photo. That photo should then be sent back to the chat TbT API and then that will"
    },
    {
      "start": 309.52,
      "end": 314.4,
      "text": "analyze the calories and estimate it and then you'll take that data that chat TbT is analyzed"
    },
    {
      "start": 315.2,
      "end": 319.2,
      "text": "also where it's like estimate the calories and display that on the front end for the user. So that's"
    },
    {
      "start": 319.28,
      "end": 324.64,
      "text": "our objective today and then we'll get into the pay all the energy I'll soon. So let's stop"
    },
    {
      "start": 324.64,
      "end": 332.64,
      "text": "billing us. So what I would do is take this logic. Actually we'll just copy that entire file."
    },
    {
      "start": 333.28,
      "end": 346.24,
      "text": "Then we go to chattbt.com. Now close this. Hey chattbt. I'm coding a calorie tracker app"
    },
    {
      "start": 346.56,
      "end": 358.8,
      "text": "and I want you to write me the code for a function that allows me to press the button shown below."
    },
    {
      "start": 361.2,
      "end": 372.48,
      "text": "Pull up the camera and when a photo is snapped it should send it back to the JGPT API"
    },
    {
      "start": 373.44,
      "end": 387.6,
      "text": "and estimate the calories and also display the name of the food item it sees. Don't use any packages"
    },
    {
      "start": 388.56,
      "end": 397.04,
      "text": "just use a standard API call and then I'm going to send it my code. Maybe I could have written this"
    },
    {
      "start": 397.04,
      "end": 403.36,
      "text": "better but it doesn't have to be perfect. If you ask a question and it fucks up or"
    },
    {
      "start": 403.36,
      "end": 408.24,
      "text": "isn't the result you're expecting you can always go back and say hey can we change this or I meant"
    },
    {
      "start": 408.24,
      "end": 415.68,
      "text": "this thing or I meant to say or explain the bug. If this doesn't work just be like okay look it"
    },
    {
      "start": 415.68,
      "end": 421.20000000000005,
      "text": "didn't estimate the calories it estimated the width of the food whatever it is but the prompt"
    },
    {
      "start": 421.2,
      "end": 427.76,
      "text": "doesn't have to be perfect at least that's my tick so I would post this let's see what it says"
    },
    {
      "start": 431.12,
      "end": 432.88,
      "text": "while we wait I'm going to take a civil water."
    },
    {
      "start": 439.36,
      "end": 445.12,
      "text": "Signed note chattbt.5 takes a hell of a long time to reply it honestly I love for O because"
    },
    {
      "start": 445.12,
      "end": 454.64,
      "text": "it was incredibly accurate and fast so you know it is what it is but apparently the"
    },
    {
      "start": 455.6,
      "end": 461.04,
      "text": "chattbt.5 makes less mistakes and thinks deeper about certain topics so you don't have to keep"
    },
    {
      "start": 461.04,
      "end": 465.44,
      "text": "going back and forth because it did make the occasional mistakes okay this is important."
    },
    {
      "start": 466.72,
      "end": 473.04,
      "text": "You got to so I'll give you a quick background for Apple you need to clearly state why you're"
    },
    {
      "start": 473.12,
      "end": 478.40000000000003,
      "text": "using certain features for example the camera or the microphone or the photo library you need to add"
    },
    {
      "start": 479.04,
      "end": 485.76000000000005,
      "text": "and do this with me copy and as camera uses description go to xcode click cally i top left"
    },
    {
      "start": 485.76000000000005,
      "end": 493.52000000000004,
      "text": "with us what you named it go into info click this plus icon paste it in click return it should then"
    },
    {
      "start": 493.52000000000004,
      "end": 501.12,
      "text": "pull up the full name and then you can write we use your camera so you can take a picture of food"
    },
    {
      "start": 501.2,
      "end": 511.92,
      "text": "and estimate the calories bomb you need to do this avoid your camera one work straight up very central"
    },
    {
      "start": 512.88,
      "end": 521.68,
      "text": "okay well send me a massive massive code result and it's all in one file which you know isn't"
    },
    {
      "start": 521.68,
      "end": 528.4,
      "text": "optimal but for the sake of the tutorial I think it's clearer and easier so we're going to stick with"
    },
    {
      "start": 528.48,
      "end": 536.4,
      "text": "this okay it's just finished so I would copy this and not by the way this whole chat will be"
    },
    {
      "start": 537.28,
      "end": 542.24,
      "text": "in the course materials you can go into this and also copy the exact code I'm I'm I'm taking"
    },
    {
      "start": 542.24,
      "end": 550.24,
      "text": "here right now and then copy and paste the entire file back into it and let's see any errors"
    },
    {
      "start": 550.32,
      "end": 558.72,
      "text": "two errors so what I would do is I would copy the errors if you do get them and they are"
    },
    {
      "start": 558.72,
      "end": 564.64,
      "text": "occasional but they do happen I'm just going to show you how to navigate this you'd post I got"
    },
    {
      "start": 565.76,
      "end": 573.28,
      "text": "two errors fix these for me please I'm going to paste the errors"
    },
    {
      "start": 573.4399999999999,
      "end": 582.16,
      "text": "and it should know what's causing it like it should have the knowledge and intelligence to find out"
    },
    {
      "start": 582.16,
      "end": 585.8399999999999,
      "text": "what is causing it and fix it for us"
    },
    {
      "start": 586.32,
      "end": 588.32,
      "text": "you"
    },
    {
      "start": 594.4,
      "end": 603.0400000000001,
      "text": "know what we can do in the meantime we can go to platform.openai.com platform.openai.com"
    },
    {
      "start": 604.0,
      "end": 607.2,
      "text": "making account if you haven't already in the top right there should be a button to create an"
    },
    {
      "start": 607.2,
      "end": 612.32,
      "text": "account okay look as you can see the sign up do that I already have an account so I don't"
    },
    {
      "start": 612.4000000000001,
      "end": 622.6400000000001,
      "text": "ooh it would lock me up but I will make an incognito by my bad platform.openai.com"
    },
    {
      "start": 627.2800000000001,
      "end": 638.08,
      "text": "once you assign then go to I believe manage projects yep API keys and then create a"
    },
    {
      "start": 638.08,
      "end": 644.4000000000001,
      "text": "new secret key I'm going to call this one Cal AI clone and just pick the quitter project"
    },
    {
      "start": 644.4000000000001,
      "end": 648.96,
      "text": "and this will create a secret key usually you can't reveal this but I'm like I'm going to delete"
    },
    {
      "start": 648.96,
      "end": 655.9200000000001,
      "text": "this afterwards but copy the key and make sure you paste it into whoa like"
    },
    {
      "start": 659.6800000000001,
      "end": 667.36,
      "text": "into this your your open AI API key so we'll do that right now"
    },
    {
      "start": 668.32,
      "end": 676.48,
      "text": "that's how China GBT knows which account to build so incredibly important and you won't be"
    },
    {
      "start": 676.48,
      "end": 681.2,
      "text": "able to do a function call about it that's very important to know as well okay let's get back to"
    },
    {
      "start": 691.36,
      "end": 694.96,
      "text": "all right so sending back the full fixed file which means we're going to need to paste in the"
    },
    {
      "start": 695.0400000000001,
      "end": 708.48,
      "text": "open AI key again but that's not an issue takes like a second by the way I intend to keep this"
    },
    {
      "start": 708.48,
      "end": 717.12,
      "text": "process very broad and uncut just because like this is like the real grind you are seeing like"
    },
    {
      "start": 717.12,
      "end": 721.9200000000001,
      "text": "directly behind the scenes of the building process and like if I do fast cuts a lot of you guys"
    },
    {
      "start": 721.92,
      "end": 728.8,
      "text": "won't understand and I think it's very important to see the building process in its floors"
    },
    {
      "start": 728.8,
      "end": 735.68,
      "text": "in its successes I kind of kind of adjust of how long it takes but we'll always prove this"
    },
    {
      "start": 735.68,
      "end": 738.56,
      "text": "like eventually once it gets it right that's like the bulk of the work"
    },
    {
      "start": 738.88,
      "end": 756.8,
      "text": "all right cool hopefully this work was hopefully this works so paste it in and no errors great"
    },
    {
      "start": 757.52,
      "end": 763.04,
      "text": "all right now let's go back to our API key copy it and then paste it in the your opening"
    },
    {
      "start": 763.1999999999999,
      "end": 771.1999999999999,
      "text": "API API such tongue twister your opening AI API key all right paste it in bomb and run of"
    },
    {
      "start": 771.1999999999999,
      "end": 780.9599999999999,
      "text": "ships running to my phone oh no okay I've just run it on the simulator so let's see how it looks"
    },
    {
      "start": 781.52,
      "end": 785.5999999999999,
      "text": "simulators are a little bit different to the preview by the way but I like using the simulator"
    },
    {
      "start": 786.08,
      "end": 791.84,
      "text": "I guess let's test camera bomb camera right there amazing"
    },
    {
      "start": 794.72,
      "end": 800.4,
      "text": "which is great and should work but because it's in the simulator and it has no physical camera"
    },
    {
      "start": 800.4,
      "end": 808.4,
      "text": "you won't be able to see what it's doing so what we should do is run this"
    },
    {
      "start": 808.48,
      "end": 823.92,
      "text": "I guess they great it works now please add functionality to upload stuff from your photo library"
    },
    {
      "start": 825.28,
      "end": 829.36,
      "text": "as well in the meantime I'm going to find a picture of food on the simulator"
    },
    {
      "start": 829.44,
      "end": 835.92,
      "text": "picture of lasagna"
    },
    {
      "start": 838.32,
      "end": 844.5600000000001,
      "text": "actually lasagna is like so misleading because everything's like melted together but we'll try it"
    },
    {
      "start": 844.5600000000001,
      "end": 851.2,
      "text": "we'll do this this picture it's going to hold down on it click save to photos this is just for"
    },
    {
      "start": 851.2,
      "end": 854.4,
      "text": "the tutorial by the way usually in practice when people have their real phones they could just"
    },
    {
      "start": 854.4,
      "end": 859.12,
      "text": "take a picture very simple but for the safety of the tutorial I will show you how this works"
    },
    {
      "start": 859.6800000000001,
      "end": 865.2,
      "text": "okay so it's going to send like the full complete code again is that right"
    },
    {
      "start": 869.6800000000001,
      "end": 876.64,
      "text": "seems like it it should be fast at this time because it's only changing a few lines but then"
    },
    {
      "start": 876.64,
      "end": 881.76,
      "text": "we will need to find our API key again I'm going to tell it in future if there are any more changes"
    },
    {
      "start": 881.76,
      "end": 885.6,
      "text": "we need to do after this to just use the API key that I provided"
    },
    {
      "start": 889.36,
      "end": 896.0,
      "text": "but like I hope this is an example of like it's not super complex like yes there's a lot of back"
    },
    {
      "start": 896.0,
      "end": 902.96,
      "text": "and forth from repetition and trying to like mold the AI to do you want but that's the game and once"
    },
    {
      "start": 902.96,
      "end": 910.08,
      "text": "it's built once sorry she's the same word twice once it's built once I suppose you don't need to"
    },
    {
      "start": 910.08,
      "end": 915.84,
      "text": "really build it again there's just slight improvements that you have to make but once I built this"
    },
    {
      "start": 915.84,
      "end": 920.8000000000001,
      "text": "feature and I can just change the code slightly to improve it like I don't need to get this"
    },
    {
      "start": 920.8000000000001,
      "end": 927.12,
      "text": "entire thing written written written again have to keep going back to AI I just make small changes"
    },
    {
      "start": 927.12,
      "end": 932.5600000000001,
      "text": "and will I will say as well once you've built this app this example you can just go out there and"
    },
    {
      "start": 932.5600000000001,
      "end": 938.08,
      "text": "market it you don't need to do much else like it can be very simple as long as it helps"
    },
    {
      "start": 938.08,
      "end": 943.6800000000001,
      "text": "a select few people and makes their life maybe five to ten percent better that's all that matters"
    },
    {
      "start": 943.68,
      "end": 950.4,
      "text": "and like the distribution of having an AI estimate the calories even if it isn't perfect"
    },
    {
      "start": 951.04,
      "end": 958.16,
      "text": "is super helpful even if it sucks it can suck calie I launched and it launched with one feature"
    },
    {
      "start": 958.16,
      "end": 962.4799999999999,
      "text": "and the tracking wasn't great they slowly started improving it but they still made hundreds of"
    },
    {
      "start": 962.4799999999999,
      "end": 967.1999999999999,
      "text": "thousands of dollars before that point so I wouldn't over index on like getting a technical part"
    },
    {
      "start": 968.1600000000001,
      "end": 976.72,
      "text": "I'm you know like I'd focus on just building MVP okay so that should be good and again I'm"
    },
    {
      "start": 976.72,
      "end": 985.76,
      "text": "gonna have to get my API key annoying but hey all good so here we go paste it in run it on the"
    },
    {
      "start": 985.76,
      "end": 991.2,
      "text": "simulator by the way to run I'm using command R so it's the Apple symbol in your keyboard plus"
    },
    {
      "start": 991.44,
      "end": 997.2800000000001,
      "text": "let's okay let's see there we go so now I can choose from library and I'm gonna select"
    },
    {
      "start": 997.2800000000001,
      "end": 1000.88,
      "text": "the that's me I'm gonna select the lasagna and it's saying analyzing"
    },
    {
      "start": 1003.2800000000001,
      "end": 1012.8000000000001,
      "text": "boom we have fucking built calie I okay that's how you do it right I'm launching a competitor"
    },
    {
      "start": 1012.8000000000001,
      "end": 1019.6,
      "text": "Blake and Zach and Henry and Jake watch out because my calie I is going to destroy the market"
    },
    {
      "start": 1019.6,
      "end": 1025.2,
      "text": "I'm gonna make way more money than you and you guys suck look how accurate that is come on now"
    },
    {
      "start": 1026.0,
      "end": 1030.96,
      "text": "all right awesome boys we have something tangible now there are there are a bunch of"
    },
    {
      "start": 1030.96,
      "end": 1036.56,
      "text": "improvements and changes you can make how much of it is totally relevant I don't know but like"
    },
    {
      "start": 1036.56,
      "end": 1041.6,
      "text": "I'm telling you and I know this sucks but you could fully go to market with this product right now"
    },
    {
      "start": 1041.6,
      "end": 1046.96,
      "text": "and how long did it take me like 17 minutes and that's just with like a bit of back and forth"
    },
    {
      "start": 1046.96,
      "end": 1052.72,
      "text": "of AI 17 minutes and I've built the main feature that calie made hundreds of thousands of dollars with"
    },
    {
      "start": 1054.0,
      "end": 1061.28,
      "text": "there we go this is the new age of software boys welcome to the fucking mafia new age okay great"
    },
    {
      "start": 1063.1200000000001,
      "end": 1066.0,
      "text": "now let's go back to our course assignment"
    },
    {
      "start": 1076.96,
      "end": 1105.92,
      "text": "all right well it looks like that's it for the core feature like we built it boys we have built it"
    },
    {
      "start": 1105.92,
      "end": 1112.88,
      "text": "and we can do another test real quick just just for reference let's get like ice cream ice cream"
    },
    {
      "start": 1114.0,
      "end": 1117.04,
      "text": "let's see if this works as well so we're going to images"
    },
    {
      "start": 1118.96,
      "end": 1125.52,
      "text": "er we'll get this ice cream looks good but if it estimates the hand that would be so funny how many calories"
    },
    {
      "start": 1125.52,
      "end": 1130.88,
      "text": "do you think are in a hand all right bomb analyzing let's go"
    },
    {
      "start": 1131.0400000000002,
      "end": 1141.7600000000002,
      "text": "chocolate ice cream there we fucking go boys okay next module we'll go through the paywall"
    },
    {
      "start": 1141.7600000000002,
      "end": 1147.2,
      "text": "and onboarding and we'll show you guys how to make money and how to turn this free product"
    },
    {
      "start": 1147.2,
      "end": 1152.24,
      "text": "and easy to use products paywall it and then before the paywall just convince people why this is"
    },
    {
      "start": 1152.24,
      "end": 1157.36,
      "text": "relevant to them and why they should pay see boys"
    }
  ]
}