{
  "file_name": "043_Lesson_43.faudio-hi-0-Default.mp4",
  "text": " Alrighty, let's get after it. What up boys? We are going to go over negotiations. So step one. Alright, you listening? Watch. Go. Be. A. Ready? Push it. Alright. Don't be a bitch. Okay? This isn't that hard. Have some confidence and let's get after it. So, what we are going to do is go over how to go from your DMs. Now you are doing outreach, right? You got responses from influencers. How do you take those influencer responses in your outreach, taking the DMs, responding to the DMs, alright, rhythm up, then take them to do some pre-call research, right? Get some information and then eventually get some call and close them to start posting content for you in raking and cash. Alright, here's the deal. Never share upfront pricing. If you are sharing upfront pricing, you are basically shooting yourself on the foot and asking yourself not to close an influencer. Alright, they are all going to say like what do you pay for a post, what do you do with this, how much are you willing to pay me? Alright, they all have egos, alright? Feed into them, but don't tell them the exact price. What you want to do is tell them we pay retainers ranging from $500 all the way up to thousands, 10,000 plus depending on the deal. And now then they are minding like holy shit. Bro, I can get paid $10,000 for this. Oh my god, now are we going to do that? Fuck no. Alright, now unless we are getting this like 6, 7 million views, we are doing that shit. But, the point here is to move the conversation to a call where you can tailor the deal. Now with your outreach messages, a lot of the time you are just going to send either number, you hop on a call with them, you want to send them the text, etc. But, if they start ripping back to you, hey what's the post, what can we do here, how much are you going to pay me? Always hit them with a, we'll pay you a couple hundred bucks up to a couple thousand depending on the deal structure. We have many deals. I would say generally if you are starting off, we are paying influencers anywhere from $500 to $500,000 depending on the deal. They don't have to know you haven't closed any influencers, but that's what you are willing to pay. So, that's honest. Alright, you are good. So, step 2 in this whole process is to get them on a call. Send them your number, tell them to call you, or get their number, send them a text right away, or call them right away, or book a call with them via text message. Right when you get their phone number, text them if you wait time, you're basically asking yourself not to close them. Step 2, you want to do some research. So, before this call, say you send them a text, you plan for a call tomorrow at noon, alright. And you need to figure out, what the fuck am I going to pitch, right? I don't know how much money I'm going to send them, I don't know what I'm going to pitch, how I'm going to use per video, what the fuck is a view guarantee that I hear Zach and Connor talking about, etc. But, here's what you're going to look for. You want to make sure they're posting daily, alright. No scatter gaps. You don't want any evidence to show you that they deleted under performing posts, and therefore you can find out, okay, if they're posting daily, they can post my videos once a week without bombarding their audience with sponsored content. They want consistent views, and you want consistent views, right. If they're pages performing, you care about their views, over their followers, only if there's a fuck about followers anymore, people care about attention. So, consistent views. We're talking at least 100,000 views per video. If you don't do that, then it's not really worth paying them, like 500 bucks a month. A lot of these guys won't do it unless they're just starting off. And so, you really want to look for at least 100,000 views per video. You can lower it based on what we're going to teach you in the pitch structure in this module. However, it might be hard for larger influencers that get more views to bite on that. And then you want to make sure there's engagement. So, we're going to go through two examples. One very good example, one shitty example. A great example is Jeremiah. Jeremiah kills it for us in Cali-I. As you can see, he gets roughly 200,000 views, 50,000, 120, 153, 358. It's Cali-I, video got 362. This is a quitter video got 473. So, Jeremiah rips fucking views. And the best part about it is he's posting daily, if not once or twice a day, five days ago, five days ago, six days ago, six days ago, right? Six days ago, seven days ago. So, he's posting multiple times per day. So, therefore, he can post our content, pushing our product without pissing off his audience. Now, another thing is, dude, his comment sections are fucking crazy. He has people commenting. He's literally having people react to him. People are like, holy shit, this is funny, this is not funny, et cetera. You want controversy in the comments. People do the greed, disagree. What you don't want is fucking fire emojis, right? So, if I'm going to show you another example, let's go to Dave. Not to shit on Dave here, but look at Dave. He's got great engagement, right? However, he doesn't really grip views, dude. What am I going to pay this guy? What up, V? On a join this, boy? We're shitting on Dave's content. See, only it's 30,000 views per video. Fuck this dude. I know, dude, he's chopped. But, like, guys, look, he doesn't get enough views per video. Therefore, we can't pay him a grand or even two grand. Dude, there are so many motherfuckers like this where it's like, how many followers? Yeah, but they have a lot of followers, especially guys that used to be relevant. Yo, if you're launching a product and you're thinking, who are the influencers that I should work with? Oh, here are the guys that I saw in the past. And then you go hit them up. They're going to tell you the $5,000 in a fucking dollar is for a post. And you're going to be like, man, influencer marketing doesn't work. It's like, no, you're going after the wrong people. Here's another example. You got this guy, Dewey, right? We used to work with him with Quitter. But what we did is we made a mistake. His fucking content gets laughing emojis. He doesn't have a community. No one gives a fuck about him. You, they laugh at him and it converted some, but at the end of the day, we don't want to work with him anymore so we clipped him. Dude, you want to see conversations occurring in the comments section and people referencing a past shit that the creator has done. One of the best examples of this is Santa Cruz. Santa Cruz is actually mad at me right now. I think I mentioned this very much during one of my videos. Because he thought I was talking shit because I was like supporting Sam and whatnot. And he and Sam are beefing. Drama. Yeah, a little bit of a pussy, but that's okay. Member guys. Don't be a pussy. But if you look at Santa Cruz's content, more so on TikTok, to be honest, actually maybe his Instagram following isn't as tight as I thought. But at the very least, it's all very real responses. It's like, it's all people leaving actual comments. You're not just seeing emojis. And I think that the mobile version is better at filtering for top comments and whatnot. Now, once again, point here being, you want creators that actually have people that care about them. For the content that they post. Rather than people that, and for who they are as a person, rather than creators that only have people that find the content funny and drop a laugh emoji and then move on. And this works because that creator actually has trust with their audience. And so therefore when they push your product, they're more likely to convert. 20 years by 10 minutes. All right. So now let me go through call research. We see that they have posting daily. They get consistent views per video and they get engagement. The next thing you have to do is free your pitch. So when you're looking at their content, we want to offer four videos per month of the video per week. And this can probably be cross post feed TikTok and Instagram. Some creators get a lot of views on Instagram, low views on TikTok or flip flop. And so what you do is you look at both of their accounts. You might find, okay, Jeremiah can get me a quarter million views on Instagram. And like 50,000 views on TikTok. Therefore I'm like, all right, it's 300,000 views. That's 1.2 million views a month. So I can be like, okay, at a $2 CPM is what you really want the rate. If you need low end $2, high end $3, maybe you can go a little lower than $2 that higher end deals with like five to 10 K a month. However, generally speaking for you guys need, it's going to be a $2 CPM high end 3, or else you're going to be eating in your margins, probably losing money. So if you look at Jeremiah, right, he has... Right, roughly quarter million views. So I would go to him, I'll offer you $2,500 for 1.2 million views. Right? He'd be like, oh, this is sick. He'll probably bite on that because we can offer him a retainer and we're pitching a long term deal here. We're not pitching him, hey, I want to do one post or I want to do one month. We're pitching him like, hey, we want to work with our creators six months, 12 months, 18 months, et cetera. Now, contracts for you over the next section are going to be structured in a way where you protect yourself and you clip that thing month one. Number two, another way to protect yourself is you'll pay a certain percentage up front. So usually pay up to 20 to 40% depending on the creator and what they want up front. So therefore you're protecting yourself on the downside. So if they only post three videos, you get an ROI and that 20% paid up front. And if they don't post, they don't hit their beauty guarantee. You don't pay them the rest of the videos. And that's very clearly outlined in the contract. And so the next thing is now you've got this structure. You know many views are getting, you don't need to usually want from them per month. You know me videos, they're posting. Okay. Now you're like, all right, I got to approach this call. How the fuck am I going to close them? I've never done a sales call. I don't know what's the fucking word. Skill set and sales will call it. But guys, this isn't very hard. All you have to do is be charismatic and approachable. Build rapport with them. Build trust. Like act like they're your boy. Just let me fucking talk to them. People want to be treated like humans. And so the intro of the call, I highly recommend getting to know the person. Talk into them. Don't just dive into the deal because I'm just going to feel like you're there just to suck value out of them. Which we are, but you want to build a relationship. We've relationship with all of our creators. Like we can text them. Like a text fucking Jeremiah right now or call me to respond. Now the second thing is concern. Confirm that it's a fit. Make sure that they're comfortable posting your content. You've already looked at their contents and you know it'll fit with your product. So you kind of know this, but you're basically having them tell you it fits. They're confirming for you like, hey, yeah, this works really well with my audience. They love this. This isn't feel salesy like piss of pitching like fucking sell seats or some large company. And no one gives a shit about anymore. It's another more comfortable. Then you present the offer like, look, hey Jeremiah, I want four videos a month. That's one video a week. The view guarantee is based off your consistent view. So this is something that you can hit and achieve. And we're not trying to fuck you on this. Now with the CPM baseline, I would highly recommend not saying we're basing this off on this. CPM, which stands for cost per million, cost per thousand views. You just say, hey, I'm going to pay $2,000 per million views. That's simple. You can say, I like that. I don't like that. He doesn't like that. And you should be like, hey man, like what do you want? Right? What are you thinking? What makes this worth your time? And then he'll give you a number. The biggest a joke objection you'll get is the view guarantee. Right? So it would be like, I don't want to do a view guarantee because I don't want to hit the views. And you simply say, look, we base this off of your content. You post two times a day, you get these views. So you're going to hit this. And it's your job to get views, our job to convert those views. Right? So we can't make a, we can't cover our bottom line costs and anything, let's be get paid through conversions, which the influence or brings. And so now they're more comfortable because they're like, oh shit, like I'm going to get them views and then I'm going to get paid for getting views. Instead of just being a one off deal from fucking dick sporting goods for 5K, they get like once a year. Now, now this has been said, they're comfortable. You close them basically. They're ready. They're like, I'm in Connor, right? Let's go. Hands down. What you want to do is in schedule follow up. So generally, I schedule follow up, review the contract. I follow the text saying, like here's what we spoke about, just confirming. I will send the contract, please send me your email. And so generally, they call, like as long as you set expectations, confirm they're a fit and they tell you they're a fit. They understand that they're posting four videos a month once a week. Maybe you can pick a day that they post and you follow up. They understand the retainer deal structure and they're line up pricing. You're done. It's closed. Done deal. Game over. All right. If they're not ready, whether it's because it's too high of a budget, you don't have the money for them, etc. I would honestly just stay in touch with them. Follow up with them every couple of weeks. We're having to think about it. Schedule call. If I can't not ready, you need to figure some things out. Let's schedule call on two, three days. Let's put it on the calendar and we'll talk then. What I said about the view guarantee, I usually pitch this. As I said, you say for a million views a month, we'll pay $2,000. I wouldn't say to $2 a CPM. You don't need to use a link that could confuse them. And then you just tell them, look, we're paying you for getting views and we're going to convert those views for a long term partnership. It's very fruitful for both of us. As I noted, their jobs give you, your job is convert those views. You can be very polite when you say that. You're really just pitching that to mutual benefit. When it comes to objections and responses, usually they say like, hey, I usually say, I usually get paid five grand per per post, Blake was saying. These guys have been the issue for a while. You see a paid fucking so much money for doing nothing. These fucking companies are retarded. Now the game is you want views. I can pay you five knowledge per post. That's two grand. I need a million views. I can get you quarter million views. That's worth $500 to $750. It's not a good fit. You move on. You're doing so much outreach. You're going to have tens of 20, 30, 40 creators responding every single day as you send 100 DMs a day. So generally, just work backwards, work with them, be understanding. When it comes to the view guarantee, I would just basically say, hey, your job is to get views consistently. Our job is to pay you. And this view guarantee is based off what you already average or views wise. So it's achievable. We're not asking for you an unrealistic ask and try to fuck you. And if they don't hit the view guarantee, you structure your contracts to basically say they're going to keep posting to hit it or you pro rated. So for example, if they get 800,000 views and they need a million, they can just post again to hit that. And then you pay them after they post that fifth video or say they get half million views and just get a million. You can be like, all right, I'll pay you a grand and set a two grand, right? 50% of the contract. So once the rate of proceed, I recommend sending the contract same day. Get them to look at it, follow up with them, make sure they're comfortable. Get that shit signed and onboard them. Usually the onboarding, I usually set up a group chat with my team. They handle that and we're in the communications. Make sure everything goes smoothly. Or when we're starting out, I would just text them, get the contract signed, ready to go. And next is management them. So at the end of the day, like we mentioned, if they're not ready, just be understanding. Schedule a second call. If they're out of budget, just tell them, hey, we'd love to reach back out when our budget grows. To be super respectful, you don't want to burn any bridges in this industry. We did that and it kind of fucked us. We had to repair relationships because I was like, oh, no, screw you this and that. You kind of get your emotions. You drop the fucking ego and plane to their ego. Make it seem like they're getting the better end of the deal here. So once you've finished this, put them in your CRM. I recommend just setting up a Google Sheet with Info and her name, followers, links to TikTok, etc. The deal structure, right? How many videos are getting? What you're paying them? The upfront payment? Log when you pay your first payment, your second payment. So they can track things. And then eventually, once you get over five influence, recommend using a tool like Groey, which will go over, which automatically tracks views, pays out. They handle all the documentation so you can actually write off these expenses for your business. Just the fucking cap this off. Look, be charismatic and understand. You can be confident without being a fucking dick. Don't be a fucking loser. Be soft. Get pushed around like, dude, understand this is a mutual benefit. You are helping them as well. Make sure they understand. And then you pitch it as they get the better end of the half. You're getting views. You can even set up bonus structures, which they may ask for. They may not. I don't recommend doing that off the bat unless they actually ask. And I wouldn't hard sell them because if you hard sell them, it becomes this pissing contest. And it's probably not going to lead to a deal. So at the end of the day, be charismatic. Do never talk about fucking pricing the DMs. Get them on a call, talk to them. You can go from there, like, yeah, just be human. So that is how you negotiate with influencers. Next we're going to talk about managing them, how to track them. And yeah, it's fucking get after it, boys.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 7.0,
      "text": "Alrighty, let's get after it."
    },
    {
      "start": 12.3,
      "end": 13.66,
      "text": "What up boys?"
    },
    {
      "start": 13.66,
      "end": 15.540000000000001,
      "text": "We are going to go over negotiations."
    },
    {
      "start": 15.540000000000001,
      "end": 17.14,
      "text": "So step one."
    },
    {
      "start": 17.14,
      "end": 19.3,
      "text": "Alright, you listening?"
    },
    {
      "start": 19.3,
      "end": 20.3,
      "text": "Watch."
    },
    {
      "start": 20.3,
      "end": 21.3,
      "text": "Go."
    },
    {
      "start": 21.3,
      "end": 24.3,
      "text": "Be."
    },
    {
      "start": 24.3,
      "end": 26.3,
      "text": "A."
    },
    {
      "start": 26.3,
      "end": 27.3,
      "text": "Ready?"
    },
    {
      "start": 27.3,
      "end": 28.3,
      "text": "Push it."
    },
    {
      "start": 28.3,
      "end": 29.3,
      "text": "Alright."
    },
    {
      "start": 29.3,
      "end": 33.3,
      "text": "Don't be a bitch."
    },
    {
      "start": 33.3,
      "end": 34.3,
      "text": "Okay?"
    },
    {
      "start": 34.3,
      "end": 35.3,
      "text": "This isn't that hard."
    },
    {
      "start": 35.3,
      "end": 38.3,
      "text": "Have some confidence and let's get after it."
    },
    {
      "start": 38.3,
      "end": 44.3,
      "text": "So, what we are going to do is go over how to go from your DMs."
    },
    {
      "start": 44.3,
      "end": 45.3,
      "text": "Now you are doing outreach, right?"
    },
    {
      "start": 45.3,
      "end": 47.3,
      "text": "You got responses from influencers."
    },
    {
      "start": 47.3,
      "end": 52.3,
      "text": "How do you take those influencer responses in your outreach, taking the DMs, responding"
    },
    {
      "start": 52.3,
      "end": 58.3,
      "text": "to the DMs, alright, rhythm up, then take them to do some pre-call research, right?"
    },
    {
      "start": 58.3,
      "end": 61.739999999999995,
      "text": "Get some information and then eventually get some call and close them to start posting"
    },
    {
      "start": 61.739999999999995,
      "end": 64.3,
      "text": "content for you in raking and cash."
    },
    {
      "start": 64.3,
      "end": 66.6,
      "text": "Alright, here's the deal."
    },
    {
      "start": 66.6,
      "end": 67.6,
      "text": "Never share upfront pricing."
    },
    {
      "start": 67.6,
      "end": 71.06,
      "text": "If you are sharing upfront pricing, you are basically shooting yourself on the foot"
    },
    {
      "start": 71.06,
      "end": 73.02,
      "text": "and asking yourself not to close an influencer."
    },
    {
      "start": 73.02,
      "end": 76.42,
      "text": "Alright, they are all going to say like what do you pay for a post, what do you do with"
    },
    {
      "start": 76.42,
      "end": 78.42,
      "text": "this, how much are you willing to pay me?"
    },
    {
      "start": 78.42,
      "end": 79.42,
      "text": "Alright, they all have egos, alright?"
    },
    {
      "start": 79.42,
      "end": 82.42,
      "text": "Feed into them, but don't tell them the exact price."
    },
    {
      "start": 82.42,
      "end": 88.42,
      "text": "What you want to do is tell them we pay retainers ranging from $500 all the way up to thousands,"
    },
    {
      "start": 88.42,
      "end": 89.42,
      "text": "10,000 plus depending on the deal."
    },
    {
      "start": 89.42,
      "end": 92.42,
      "text": "And now then they are minding like holy shit."
    },
    {
      "start": 92.42,
      "end": 95.42,
      "text": "Bro, I can get paid $10,000 for this."
    },
    {
      "start": 95.42,
      "end": 97.42,
      "text": "Oh my god, now are we going to do that?"
    },
    {
      "start": 97.42,
      "end": 98.42,
      "text": "Fuck no."
    },
    {
      "start": 98.42,
      "end": 102.42,
      "text": "Alright, now unless we are getting this like 6, 7 million views, we are doing that shit."
    },
    {
      "start": 102.42,
      "end": 108.42,
      "text": "But, the point here is to move the conversation to a call where you can tailor the deal."
    },
    {
      "start": 108.42,
      "end": 111.42,
      "text": "Now with your outreach messages, a lot of the time you are just going to send either number,"
    },
    {
      "start": 111.42,
      "end": 114.42,
      "text": "you hop on a call with them, you want to send them the text, etc."
    },
    {
      "start": 114.42,
      "end": 119.42,
      "text": "But, if they start ripping back to you, hey what's the post, what can we do here, how much are you going to pay me?"
    },
    {
      "start": 119.42,
      "end": 125.42,
      "text": "Always hit them with a, we'll pay you a couple hundred bucks up to a couple thousand depending on the deal structure."
    },
    {
      "start": 125.42,
      "end": 127.42,
      "text": "We have many deals."
    },
    {
      "start": 128.42000000000002,
      "end": 135.42000000000002,
      "text": "I would say generally if you are starting off, we are paying influencers anywhere from $500 to $500,000 depending on the deal."
    },
    {
      "start": 135.42000000000002,
      "end": 138.42000000000002,
      "text": "They don't have to know you haven't closed any influencers, but that's what you are willing to pay."
    },
    {
      "start": 138.42000000000002,
      "end": 139.42000000000002,
      "text": "So, that's honest."
    },
    {
      "start": 139.42000000000002,
      "end": 140.42000000000002,
      "text": "Alright, you are good."
    },
    {
      "start": 140.42000000000002,
      "end": 144.42000000000002,
      "text": "So, step 2 in this whole process is to get them on a call."
    },
    {
      "start": 144.42000000000002,
      "end": 149.42000000000002,
      "text": "Send them your number, tell them to call you, or get their number, send them a text right away, or call them right away,"
    },
    {
      "start": 149.42000000000002,
      "end": 151.42000000000002,
      "text": "or book a call with them via text message."
    },
    {
      "start": 151.42,
      "end": 156.42,
      "text": "Right when you get their phone number, text them if you wait time, you're basically asking yourself not to close them."
    },
    {
      "start": 156.42,
      "end": 158.42,
      "text": "Step 2, you want to do some research."
    },
    {
      "start": 158.42,
      "end": 164.42,
      "text": "So, before this call, say you send them a text, you plan for a call tomorrow at noon, alright."
    },
    {
      "start": 164.42,
      "end": 167.42,
      "text": "And you need to figure out, what the fuck am I going to pitch, right?"
    },
    {
      "start": 167.42,
      "end": 172.42,
      "text": "I don't know how much money I'm going to send them, I don't know what I'm going to pitch, how I'm going to use per video,"
    },
    {
      "start": 172.42,
      "end": 176.42,
      "text": "what the fuck is a view guarantee that I hear Zach and Connor talking about, etc."
    },
    {
      "start": 176.42,
      "end": 178.42,
      "text": "But, here's what you're going to look for."
    },
    {
      "start": 178.42,
      "end": 181.42,
      "text": "You want to make sure they're posting daily, alright. No scatter gaps."
    },
    {
      "start": 181.42,
      "end": 189.42,
      "text": "You don't want any evidence to show you that they deleted under performing posts, and therefore you can find out, okay, if they're posting daily,"
    },
    {
      "start": 189.42,
      "end": 194.42,
      "text": "they can post my videos once a week without bombarding their audience with sponsored content."
    },
    {
      "start": 194.42,
      "end": 198.42,
      "text": "They want consistent views, and you want consistent views, right."
    },
    {
      "start": 198.42,
      "end": 201.42,
      "text": "If they're pages performing, you care about their views, over their followers,"
    },
    {
      "start": 201.42,
      "end": 204.42,
      "text": "only if there's a fuck about followers anymore, people care about attention."
    },
    {
      "start": 204.42,
      "end": 209.42,
      "text": "So, consistent views. We're talking at least 100,000 views per video."
    },
    {
      "start": 209.42,
      "end": 214.42,
      "text": "If you don't do that, then it's not really worth paying them, like 500 bucks a month."
    },
    {
      "start": 214.42,
      "end": 216.42,
      "text": "A lot of these guys won't do it unless they're just starting off."
    },
    {
      "start": 216.42,
      "end": 219.42,
      "text": "And so, you really want to look for at least 100,000 views per video."
    },
    {
      "start": 219.42,
      "end": 224.42,
      "text": "You can lower it based on what we're going to teach you in the pitch structure in this module."
    },
    {
      "start": 224.42,
      "end": 230.42,
      "text": "However, it might be hard for larger influencers that get more views to bite on that."
    },
    {
      "start": 230.42,
      "end": 233.42,
      "text": "And then you want to make sure there's engagement. So, we're going to go through two examples."
    },
    {
      "start": 233.42,
      "end": 236.42,
      "text": "One very good example, one shitty example."
    },
    {
      "start": 236.42,
      "end": 239.42,
      "text": "A great example is Jeremiah."
    },
    {
      "start": 239.42,
      "end": 241.42,
      "text": "Jeremiah kills it for us in Cali-I."
    },
    {
      "start": 241.42,
      "end": 248.42,
      "text": "As you can see, he gets roughly 200,000 views, 50,000, 120, 153, 358."
    },
    {
      "start": 248.42,
      "end": 251.42,
      "text": "It's Cali-I, video got 362."
    },
    {
      "start": 251.42,
      "end": 253.42,
      "text": "This is a quitter video got 473."
    },
    {
      "start": 253.42,
      "end": 255.42,
      "text": "So, Jeremiah rips fucking views."
    },
    {
      "start": 255.42,
      "end": 259.41999999999996,
      "text": "And the best part about it is he's posting daily, if not once or twice a day,"
    },
    {
      "start": 259.42,
      "end": 264.42,
      "text": "five days ago, five days ago, six days ago, six days ago, right?"
    },
    {
      "start": 264.42,
      "end": 267.42,
      "text": "Six days ago, seven days ago."
    },
    {
      "start": 267.42,
      "end": 269.42,
      "text": "So, he's posting multiple times per day."
    },
    {
      "start": 269.42,
      "end": 274.42,
      "text": "So, therefore, he can post our content, pushing our product without pissing off his audience."
    },
    {
      "start": 274.42,
      "end": 278.42,
      "text": "Now, another thing is, dude, his comment sections are fucking crazy."
    },
    {
      "start": 278.42,
      "end": 279.42,
      "text": "He has people commenting."
    },
    {
      "start": 279.42,
      "end": 281.42,
      "text": "He's literally having people react to him."
    },
    {
      "start": 281.42,
      "end": 283.42,
      "text": "People are like, holy shit, this is funny, this is not funny, et cetera."
    },
    {
      "start": 283.42,
      "end": 285.42,
      "text": "You want controversy in the comments."
    },
    {
      "start": 285.42,
      "end": 286.42,
      "text": "People do the greed, disagree."
    },
    {
      "start": 286.42,
      "end": 289.42,
      "text": "What you don't want is fucking fire emojis, right?"
    },
    {
      "start": 289.42,
      "end": 295.42,
      "text": "So, if I'm going to show you another example, let's go to Dave."
    },
    {
      "start": 295.42,
      "end": 301.42,
      "text": "Not to shit on Dave here, but look at Dave."
    },
    {
      "start": 301.42,
      "end": 304.42,
      "text": "He's got great engagement, right?"
    },
    {
      "start": 304.42,
      "end": 307.42,
      "text": "However, he doesn't really grip views, dude."
    },
    {
      "start": 307.42,
      "end": 309.42,
      "text": "What am I going to pay this guy?"
    },
    {
      "start": 309.42,
      "end": 310.42,
      "text": "What up, V?"
    },
    {
      "start": 310.42,
      "end": 312.42,
      "text": "On a join this, boy?"
    },
    {
      "start": 312.42,
      "end": 314.42,
      "text": "We're shitting on Dave's content."
    },
    {
      "start": 314.42,
      "end": 316.42,
      "text": "See, only it's 30,000 views per video."
    },
    {
      "start": 316.42,
      "end": 317.42,
      "text": "Fuck this dude."
    },
    {
      "start": 317.42,
      "end": 318.42,
      "text": "I know, dude, he's chopped."
    },
    {
      "start": 318.42,
      "end": 320.42,
      "text": "But, like, guys, look, he doesn't get enough views per video."
    },
    {
      "start": 320.42,
      "end": 323.42,
      "text": "Therefore, we can't pay him a grand or even two grand."
    },
    {
      "start": 323.42,
      "end": 326.42,
      "text": "Dude, there are so many motherfuckers like this where it's like, how many followers?"
    },
    {
      "start": 326.42,
      "end": 330.42,
      "text": "Yeah, but they have a lot of followers, especially guys that used to be relevant."
    },
    {
      "start": 330.42,
      "end": 334.42,
      "text": "Yo, if you're launching a product and you're thinking,"
    },
    {
      "start": 334.42,
      "end": 336.42,
      "text": "who are the influencers that I should work with?"
    },
    {
      "start": 336.42,
      "end": 339.42,
      "text": "Oh, here are the guys that I saw in the past."
    },
    {
      "start": 339.42,
      "end": 341.42,
      "text": "And then you go hit them up."
    },
    {
      "start": 341.42,
      "end": 344.42,
      "text": "They're going to tell you the $5,000 in a fucking dollar is for a post."
    },
    {
      "start": 344.42,
      "end": 347.42,
      "text": "And you're going to be like, man, influencer marketing doesn't work."
    },
    {
      "start": 347.42,
      "end": 350.42,
      "text": "It's like, no, you're going after the wrong people."
    },
    {
      "start": 350.42,
      "end": 351.42,
      "text": "Here's another example."
    },
    {
      "start": 351.42,
      "end": 353.42,
      "text": "You got this guy, Dewey, right?"
    },
    {
      "start": 353.42,
      "end": 354.42,
      "text": "We used to work with him with Quitter."
    },
    {
      "start": 354.42,
      "end": 356.42,
      "text": "But what we did is we made a mistake."
    },
    {
      "start": 356.42,
      "end": 358.42,
      "text": "His fucking content gets laughing emojis."
    },
    {
      "start": 358.42,
      "end": 359.42,
      "text": "He doesn't have a community."
    },
    {
      "start": 359.42,
      "end": 361.42,
      "text": "No one gives a fuck about him."
    },
    {
      "start": 361.42,
      "end": 364.42,
      "text": "You, they laugh at him and it converted some, but at the end of the day,"
    },
    {
      "start": 364.42,
      "end": 366.42,
      "text": "we don't want to work with him anymore so we clipped him."
    },
    {
      "start": 366.42,
      "end": 370.42,
      "text": "Dude, you want to see conversations occurring in the comments section"
    },
    {
      "start": 370.42,
      "end": 374.42,
      "text": "and people referencing a past shit that the creator has done."
    },
    {
      "start": 374.42,
      "end": 378.42,
      "text": "One of the best examples of this is Santa Cruz."
    },
    {
      "start": 378.42,
      "end": 380.42,
      "text": "Santa Cruz is actually mad at me right now."
    },
    {
      "start": 380.42,
      "end": 383.42,
      "text": "I think I mentioned this very much during one of my videos."
    },
    {
      "start": 383.42,
      "end": 386.42,
      "text": "Because he thought I was talking shit because I was like supporting Sam"
    },
    {
      "start": 386.42,
      "end": 387.42,
      "text": "and whatnot."
    },
    {
      "start": 387.42,
      "end": 388.42,
      "text": "And he and Sam are beefing."
    },
    {
      "start": 388.42,
      "end": 389.42,
      "text": "Drama."
    },
    {
      "start": 389.42,
      "end": 391.42,
      "text": "Yeah, a little bit of a pussy, but that's okay."
    },
    {
      "start": 391.42,
      "end": 392.42,
      "text": "Member guys."
    },
    {
      "start": 392.42,
      "end": 395.42,
      "text": "Don't be a pussy."
    },
    {
      "start": 395.42,
      "end": 398.42,
      "text": "But if you look at Santa Cruz's content,"
    },
    {
      "start": 398.42,
      "end": 406.42,
      "text": "more so on TikTok, to be honest, actually maybe his Instagram following isn't as tight as I thought."
    },
    {
      "start": 406.42,
      "end": 410.42,
      "text": "But at the very least, it's all very real responses."
    },
    {
      "start": 410.42,
      "end": 414.42,
      "text": "It's like, it's all people leaving actual comments."
    },
    {
      "start": 414.42,
      "end": 416.42,
      "text": "You're not just seeing emojis."
    },
    {
      "start": 416.42,
      "end": 422.42,
      "text": "And I think that the mobile version is better at filtering for top comments and whatnot."
    },
    {
      "start": 422.42,
      "end": 427.42,
      "text": "Now, once again, point here being, you want creators that actually have people that care about them."
    },
    {
      "start": 427.42,
      "end": 430.42,
      "text": "For the content that they post."
    },
    {
      "start": 430.42,
      "end": 435.42,
      "text": "Rather than people that, and for who they are as a person,"
    },
    {
      "start": 435.42,
      "end": 442.42,
      "text": "rather than creators that only have people that find the content funny and drop a laugh emoji and then move on."
    },
    {
      "start": 442.42,
      "end": 445.42,
      "text": "And this works because that creator actually has trust with their audience."
    },
    {
      "start": 445.42,
      "end": 448.42,
      "text": "And so therefore when they push your product, they're more likely to convert."
    },
    {
      "start": 448.42,
      "end": 451.42,
      "text": "20 years by 10 minutes."
    },
    {
      "start": 451.42,
      "end": 452.42,
      "text": "All right."
    },
    {
      "start": 452.42,
      "end": 455.42,
      "text": "So now let me go through call research."
    },
    {
      "start": 455.42,
      "end": 457.42,
      "text": "We see that they have posting daily."
    },
    {
      "start": 457.42,
      "end": 460.42,
      "text": "They get consistent views per video and they get engagement."
    },
    {
      "start": 460.42,
      "end": 462.42,
      "text": "The next thing you have to do is free your pitch."
    },
    {
      "start": 462.42,
      "end": 466.42,
      "text": "So when you're looking at their content, we want to offer four videos per month of the video per week."
    },
    {
      "start": 466.42,
      "end": 469.42,
      "text": "And this can probably be cross post feed TikTok and Instagram."
    },
    {
      "start": 469.42,
      "end": 474.42,
      "text": "Some creators get a lot of views on Instagram, low views on TikTok or flip flop."
    },
    {
      "start": 474.42,
      "end": 477.42,
      "text": "And so what you do is you look at both of their accounts."
    },
    {
      "start": 477.42,
      "end": 480.42,
      "text": "You might find, okay, Jeremiah can get me a quarter million views on Instagram."
    },
    {
      "start": 480.42,
      "end": 482.42,
      "text": "And like 50,000 views on TikTok."
    },
    {
      "start": 482.42,
      "end": 484.42,
      "text": "Therefore I'm like, all right, it's 300,000 views."
    },
    {
      "start": 484.42,
      "end": 486.42,
      "text": "That's 1.2 million views a month."
    },
    {
      "start": 486.42,
      "end": 489.42,
      "text": "So I can be like, okay, at a $2 CPM is what you really want the rate."
    },
    {
      "start": 489.42,
      "end": 496.42,
      "text": "If you need low end $2, high end $3, maybe you can go a little lower than $2 that higher end deals with like five to 10 K a month."
    },
    {
      "start": 496.42,
      "end": 501.42,
      "text": "However, generally speaking for you guys need, it's going to be a $2 CPM high end 3,"
    },
    {
      "start": 501.42,
      "end": 504.42,
      "text": "or else you're going to be eating in your margins, probably losing money."
    },
    {
      "start": 504.42,
      "end": 508.42,
      "text": "So if you look at Jeremiah, right, he has..."
    },
    {
      "start": 508.42,
      "end": 513.4200000000001,
      "text": "Right, roughly quarter million views."
    },
    {
      "start": 513.4200000000001,
      "end": 517.4200000000001,
      "text": "So I would go to him, I'll offer you $2,500 for 1.2 million views."
    },
    {
      "start": 517.4200000000001,
      "end": 520.4200000000001,
      "text": "Right? He'd be like, oh, this is sick."
    },
    {
      "start": 520.4200000000001,
      "end": 524.4200000000001,
      "text": "He'll probably bite on that because we can offer him a retainer and we're pitching a long term deal here."
    },
    {
      "start": 524.4200000000001,
      "end": 528.4200000000001,
      "text": "We're not pitching him, hey, I want to do one post or I want to do one month."
    },
    {
      "start": 528.4200000000001,
      "end": 533.4200000000001,
      "text": "We're pitching him like, hey, we want to work with our creators six months, 12 months, 18 months, et cetera."
    },
    {
      "start": 533.42,
      "end": 540.42,
      "text": "Now, contracts for you over the next section are going to be structured in a way where you protect yourself and you clip that thing month one."
    },
    {
      "start": 540.42,
      "end": 544.42,
      "text": "Number two, another way to protect yourself is you'll pay a certain percentage up front."
    },
    {
      "start": 544.42,
      "end": 549.42,
      "text": "So usually pay up to 20 to 40% depending on the creator and what they want up front."
    },
    {
      "start": 549.42,
      "end": 551.42,
      "text": "So therefore you're protecting yourself on the downside."
    },
    {
      "start": 551.42,
      "end": 555.42,
      "text": "So if they only post three videos, you get an ROI and that 20% paid up front."
    },
    {
      "start": 555.42,
      "end": 557.42,
      "text": "And if they don't post, they don't hit their beauty guarantee."
    },
    {
      "start": 557.42,
      "end": 559.42,
      "text": "You don't pay them the rest of the videos."
    },
    {
      "start": 559.42,
      "end": 561.42,
      "text": "And that's very clearly outlined in the contract."
    },
    {
      "start": 561.42,
      "end": 564.42,
      "text": "And so the next thing is now you've got this structure."
    },
    {
      "start": 564.42,
      "end": 567.42,
      "text": "You know many views are getting, you don't need to usually want from them per month."
    },
    {
      "start": 567.42,
      "end": 568.42,
      "text": "You know me videos, they're posting."
    },
    {
      "start": 568.42,
      "end": 571.42,
      "text": "Okay. Now you're like, all right, I got to approach this call."
    },
    {
      "start": 571.42,
      "end": 572.42,
      "text": "How the fuck am I going to close them?"
    },
    {
      "start": 572.42,
      "end": 574.42,
      "text": "I've never done a sales call."
    },
    {
      "start": 574.42,
      "end": 578.42,
      "text": "I don't know what's the fucking word."
    },
    {
      "start": 580.42,
      "end": 582.42,
      "text": "Skill set and sales will call it."
    },
    {
      "start": 582.42,
      "end": 583.42,
      "text": "But guys, this isn't very hard."
    },
    {
      "start": 583.42,
      "end": 586.42,
      "text": "All you have to do is be charismatic and approachable."
    },
    {
      "start": 586.42,
      "end": 587.42,
      "text": "Build rapport with them."
    },
    {
      "start": 587.42,
      "end": 588.42,
      "text": "Build trust."
    },
    {
      "start": 588.42,
      "end": 589.42,
      "text": "Like act like they're your boy."
    },
    {
      "start": 589.42,
      "end": 591.42,
      "text": "Just let me fucking talk to them."
    },
    {
      "start": 591.42,
      "end": 592.42,
      "text": "People want to be treated like humans."
    },
    {
      "start": 592.42,
      "end": 595.42,
      "text": "And so the intro of the call, I highly recommend getting to know the person."
    },
    {
      "start": 595.42,
      "end": 596.42,
      "text": "Talk into them."
    },
    {
      "start": 596.42,
      "end": 600.42,
      "text": "Don't just dive into the deal because I'm just going to feel like you're there just to suck value out of them."
    },
    {
      "start": 600.42,
      "end": 604.42,
      "text": "Which we are, but you want to build a relationship."
    },
    {
      "start": 604.42,
      "end": 606.42,
      "text": "We've relationship with all of our creators."
    },
    {
      "start": 606.42,
      "end": 607.42,
      "text": "Like we can text them."
    },
    {
      "start": 607.42,
      "end": 609.42,
      "text": "Like a text fucking Jeremiah right now or call me to respond."
    },
    {
      "start": 609.42,
      "end": 611.42,
      "text": "Now the second thing is concern."
    },
    {
      "start": 611.42,
      "end": 612.42,
      "text": "Confirm that it's a fit."
    },
    {
      "start": 612.42,
      "end": 614.42,
      "text": "Make sure that they're comfortable posting your content."
    },
    {
      "start": 614.42,
      "end": 618.42,
      "text": "You've already looked at their contents and you know it'll fit with your product."
    },
    {
      "start": 618.42,
      "end": 621.42,
      "text": "So you kind of know this, but you're basically having them tell you it fits."
    },
    {
      "start": 621.42,
      "end": 624.42,
      "text": "They're confirming for you like, hey, yeah, this works really well with my audience."
    },
    {
      "start": 624.42,
      "end": 625.42,
      "text": "They love this."
    },
    {
      "start": 625.42,
      "end": 629.42,
      "text": "This isn't feel salesy like piss of pitching like fucking sell seats or some large company."
    },
    {
      "start": 629.42,
      "end": 631.42,
      "text": "And no one gives a shit about anymore."
    },
    {
      "start": 631.42,
      "end": 632.42,
      "text": "It's another more comfortable."
    },
    {
      "start": 632.42,
      "end": 635.42,
      "text": "Then you present the offer like, look, hey Jeremiah, I want four videos a month."
    },
    {
      "start": 635.42,
      "end": 636.42,
      "text": "That's one video a week."
    },
    {
      "start": 636.42,
      "end": 639.42,
      "text": "The view guarantee is based off your consistent view."
    },
    {
      "start": 639.42,
      "end": 641.42,
      "text": "So this is something that you can hit and achieve."
    },
    {
      "start": 641.42,
      "end": 643.42,
      "text": "And we're not trying to fuck you on this."
    },
    {
      "start": 643.42,
      "end": 647.42,
      "text": "Now with the CPM baseline, I would highly recommend not saying we're basing this off on this."
    },
    {
      "start": 647.42,
      "end": 651.42,
      "text": "CPM, which stands for cost per million, cost per thousand views."
    },
    {
      "start": 651.42,
      "end": 654.42,
      "text": "You just say, hey, I'm going to pay $2,000 per million views."
    },
    {
      "start": 654.42,
      "end": 655.42,
      "text": "That's simple."
    },
    {
      "start": 655.42,
      "end": 656.42,
      "text": "You can say, I like that."
    },
    {
      "start": 656.42,
      "end": 657.42,
      "text": "I don't like that."
    },
    {
      "start": 657.42,
      "end": 658.42,
      "text": "He doesn't like that."
    },
    {
      "start": 658.42,
      "end": 659.42,
      "text": "And you should be like, hey man, like what do you want?"
    },
    {
      "start": 659.42,
      "end": 660.42,
      "text": "Right?"
    },
    {
      "start": 660.42,
      "end": 661.42,
      "text": "What are you thinking?"
    },
    {
      "start": 661.42,
      "end": 662.42,
      "text": "What makes this worth your time?"
    },
    {
      "start": 662.42,
      "end": 664.42,
      "text": "And then he'll give you a number."
    },
    {
      "start": 664.42,
      "end": 667.42,
      "text": "The biggest a joke objection you'll get is the view guarantee."
    },
    {
      "start": 667.42,
      "end": 668.42,
      "text": "Right?"
    },
    {
      "start": 668.42,
      "end": 670.42,
      "text": "So it would be like, I don't want to do a view guarantee because I don't want to hit the views."
    },
    {
      "start": 670.42,
      "end": 674.42,
      "text": "And you simply say, look, we base this off of your content."
    },
    {
      "start": 674.42,
      "end": 677.42,
      "text": "You post two times a day, you get these views."
    },
    {
      "start": 677.42,
      "end": 678.42,
      "text": "So you're going to hit this."
    },
    {
      "start": 678.42,
      "end": 681.42,
      "text": "And it's your job to get views, our job to convert those views."
    },
    {
      "start": 681.42,
      "end": 682.42,
      "text": "Right?"
    },
    {
      "start": 682.42,
      "end": 687.42,
      "text": "So we can't make a, we can't cover our bottom line costs and anything, let's be get paid through conversions,"
    },
    {
      "start": 687.42,
      "end": 689.42,
      "text": "which the influence or brings."
    },
    {
      "start": 689.42,
      "end": 692.42,
      "text": "And so now they're more comfortable because they're like, oh shit, like I'm going to get them views"
    },
    {
      "start": 692.42,
      "end": 694.42,
      "text": "and then I'm going to get paid for getting views."
    },
    {
      "start": 694.42,
      "end": 699.42,
      "text": "Instead of just being a one off deal from fucking dick sporting goods for 5K, they get like once a year."
    },
    {
      "start": 699.42,
      "end": 702.42,
      "text": "Now, now this has been said, they're comfortable."
    },
    {
      "start": 702.42,
      "end": 704.42,
      "text": "You close them basically. They're ready."
    },
    {
      "start": 704.42,
      "end": 706.42,
      "text": "They're like, I'm in Connor, right? Let's go."
    },
    {
      "start": 706.42,
      "end": 708.42,
      "text": "Hands down."
    },
    {
      "start": 708.42,
      "end": 709.42,
      "text": "What you want to do is in schedule follow up."
    },
    {
      "start": 709.42,
      "end": 712.42,
      "text": "So generally, I schedule follow up, review the contract."
    },
    {
      "start": 712.42,
      "end": 716.42,
      "text": "I follow the text saying, like here's what we spoke about, just confirming."
    },
    {
      "start": 716.42,
      "end": 719.42,
      "text": "I will send the contract, please send me your email."
    },
    {
      "start": 719.42,
      "end": 724.42,
      "text": "And so generally, they call, like as long as you set expectations, confirm they're a fit and they tell you they're a fit."
    },
    {
      "start": 724.42,
      "end": 728.42,
      "text": "They understand that they're posting four videos a month once a week."
    },
    {
      "start": 728.42,
      "end": 731.42,
      "text": "Maybe you can pick a day that they post and you follow up."
    },
    {
      "start": 731.42,
      "end": 734.42,
      "text": "They understand the retainer deal structure and they're line up pricing."
    },
    {
      "start": 734.42,
      "end": 737.42,
      "text": "You're done. It's closed. Done deal. Game over."
    },
    {
      "start": 737.42,
      "end": 739.42,
      "text": "All right."
    },
    {
      "start": 739.42,
      "end": 743.42,
      "text": "If they're not ready, whether it's because it's too high of a budget, you don't have the money for them, etc."
    },
    {
      "start": 743.42,
      "end": 747.42,
      "text": "I would honestly just stay in touch with them. Follow up with them every couple of weeks."
    },
    {
      "start": 747.42,
      "end": 749.42,
      "text": "We're having to think about it. Schedule call."
    },
    {
      "start": 749.42,
      "end": 751.42,
      "text": "If I can't not ready, you need to figure some things out."
    },
    {
      "start": 751.42,
      "end": 756.42,
      "text": "Let's schedule call on two, three days. Let's put it on the calendar and we'll talk then."
    },
    {
      "start": 756.42,
      "end": 759.42,
      "text": "What I said about the view guarantee, I usually pitch this."
    },
    {
      "start": 759.42,
      "end": 763.42,
      "text": "As I said, you say for a million views a month, we'll pay $2,000."
    },
    {
      "start": 763.42,
      "end": 767.42,
      "text": "I wouldn't say to $2 a CPM. You don't need to use a link that could confuse them."
    },
    {
      "start": 767.42,
      "end": 772.42,
      "text": "And then you just tell them, look, we're paying you for getting views and we're going to convert those views for a long term partnership."
    },
    {
      "start": 772.42,
      "end": 775.42,
      "text": "It's very fruitful for both of us."
    },
    {
      "start": 775.42,
      "end": 781.42,
      "text": "As I noted, their jobs give you, your job is convert those views. You can be very polite when you say that."
    },
    {
      "start": 781.42,
      "end": 785.42,
      "text": "You're really just pitching that to mutual benefit."
    },
    {
      "start": 785.42,
      "end": 788.42,
      "text": "When it comes to objections and responses, usually they say like, hey, I usually say,"
    },
    {
      "start": 788.42,
      "end": 791.42,
      "text": "I usually get paid five grand per per post, Blake was saying."
    },
    {
      "start": 791.42,
      "end": 796.42,
      "text": "These guys have been the issue for a while. You see a paid fucking so much money for doing nothing."
    },
    {
      "start": 796.42,
      "end": 799.42,
      "text": "These fucking companies are retarded. Now the game is you want views."
    },
    {
      "start": 799.42,
      "end": 803.42,
      "text": "I can pay you five knowledge per post. That's two grand."
    },
    {
      "start": 803.42,
      "end": 805.42,
      "text": "I need a million views. I can get you quarter million views."
    },
    {
      "start": 805.42,
      "end": 811.42,
      "text": "That's worth $500 to $750. It's not a good fit. You move on."
    },
    {
      "start": 811.42,
      "end": 819.42,
      "text": "You're doing so much outreach. You're going to have tens of 20, 30, 40 creators responding every single day as you send 100 DMs a day."
    },
    {
      "start": 819.42,
      "end": 822.42,
      "text": "So generally, just work backwards, work with them, be understanding."
    },
    {
      "start": 822.42,
      "end": 828.42,
      "text": "When it comes to the view guarantee, I would just basically say, hey, your job is to get views consistently."
    },
    {
      "start": 828.42,
      "end": 833.42,
      "text": "Our job is to pay you. And this view guarantee is based off what you already average or views wise. So it's achievable."
    },
    {
      "start": 833.42,
      "end": 837.42,
      "text": "We're not asking for you an unrealistic ask and try to fuck you."
    },
    {
      "start": 838.42,
      "end": 844.42,
      "text": "And if they don't hit the view guarantee, you structure your contracts to basically say they're going to keep posting to hit it or you pro rated."
    },
    {
      "start": 844.42,
      "end": 849.42,
      "text": "So for example, if they get 800,000 views and they need a million, they can just post again to hit that."
    },
    {
      "start": 849.42,
      "end": 853.42,
      "text": "And then you pay them after they post that fifth video or say they get half million views and just get a million."
    },
    {
      "start": 853.42,
      "end": 857.42,
      "text": "You can be like, all right, I'll pay you a grand and set a two grand, right? 50% of the contract."
    },
    {
      "start": 857.42,
      "end": 861.42,
      "text": "So once the rate of proceed, I recommend sending the contract same day."
    },
    {
      "start": 861.42,
      "end": 864.42,
      "text": "Get them to look at it, follow up with them, make sure they're comfortable."
    },
    {
      "start": 865.42,
      "end": 870.42,
      "text": "Get that shit signed and onboard them. Usually the onboarding, I usually set up a group chat with my team."
    },
    {
      "start": 870.42,
      "end": 873.42,
      "text": "They handle that and we're in the communications. Make sure everything goes smoothly."
    },
    {
      "start": 873.42,
      "end": 878.42,
      "text": "Or when we're starting out, I would just text them, get the contract signed, ready to go."
    },
    {
      "start": 878.42,
      "end": 881.42,
      "text": "And next is management them."
    },
    {
      "start": 881.42,
      "end": 886.42,
      "text": "So at the end of the day, like we mentioned, if they're not ready, just be understanding."
    },
    {
      "start": 886.42,
      "end": 891.42,
      "text": "Schedule a second call. If they're out of budget, just tell them, hey, we'd love to reach back out when our budget grows."
    },
    {
      "start": 891.42,
      "end": 894.42,
      "text": "To be super respectful, you don't want to burn any bridges in this industry."
    },
    {
      "start": 894.42,
      "end": 899.42,
      "text": "We did that and it kind of fucked us. We had to repair relationships because I was like, oh, no, screw you this and that."
    },
    {
      "start": 899.42,
      "end": 903.42,
      "text": "You kind of get your emotions. You drop the fucking ego and plane to their ego."
    },
    {
      "start": 903.42,
      "end": 908.42,
      "text": "Make it seem like they're getting the better end of the deal here."
    },
    {
      "start": 908.42,
      "end": 911.42,
      "text": "So once you've finished this, put them in your CRM."
    },
    {
      "start": 911.42,
      "end": 918.42,
      "text": "I recommend just setting up a Google Sheet with Info and her name, followers, links to TikTok, etc."
    },
    {
      "start": 918.42,
      "end": 923.42,
      "text": "The deal structure, right? How many videos are getting? What you're paying them? The upfront payment?"
    },
    {
      "start": 923.42,
      "end": 927.42,
      "text": "Log when you pay your first payment, your second payment. So they can track things."
    },
    {
      "start": 927.42,
      "end": 933.42,
      "text": "And then eventually, once you get over five influence, recommend using a tool like Groey, which will go over, which automatically tracks views, pays out."
    },
    {
      "start": 933.42,
      "end": 938.42,
      "text": "They handle all the documentation so you can actually write off these expenses for your business."
    },
    {
      "start": 938.42,
      "end": 942.42,
      "text": "Just the fucking cap this off. Look, be charismatic and understand."
    },
    {
      "start": 942.42,
      "end": 947.42,
      "text": "You can be confident without being a fucking dick. Don't be a fucking loser. Be soft."
    },
    {
      "start": 947.42,
      "end": 953.42,
      "text": "Get pushed around like, dude, understand this is a mutual benefit. You are helping them as well."
    },
    {
      "start": 953.42,
      "end": 958.42,
      "text": "Make sure they understand. And then you pitch it as they get the better end of the half."
    },
    {
      "start": 958.42,
      "end": 962.42,
      "text": "You're getting views. You can even set up bonus structures, which they may ask for."
    },
    {
      "start": 962.42,
      "end": 965.42,
      "text": "They may not. I don't recommend doing that off the bat unless they actually ask."
    },
    {
      "start": 965.42,
      "end": 969.42,
      "text": "And I wouldn't hard sell them because if you hard sell them, it becomes this pissing contest."
    },
    {
      "start": 969.42,
      "end": 975.42,
      "text": "And it's probably not going to lead to a deal. So at the end of the day, be charismatic."
    },
    {
      "start": 975.42,
      "end": 980.42,
      "text": "Do never talk about fucking pricing the DMs. Get them on a call, talk to them."
    },
    {
      "start": 980.42,
      "end": 983.42,
      "text": "You can go from there, like, yeah, just be human."
    },
    {
      "start": 983.42,
      "end": 989.42,
      "text": "So that is how you negotiate with influencers. Next we're going to talk about managing them, how to track them."
    },
    {
      "start": 989.42,
      "end": 993.42,
      "text": "And yeah, it's fucking get after it, boys."
    }
  ]
}