{
  "file_name": "055_Lesson_55.faudio-hi-0-Default.mp4",
  "text": " Creative time baby. Let's fucking go did the punch cuz we're excited So there are a few things to keep in mind here. This is when by the way This is when everything we've spoken about we I showed you guys how to set up your campaigns How to upload ads now? We're going to show what makes a good ad There are three key metrics that make a good ad or that like measure good ads usually are is the hook rate Click the rate and the cost per result already showed you guys the cost per result Now let's define what a hook rate and click the rate is and by the way we will be going through all of the Cali I ads for this so I'm gonna be very open and transparent. We are showing you the fucking sauce. This is tangible This was $72,000 spent in the last seven days that you're gonna learn from If 2,300 ads running that just shows you creative is king You need to be fucking testing more creative the more creatives you test the more likely you are to find winners so Click through rate click through rate is right here Generally you want above a 1% click through it. That's usually a good sign and click through it by the way is The percentage of people that CD add and then click the action button So it's either like download app or learn more install whatever the core action is the key behavior That is to click through it and you'll see Honestly, like when I scroll through here I don't see the clearest correlation where the top ones are very high and the bottom ones are low I feel like it's like you could see here. It is low These are mostly below one at the top it's a lot higher than you also have like 4.82, but this ad isn't doing that well And I say that because one the cost per result is pretty high into it's not getting a lot of money spent on it And so none of these in isolation are that good to look at to be honest The next one is cost per result. That's arguably the most important you just want I mean, yeah, it's in my opinion the most important the lower the cost per result is the more profitable The ad is for you or the Yeah, the lower the lower the cost per result is the more profitable and Then you want to look at the hook rate the hook rate is I think define yet the first three seconds How many people last the first three seconds divided by impressions and This is actually custom metric so to create a custom metric you have to customize columns you have to You have to custom create custom metric hook rate Like three three seconds watched divided by impressions and What you want to do is Actually, let's see let's see what we had before At it Okay Three second view plays divided by impressions you just take the formula. Okay Hook rate What is it three three second whoa three second video plays divided by impressions and You want it as a percentage How great to Boom now look great to let's just confirm it matches the actual hook rate. Yeah, it does so we created it correctly So that's what you want to do to actually create the hook rate I'm just gonna delete mine because we do not need it Do not need to This is what I mean guys by like I didn't create this metric we hired someone to do it Marcus. He's a killer so Eventually you're gonna get to a point where you don't know worry about any of this stuff You'll just start doing things and then and then you'll hire someone if you really don't want to overcomicate this I would say only worry about cost per result that's bottom line all that matters that you have a good cost per result but the hook rate and the And the click through it is a good way to iterate on your creatives figure out okay What is working well what is hooking the users in? Generally there is a correlation here where the better the video is doing and by the way It's ranked from best horse if you couldn't tell already the better the video is doing the higher the hook rate you could see it Starts to drop as we scroll down now we're in the 30s and we were in the 60s Okay So let's see what types of creatives are killing it for Cali There are so many different ways and so many different types of creatives that you can make The whole goal is that you want to test as many as you can we have 2,373 ads running That just shows you I know first of all not all those are actually at are actually active right now But all of those were active at one point and that should show you how much testing It needs to go into this in order to really find success It's not gonna take 2000 to find one successful ad But if you want to really scale this up to spending half a million dollars a month on paid ads like we are profitably Then you need to be testing more creative is king the more creatives you test the more winners you'll find And there are so many different angles You'll just want to play around with all kinds of different hooks Like going back to that virality module in the beginning of this distribution course You want to use some of those you will want to Pay use influencer videos as actually ads. That's a big part of our strategy So in the contract you want to make sure that they sign away the rights for you to reuse it as an ad and You'll want to just start Testing as much as you can let's see what's working well for Cali This is our best performing ad we spent 10k in the last week And let's see what it was he's 18 years old It uses AI to count calories based on the food on your plate Cali eyes an app where you can track the calories you're eating just by taking a picture of your food I'm just taking a picture right now of my lunch Scan load and result. It's at 400 calories in this role. It picked up sushi rice salmon avocados spicy mayo sauce Cal AI registers 90% accuracy So that was just a cut of these 18 years ago There's a lot of social profere because it was on CBS news and that definitely helped and then I it was a live demonstration There's also this factor like some you have to lean into your strengths We paired two viral stories together one. It's it's viral that there's an app where you could take a picture of your food and it tells you the calories That's unprecedented now it's something where a lot of people maybe it's a less surprising because AI technology is getting better and better And a lot of people have heard about Cali eye apps where you could just take a picture of your food and get the calories However, it wasn't something you would imagine like a year ago But on top of that we paired it with my story the founder story that I'm 18 years old And I built an app that is making millions of dollars. That's viral that gets people watching And then they're like wow this team he built this app and I'm gonna get it. It's a cool app So you got to hook them in somehow In years old it uses AI to count calories First thing that said it is about me not the app. He's 18 years old Keep that in mind Second video this is the this is actually one of our influencers who Let's see For 12 short 10 minute 12 12 second video One of our influencers. I don't think we did any editing to this he posted it and It didn't go that viral on his own account But we're running it as an ad and getting a massive ROI on however much we paid him for it We're getting such a bigger term His ad it's super high-converting What we did here is wanted to hook It's like him working out you must eat so strict in quotes So the viewer knows oh does he not eat strict? How does he stay so lean them? And then it shows you the It gets straight to the point of what the app does it doesn't show oh first sign up for the app type in your name onboard and go through Take a picture it it goes straight into take a picture Picture load results for Cali. These are the three sequential screens that Explain what the app does in a really succinct way and shows the value proposition If you could figure that out for your app you'll be in a very good position before your ad creatives So So you'll see there are a lot of news ads that were just caught up of me I went on the news a lot and these news ads are honestly ripping. They're doing really good Cal AI a tractor calorie intake using artificial intelligence It's also one of the top health and fitness apps in apples app store It wasn't sustainable for my lifestyle to type in everything I was By the way about this already cut off the video I was the producer right before I went on the news segment told me my lights had a glare So I turned them off and I turned on these Lights in front of me instead, which I thought would look a lot better But it just made me look scary like look at this bro my entire room is tarth and I'm like a little figure But it's one of our best performing ads. So I don't know maybe there's something there Is eating so along with one of my co-founders We hypothesize that we could build an app where you could just take a picture of your food And then it will tell you the calories and macros of what you're eating the app has grown extraordinarily fast in just the last 12 months We have achieved more than 6 million downloads and the app is on track to make more than 30 million dollars over the next year I We do AI a traction So a bunch of other news ads that I'm going to skip because they're all like the same thing maybe just different slightly different clips me on different channels See This is another influencer if you want to go from looking like this to that All I did was a calorie deficit and the best way to make sure you're in that deficit is to track your calories Something like calorie eye here helps you track everything accurately by just taking pictures of what you eat That's what you don't got to worry about what you're eating and how much of it If you want to go to the video really well showing you before and after showing that's more of a UGC type video user generated content He himself is an influencer, but you get whether he's not that famous So whether he has a following or not a didn't really affect the views It's more that it was an authentic person giving their review of the app showing how it works for them showing he shows proof he shows how he went from very overweight to having a six-pack Okay, this one was more heavily edited by our editor and let's see what happens You This is just simple and straight to the point I'm honestly surprised that ad is doing that well. It's pretty impressive. How well it's doing What was it? There's this one. Yeah, it's doing pretty good getting a lot of ad spend behind it So So that's getting straight to the point that works News ads Let's see this one curious. Don't know what it is Okay, same guy that showed the transformation before Another transformation Oh Notice that it's hook and the hook is unrelated to the app and then it shows the app Not everything needs to be about your app. So don't get too caught up you could show it at the end and it could work Right now we're doing some experiments working with Michael churn out it's pretty famous or pretty popular guy if you're still using my fitness pal or your notes app to track your food You're wasting your time Calais and AI powered calorie tracking app that tells you the macros in your meals just by snapping a picture It's really that simple guys point your phone take a photo and in seconds you get protein carbs and fats everything It's so easy my kids have even started using it. I used to log every ingredient manually now It's just one photo and I'm done look if you're trying to eat cleaner lose weight or just tracks smarter check out cal ai There's a free trial and it's honestly a no-brainer if you're still using my fit So that one was definitely a little bit higher quality than most of our ads and Looking at this right now. It looks like it's not actually profitable at the moment this ad is early on So we're gonna see if it becomes profitable. It's getting a lot of spend, but not profitable We'll see if it turns around It actually you know what there's a chance it's profitable usually I say it's not profitable because the cost per result usually profitable for us is when the cost per results like under 20 dollars But this is over However, Michael turn out as an influencer that usually targets older audiences and so because of that it's possible that this ad is profitable And we could actually see the age demographic breakdown I think of his ad I'm basically what I'm saying is if he's targeting older audience they might be more likely to convert they might have a higher ltv Okay, so 35 to 44 It's 24 the average age. Okay, versus this ad Which is So Mostly younger so it is it is definitely hitting an older audience and it's possibly profitable So okay, let's watch like one more You I just Spanish ad to be honest. I don't know what it says, but it's working for our Spanish campaign You know you don't need to worry about Spanish for now Here's another one. I don't count calories. It takes too long and that shows Solving the problem because that was so similar you can make this in 30 minutes or less like probably like Two minutes if you're just grinding it out something else I want to go over is A static ad so this is when you just have an image And you can do something like we try the best calorie chakras here's our favorite And then you click learn more it takes you to the app or website or whatever So these static ads can actually work pretty well if some some company is heavily rely on them Others heavily rely on video for elsewhere mostly video oriented And just starting statics it looks like it's Not it's likely not profitable right now most of our statics look like they're not doing that good For apps honestly videos are probably the way to go But yeah, so we just have a lot of stuff here Let's look at some ads of some other apps So like I said before you could just go to the meta ad library all ads Facebook ad library Then you could start looking up stuff. So like opal cool cool app Cool ads Some text on the screen I've seen some really high quality opal ads. I wonder if I could find one I I'm seeing This is one of the best ads I've seen in a while It makes you feel very uncomfortable And that's the whole point of this ad because if you feel uncomfortable The jobs are high as you come come on pre so you can try it out for yourself You are the human but here you treat it like catalysts and data You've been reduced from a lot of people will picture on the planet who pair of eyeballs and a thumb This is by design Why do you think every single social media company created their own vertical video black Because it's insanely fucking addictive the college persuasive technology But it's in slatement four hours on your phone Well, like 10 years of your life Gone and what are you getting in return? It was never meant to be this way I was the bicycle of the mind men's take us further than we've ever been before The harness fire went to the moon There's all of them but the no smarter than you without a fucking title You've been given one chance to play this game of life and they're trying to trap you Here So this obviously isn't the actual ad this was a TikTok of a guy reacting to it But this ad I remember seeing it Before like it just came up naturally on my four-upage And it it called my attention. It's a very cool ad cinematic ads like that can work really well There is a trade-off where like we I showed that ad where someone just took a picture of an apple one of our best performing ads Ever that took 30 minutes or less whereas this probably took hours tens of hours maybe even a hundred hours And you don't know if it's going to be profitable at the end of the day you could spend we actually spent like 20k on an ad And it just wasn't wasn't profitable. We tried to do a really high quality one just was not profitable To be fair actually that ad we did it was a TV ad So it was very different than what we're going through right now. We were just dabbling in TV Not something you guys need to worry about right now You'll get there soon enough if you really have what it takes we'll see Our entrepreneur is born or can they be created? I don't know. I was actually thinking about this recently And I think I've came to an answer. I think that it's a lot of nature versus nurture where I think most of being an entrepreneur is nurture It's like risk tolerance a bunch of other things that all are affected when you're young for example risk tolerance If you are rewarded for taking risks when you're younger versus if you are It's opposite of rewarded like Um opposite word or punish I guess Antony You Okay, maybe there isn't a good one but punished as a kid Entrepreneurs naturally like everyone knows they have a high risk tolerance. They take a lot of risks most of them do at least And that's something that if you're younger you develop a low risk tolerance I think you could break that habit when you're older. It's just difficult to The longer you go before starting your entrepreneurial your entrepreneurial journey The harder I think it will be to get in the right mindset because there are some traits that are very necessary Um, I'd say the main ones are grit. It's just being willing to fail over and over and over again as you're watching this just Don't think you're gonna watch this and even though we've done this so many times we're giving you Spoon feeding you the secrets don't think you're gonna get it on your first time You're probably going to fail for your first couple of apps until one finally takes off and when that one takes off It's gonna blow up past any of your expectations if you stay in it I honestly was thinking about this the other day. I used to say when I was a like I mean I was give that to say when I was a kid, but I guess a lot of people look at me as a kid now, but I'm 18. I'm not a kid, but but I used to think I'm gonna be an entrepreneur or die trying. I don't want to work at 9 to 5 And I thought about this yesterday. I was like this kind of retarded like I think genuinely Anyone can find success as an entrepreneur. It's just a matter of trying enough things like you will It's almost impossible not to if you just don't give up because there's so much money to be made So many industries that are untapped people are making money off the dumbest things. I know people who are making six figures a year That literally just book restaurants seats in advance and then sell them as it gets close to the day There is so much money to be made in the world people just don't realize that Back to the point of this yet, so go through the ad library search up your favorite apps See if we get some any other cool ones I Don't invest is actually really cool popcorn. They aren't some nice news ads Would you sell your ownership in this particular app for a hundred million dollars you post? Oh definitely not definitely not a billion Definitely not So you want to refuse to walk away from this no matter what I want to welcome this for the rest of my life And I think the mission that we're trying to bring is we're really writing the investing playbook If you send Americans are not participating in the greatest world creation engine of our time to stop more than capitalism I know Steven the demand is pretty cr... I love him We've been out to dinner a bunch of times. This is a great guy. That is definitely cap He would sell his shares for a billion dollars if he won't then it's very commendable Maybe he cares about his company more than I think But now you got to say some extreme stuff for good ad creatives He actually told me it's funny. He goes on when he goes on ads when he when he goes on TV live TV He'll have a few lines ready that they know will work well for the paid ad and then they'll clip up these specific parts So that's what I started doing too when I go on these tv ads. I'll try some things something I actually did the last time I went on TV. I don't know if we tried it as an ad yet But I work two watches one on each wrist hoping that it's going to rage bait people in the comments To write like why the fuck is he wearing two watches that founder what a loser bubble up Because engagement on paid ads actually helps you get more and more reach just like on an organic post It will lower the cost per Person that sees it generally generally if you get good engagement Okay So feel free to just go around look through This slide goes through creatives pretty well I hope you have some good takeaways Mm, I got to relax now I'm tired. Did a lot of recording today Yeah, you guys got this you don't need me fucking just lock in This is some music spend like I know a lot of people that will spend One day a week and that whole day is just dedicated to making ad creatives They'll upload them they'll let them run for a week and they'll have a new battery like the next day of the week to put in Go have one filming day and then one uploading day the upload like 50 creatives every single week You don't need to do that at this scale, but like when you start scaling up 50 creatives a week is An ambitious goal. It's a good place to be that's when you'll start making millions of dollars among Cool I think that's actually everything for the traditional pay. It's not everything. Okay I'll see you guys in the next module",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 4.0,
      "text": "Creative time baby. Let's fucking go did the punch cuz we're excited"
    },
    {
      "start": 4.28,
      "end": 8.94,
      "text": "So there are a few things to keep in mind here. This is when by the way"
    },
    {
      "start": 9.56,
      "end": 15.76,
      "text": "This is when everything we've spoken about we I showed you guys how to set up your campaigns"
    },
    {
      "start": 16.48,
      "end": 20.16,
      "text": "How to upload ads now? We're going to show what makes a good ad"
    },
    {
      "start": 20.84,
      "end": 26.64,
      "text": "There are three key metrics that make a good ad or that like measure good ads usually are is the hook rate"
    },
    {
      "start": 27.12,
      "end": 31.28,
      "text": "Click the rate and the cost per result already showed you guys the cost per result"
    },
    {
      "start": 31.96,
      "end": 39.6,
      "text": "Now let's define what a hook rate and click the rate is and by the way we will be going through all of the Cali I ads for this so"
    },
    {
      "start": 40.2,
      "end": 44.56,
      "text": "I'm gonna be very open and transparent. We are showing you the fucking sauce. This is tangible"
    },
    {
      "start": 44.68,
      "end": 49.16,
      "text": "This was $72,000 spent in the last seven days that you're gonna learn from"
    },
    {
      "start": 49.519999999999996,
      "end": 54.5,
      "text": "If 2,300 ads running that just shows you creative is king"
    },
    {
      "start": 54.5,
      "end": 59.76,
      "text": "You need to be fucking testing more creative the more creatives you test the more likely you are to find winners"
    },
    {
      "start": 61.22,
      "end": 63.22,
      "text": "so"
    },
    {
      "start": 63.9,
      "end": 67.74,
      "text": "Click through rate click through rate is right here"
    },
    {
      "start": 68.86,
      "end": 74.3,
      "text": "Generally you want above a 1% click through it. That's usually a good sign and click through it by the way is"
    },
    {
      "start": 75.14,
      "end": 79.26,
      "text": "The percentage of people that CD add and then click the action button"
    },
    {
      "start": 79.26,
      "end": 85.98,
      "text": "So it's either like download app or learn more install whatever the core action is the key behavior"
    },
    {
      "start": 86.34,
      "end": 89.66000000000001,
      "text": "That is to click through it and you'll see"
    },
    {
      "start": 90.22,
      "end": 92.46000000000001,
      "text": "Honestly, like when I scroll through here"
    },
    {
      "start": 92.46000000000001,
      "end": 97.04,
      "text": "I don't see the clearest correlation where the top ones are very high and the bottom ones are low"
    },
    {
      "start": 97.04,
      "end": 100.82000000000001,
      "text": "I feel like it's like you could see here. It is low"
    },
    {
      "start": 100.82000000000001,
      "end": 104.86000000000001,
      "text": "These are mostly below one at the top it's a lot higher than you also have like"
    },
    {
      "start": 105.82000000000001,
      "end": 108.10000000000001,
      "text": "4.82, but this ad isn't doing that well"
    },
    {
      "start": 108.97999999999999,
      "end": 115.05999999999999,
      "text": "And I say that because one the cost per result is pretty high into it's not getting a lot of money spent on it"
    },
    {
      "start": 115.82,
      "end": 119.69999999999999,
      "text": "And so none of these in isolation are that good to look at to be honest"
    },
    {
      "start": 121.17999999999999,
      "end": 125.13999999999999,
      "text": "The next one is cost per result. That's arguably the most important you just want"
    },
    {
      "start": 125.13999999999999,
      "end": 131.01999999999998,
      "text": "I mean, yeah, it's in my opinion the most important the lower the cost per result is the more profitable"
    },
    {
      "start": 131.62,
      "end": 133.82,
      "text": "The ad is for you or the"
    },
    {
      "start": 134.42,
      "end": 138.38,
      "text": "Yeah, the lower the lower the cost per result is the more profitable and"
    },
    {
      "start": 140.66,
      "end": 148.85999999999999,
      "text": "Then you want to look at the hook rate the hook rate is I think define yet the first three seconds"
    },
    {
      "start": 149.06,
      "end": 153.26,
      "text": "How many people last the first three seconds divided by impressions and"
    },
    {
      "start": 154.01999999999998,
      "end": 159.94,
      "text": "This is actually custom metric so to create a custom metric you have to customize columns"
    },
    {
      "start": 160.9,
      "end": 162.9,
      "text": "you have to"
    },
    {
      "start": 163.82,
      "end": 165.82,
      "text": "You have to"
    },
    {
      "start": 167.45999999999998,
      "end": 169.94,
      "text": "custom create custom metric"
    },
    {
      "start": 173.14,
      "end": 175.14,
      "text": "hook rate"
    },
    {
      "start": 175.98,
      "end": 177.98,
      "text": "Like"
    },
    {
      "start": 177.98,
      "end": 182.98,
      "text": "three three seconds watched divided by impressions and"
    },
    {
      "start": 185.42,
      "end": 187.42,
      "text": "What you want to do is"
    },
    {
      "start": 188.14,
      "end": 191.38,
      "text": "Actually, let's see let's see what we had before"
    },
    {
      "start": 192.26,
      "end": 194.26,
      "text": "At it"
    },
    {
      "start": 194.26,
      "end": 196.1,
      "text": "Okay"
    },
    {
      "start": 196.1,
      "end": 200.82,
      "text": "Three second view plays divided by impressions you just take the formula. Okay"
    },
    {
      "start": 203.98,
      "end": 205.98,
      "text": "Hook rate"
    },
    {
      "start": 207.54,
      "end": 214.22,
      "text": "What is it three three second whoa three second video plays"
    },
    {
      "start": 215.66,
      "end": 218.14,
      "text": "divided by impressions and"
    },
    {
      "start": 219.14,
      "end": 221.14,
      "text": "You want it as a percentage"
    },
    {
      "start": 224.73999999999998,
      "end": 226.73999999999998,
      "text": "How great to"
    },
    {
      "start": 226.73999999999998,
      "end": 233.61999999999998,
      "text": "Boom now look great to let's just confirm it matches the actual hook rate. Yeah, it does so we created it correctly"
    },
    {
      "start": 233.61999999999998,
      "end": 237.01999999999998,
      "text": "So that's what you want to do to actually create the hook rate"
    },
    {
      "start": 238.54,
      "end": 241.33999999999997,
      "text": "I'm just gonna delete mine because we do not need it"
    },
    {
      "start": 243.5,
      "end": 245.5,
      "text": "Do not need to"
    },
    {
      "start": 246.5,
      "end": 252.42,
      "text": "This is what I mean guys by like I didn't create this metric we hired someone to do it Marcus. He's a killer"
    },
    {
      "start": 252.7,
      "end": 253.94,
      "text": "so"
    },
    {
      "start": 253.94,
      "end": 257.06,
      "text": "Eventually you're gonna get to a point where you don't know worry about any of this stuff"
    },
    {
      "start": 257.06,
      "end": 262.5,
      "text": "You'll just start doing things and then and then you'll hire someone if you really don't want to overcomicate this"
    },
    {
      "start": 262.5,
      "end": 269.22,
      "text": "I would say only worry about cost per result that's bottom line all that matters that you have a good cost per result but the hook rate and the"
    },
    {
      "start": 270.22,
      "end": 276.02000000000004,
      "text": "And the click through it is a good way to iterate on your creatives figure out okay"
    },
    {
      "start": 277.3,
      "end": 279.90000000000003,
      "text": "What is working well what is hooking the users in?"
    },
    {
      "start": 281.18,
      "end": 285.54,
      "text": "Generally there is a correlation here where the better the video is doing and by the way"
    },
    {
      "start": 285.54,
      "end": 291.26000000000005,
      "text": "It's ranked from best horse if you couldn't tell already the better the video is doing the higher the hook rate you could see it"
    },
    {
      "start": 291.66,
      "end": 295.92,
      "text": "Starts to drop as we scroll down now we're in the 30s and we were in the 60s"
    },
    {
      "start": 296.94000000000005,
      "end": 298.94000000000005,
      "text": "Okay"
    },
    {
      "start": 299.5,
      "end": 302.82000000000005,
      "text": "So let's see what types of creatives are killing it for Cali"
    },
    {
      "start": 303.3,
      "end": 308.18,
      "text": "There are so many different ways and so many different types of creatives that you can make"
    },
    {
      "start": 308.46000000000004,
      "end": 316.02000000000004,
      "text": "The whole goal is that you want to test as many as you can we have 2,373 ads running"
    },
    {
      "start": 317.14000000000004,
      "end": 323.18,
      "text": "That just shows you I know first of all not all those are actually at are actually active right now"
    },
    {
      "start": 323.18,
      "end": 328.26000000000005,
      "text": "But all of those were active at one point and that should show you how much testing"
    },
    {
      "start": 328.26,
      "end": 332.02,
      "text": "It needs to go into this in order to really find success"
    },
    {
      "start": 332.34,
      "end": 335.14,
      "text": "It's not gonna take 2000 to find one successful ad"
    },
    {
      "start": 335.14,
      "end": 341.21999999999997,
      "text": "But if you want to really scale this up to spending half a million dollars a month on paid ads like we are profitably"
    },
    {
      "start": 341.94,
      "end": 349.06,
      "text": "Then you need to be testing more creative is king the more creatives you test the more winners you'll find"
    },
    {
      "start": 350.65999999999997,
      "end": 352.34,
      "text": "And there are so many different angles"
    },
    {
      "start": 352.58,
      "end": 355.78,
      "text": "You'll just want to play around with all kinds of different hooks"
    },
    {
      "start": 356.5,
      "end": 361.06,
      "text": "Like going back to that virality module in the beginning of this distribution course"
    },
    {
      "start": 361.61999999999995,
      "end": 364.82,
      "text": "You want to use some of those you will want to"
    },
    {
      "start": 366.17999999999995,
      "end": 370.97999999999996,
      "text": "Pay use influencer videos as actually ads. That's a big part of our strategy"
    },
    {
      "start": 371.21999999999997,
      "end": 376.82,
      "text": "So in the contract you want to make sure that they sign away the rights for you to reuse it as an ad and"
    },
    {
      "start": 378.82,
      "end": 380.82,
      "text": "You'll want to just start"
    },
    {
      "start": 381.14,
      "end": 384.98,
      "text": "Testing as much as you can let's see what's working well for Cali"
    },
    {
      "start": 386.09999999999997,
      "end": 389.62,
      "text": "This is our best performing ad we spent 10k in the last week"
    },
    {
      "start": 390.98,
      "end": 393.86,
      "text": "And let's see what it was he's 18 years old"
    },
    {
      "start": 394.02,
      "end": 398.1,
      "text": "It uses AI to count calories based on the food on your plate"
    },
    {
      "start": 398.65999999999997,
      "end": 404.65999999999997,
      "text": "Cali eyes an app where you can track the calories you're eating just by taking a picture of your food"
    },
    {
      "start": 404.65999999999997,
      "end": 407.53999999999996,
      "text": "I'm just taking a picture right now of my lunch"
    },
    {
      "start": 407.86,
      "end": 420.1,
      "text": "Scan load and result. It's at 400 calories in this role. It picked up sushi rice salmon avocados spicy mayo sauce Cal AI registers 90% accuracy"
    },
    {
      "start": 422.1,
      "end": 424.1,
      "text": "So that was just a cut of these 18 years ago"
    },
    {
      "start": 425.14000000000004,
      "end": 432.02000000000004,
      "text": "There's a lot of social profere because it was on CBS news and that definitely helped and then I it was a live demonstration"
    },
    {
      "start": 433.14000000000004,
      "end": 436.98,
      "text": "There's also this factor like some you have to lean into your strengths"
    },
    {
      "start": 437.94,
      "end": 444.5,
      "text": "We paired two viral stories together one. It's it's viral that there's an app where you could take a picture of your food and it tells you the calories"
    },
    {
      "start": 444.5,
      "end": 451.14000000000004,
      "text": "That's unprecedented now it's something where a lot of people maybe it's a less surprising because AI technology is getting better and better"
    },
    {
      "start": 451.14000000000004,
      "end": 455.38,
      "text": "And a lot of people have heard about Cali eye apps where you could just take a picture of your food and get the calories"
    },
    {
      "start": 455.94,
      "end": 460.58000000000004,
      "text": "However, it wasn't something you would imagine like a year ago"
    },
    {
      "start": 461.06,
      "end": 465.94,
      "text": "But on top of that we paired it with my story the founder story that I'm 18 years old"
    },
    {
      "start": 466.1,
      "end": 471.78,
      "text": "And I built an app that is making millions of dollars. That's viral that gets people watching"
    },
    {
      "start": 471.78,
      "end": 476.34,
      "text": "And then they're like wow this team he built this app and I'm gonna get it. It's a cool app"
    },
    {
      "start": 476.82,
      "end": 478.82,
      "text": "So you got to hook them in somehow"
    },
    {
      "start": 478.82,
      "end": 482.26,
      "text": "In years old it uses AI to count calories"
    },
    {
      "start": 482.65999999999997,
      "end": 486.26,
      "text": "First thing that said it is about me not the app. He's 18 years old"
    },
    {
      "start": 487.3,
      "end": 489.3,
      "text": "Keep that in mind"
    },
    {
      "start": 489.38,
      "end": 493.86,
      "text": "Second video this is the this is actually one of our influencers who"
    },
    {
      "start": 494.58000000000004,
      "end": 496.58000000000004,
      "text": "Let's see"
    },
    {
      "start": 509.86,
      "end": 513.3000000000001,
      "text": "For 12 short 10 minute 12 12 second video"
    },
    {
      "start": 513.78,
      "end": 517.78,
      "text": "One of our influencers. I don't think we did any editing to this he posted it and"
    },
    {
      "start": 518.4200000000001,
      "end": 520.4200000000001,
      "text": "It didn't go that viral on his own account"
    },
    {
      "start": 520.5799999999999,
      "end": 525.3,
      "text": "But we're running it as an ad and getting a massive ROI on however much we paid him for it"
    },
    {
      "start": 525.3,
      "end": 527.3,
      "text": "We're getting such a bigger term"
    },
    {
      "start": 527.38,
      "end": 529.78,
      "text": "His ad it's super high-converting"
    },
    {
      "start": 529.78,
      "end": 531.78,
      "text": "What we did here is wanted to hook"
    },
    {
      "start": 531.78,
      "end": 534.5799999999999,
      "text": "It's like him working out you must eat so strict in quotes"
    },
    {
      "start": 534.5799999999999,
      "end": 539.06,
      "text": "So the viewer knows oh does he not eat strict? How does he stay so lean them?"
    },
    {
      "start": 539.78,
      "end": 541.38,
      "text": "And then it shows you the"
    },
    {
      "start": 542.02,
      "end": 548.5799999999999,
      "text": "It gets straight to the point of what the app does it doesn't show oh first sign up for the app type in your name onboard and go through"
    },
    {
      "start": 549.5400000000001,
      "end": 552.98,
      "text": "Take a picture it it goes straight into take a picture"
    },
    {
      "start": 559.86,
      "end": 562.98,
      "text": "Picture load results for Cali. These are the three"
    },
    {
      "start": 563.5400000000001,
      "end": 565.5400000000001,
      "text": "sequential screens that"
    },
    {
      "start": 565.7800000000001,
      "end": 569.46,
      "text": "Explain what the app does in a really succinct way and shows the value proposition"
    },
    {
      "start": 569.46,
      "end": 573.86,
      "text": "If you could figure that out for your app you'll be in a very good position before your ad creatives"
    },
    {
      "start": 574.5,
      "end": 576.5,
      "text": "So"
    },
    {
      "start": 577.38,
      "end": 580.34,
      "text": "So you'll see there are a lot of news ads that were just caught up of me"
    },
    {
      "start": 580.42,
      "end": 584.5,
      "text": "I went on the news a lot and these news ads are honestly ripping. They're doing really good"
    },
    {
      "start": 586.66,
      "end": 590.82,
      "text": "Cal AI a tractor calorie intake using artificial intelligence"
    },
    {
      "start": 591.22,
      "end": 594.42,
      "text": "It's also one of the top health and fitness apps in apples app store"
    },
    {
      "start": 594.74,
      "end": 598.74,
      "text": "It wasn't sustainable for my lifestyle to type in everything I was"
    },
    {
      "start": 599.46,
      "end": 601.46,
      "text": "By the way about this already cut off the video"
    },
    {
      "start": 601.7,
      "end": 606.74,
      "text": "I was the producer right before I went on the news segment told me my lights had a glare"
    },
    {
      "start": 607.14,
      "end": 609.3000000000001,
      "text": "So I turned them off and I turned on these"
    },
    {
      "start": 610.1,
      "end": 613.7800000000001,
      "text": "Lights in front of me instead, which I thought would look a lot better"
    },
    {
      "start": 614.5,
      "end": 621.14,
      "text": "But it just made me look scary like look at this bro my entire room is tarth and I'm like a little figure"
    },
    {
      "start": 622.34,
      "end": 626.58,
      "text": "But it's one of our best performing ads. So I don't know maybe there's something there"
    },
    {
      "start": 626.98,
      "end": 629.7,
      "text": "Is eating so along with one of my co-founders"
    },
    {
      "start": 629.7800000000001,
      "end": 634.6600000000001,
      "text": "We hypothesize that we could build an app where you could just take a picture of your food"
    },
    {
      "start": 635.14,
      "end": 642.9000000000001,
      "text": "And then it will tell you the calories and macros of what you're eating the app has grown extraordinarily fast in just the last 12 months"
    },
    {
      "start": 643.3000000000001,
      "end": 650.82,
      "text": "We have achieved more than 6 million downloads and the app is on track to make more than 30 million dollars over the next year"
    },
    {
      "start": 651.5400000000001,
      "end": 653.5400000000001,
      "text": "I"
    },
    {
      "start": 653.5400000000001,
      "end": 655.5400000000001,
      "text": "We do AI a traction"
    },
    {
      "start": 656.4200000000001,
      "end": 662.0200000000001,
      "text": "So a bunch of other news ads that I'm going to skip because they're all like the same thing maybe just different slightly different clips me on different channels"
    },
    {
      "start": 663.1400000000001,
      "end": 664.34,
      "text": "See"
    },
    {
      "start": 664.34,
      "end": 667.94,
      "text": "This is another influencer if you want to go from looking like this to that"
    },
    {
      "start": 668.4200000000001,
      "end": 673.0600000000001,
      "text": "All I did was a calorie deficit and the best way to make sure you're in that deficit is to track your calories"
    },
    {
      "start": 673.22,
      "end": 677.86,
      "text": "Something like calorie eye here helps you track everything accurately by just taking pictures of what you eat"
    },
    {
      "start": 677.94,
      "end": 680.74,
      "text": "That's what you don't got to worry about what you're eating and how much of it"
    },
    {
      "start": 685.0600000000001,
      "end": 692.9,
      "text": "If you want to go to the video really well showing you before and after showing that's more of a UGC type video user generated content"
    },
    {
      "start": 693.78,
      "end": 697.94,
      "text": "He himself is an influencer, but you get whether he's not that famous"
    },
    {
      "start": 697.94,
      "end": 701.3000000000001,
      "text": "So whether he has a following or not a didn't really affect the views"
    },
    {
      "start": 701.3000000000001,
      "end": 705.38,
      "text": "It's more that it was an authentic person giving their review of the app showing how it works for them"
    },
    {
      "start": 705.86,
      "end": 712.66,
      "text": "showing he shows proof he shows how he went from very overweight to having a six-pack"
    },
    {
      "start": 715.06,
      "end": 718.5,
      "text": "Okay, this one was more heavily edited by our editor and let's see what happens"
    },
    {
      "start": 735.46,
      "end": 737.46,
      "text": "You"
    },
    {
      "start": 745.62,
      "end": 747.86,
      "text": "This is just simple and straight to the point"
    },
    {
      "start": 748.66,
      "end": 753.9399999999999,
      "text": "I'm honestly surprised that ad is doing that well. It's pretty impressive. How well it's doing"
    },
    {
      "start": 755.14,
      "end": 757.14,
      "text": "What was it?"
    },
    {
      "start": 757.14,
      "end": 761.62,
      "text": "There's this one. Yeah, it's doing pretty good getting a lot of ad spend behind it"
    },
    {
      "start": 761.78,
      "end": 763.78,
      "text": "So"
    },
    {
      "start": 763.78,
      "end": 766.18,
      "text": "So that's getting straight to the point that works"
    },
    {
      "start": 768.02,
      "end": 769.78,
      "text": "News ads"
    },
    {
      "start": 769.78,
      "end": 772.58,
      "text": "Let's see this one curious. Don't know what it is"
    },
    {
      "start": 774.5,
      "end": 776.82,
      "text": "Okay, same guy that showed the transformation before"
    },
    {
      "start": 778.1,
      "end": 780.1,
      "text": "Another transformation"
    },
    {
      "start": 780.26,
      "end": 782.26,
      "text": "Oh"
    },
    {
      "start": 790.02,
      "end": 795.5400000000001,
      "text": "Notice that it's hook and the hook is unrelated to the app and then it shows the app"
    },
    {
      "start": 796.5,
      "end": 801.86,
      "text": "Not everything needs to be about your app. So don't get too caught up you could show it at the end and it could work"
    },
    {
      "start": 804.1,
      "end": 806.74,
      "text": "Right now we're doing some experiments working with"
    },
    {
      "start": 807.46,
      "end": 814.1800000000001,
      "text": "Michael churn out it's pretty famous or pretty popular guy if you're still using my fitness pal or your notes app to track your food"
    },
    {
      "start": 814.42,
      "end": 815.62,
      "text": "You're wasting your time"
    },
    {
      "start": 815.62,
      "end": 822.1,
      "text": "Calais and AI powered calorie tracking app that tells you the macros in your meals just by snapping a picture"
    },
    {
      "start": 822.1800000000001,
      "end": 827.86,
      "text": "It's really that simple guys point your phone take a photo and in seconds you get protein carbs and fats everything"
    },
    {
      "start": 827.86,
      "end": 833.46,
      "text": "It's so easy my kids have even started using it. I used to log every ingredient manually now"
    },
    {
      "start": 833.5400000000001,
      "end": 840.5,
      "text": "It's just one photo and I'm done look if you're trying to eat cleaner lose weight or just tracks smarter check out cal ai"
    },
    {
      "start": 840.74,
      "end": 845.22,
      "text": "There's a free trial and it's honestly a no-brainer if you're still using my fit"
    },
    {
      "start": 846.26,
      "end": 850.9000000000001,
      "text": "So that one was definitely a little bit higher quality than most of our ads and"
    },
    {
      "start": 851.46,
      "end": 856.02,
      "text": "Looking at this right now. It looks like it's not actually profitable at the moment this ad is early on"
    },
    {
      "start": 856.1800000000001,
      "end": 860.02,
      "text": "So we're gonna see if it becomes profitable. It's getting a lot of spend, but not profitable"
    },
    {
      "start": 860.4200000000001,
      "end": 862.4200000000001,
      "text": "We'll see if it turns around"
    },
    {
      "start": 862.42,
      "end": 871.86,
      "text": "It actually you know what there's a chance it's profitable usually I say it's not profitable because the cost per result usually profitable for us is when the cost per results like under 20 dollars"
    },
    {
      "start": 872.8199999999999,
      "end": 874.8199999999999,
      "text": "But this is over"
    },
    {
      "start": 874.9,
      "end": 883.14,
      "text": "However, Michael turn out as an influencer that usually targets older audiences and so because of that it's possible that this ad is profitable"
    },
    {
      "start": 883.78,
      "end": 887.6999999999999,
      "text": "And we could actually see the age demographic breakdown I think of his ad"
    },
    {
      "start": 888.6600000000001,
      "end": 895.0600000000001,
      "text": "I'm basically what I'm saying is if he's targeting older audience they might be more likely to convert they might have a higher ltv"
    },
    {
      "start": 895.94,
      "end": 897.94,
      "text": "Okay, so 35 to 44"
    },
    {
      "start": 904.58,
      "end": 910.82,
      "text": "It's 24 the average age. Okay, versus this ad"
    },
    {
      "start": 913.7,
      "end": 915.7,
      "text": "Which is"
    },
    {
      "start": 918.26,
      "end": 920.26,
      "text": "So"
    },
    {
      "start": 923.22,
      "end": 929.22,
      "text": "Mostly younger so it is it is definitely hitting an older audience and it's possibly profitable"
    },
    {
      "start": 930.82,
      "end": 932.82,
      "text": "So okay, let's watch like one more"
    },
    {
      "start": 932.98,
      "end": 934.98,
      "text": "You"
    },
    {
      "start": 944.2600000000001,
      "end": 949.38,
      "text": "I just Spanish ad to be honest. I don't know what it says, but it's working for our Spanish campaign"
    },
    {
      "start": 949.38,
      "end": 951.62,
      "text": "You know you don't need to worry about Spanish for now"
    },
    {
      "start": 952.4200000000001,
      "end": 955.7,
      "text": "Here's another one. I don't count calories. It takes too long and that shows"
    },
    {
      "start": 956.6600000000001,
      "end": 959.94,
      "text": "Solving the problem because that was so similar you can make this in"
    },
    {
      "start": 960.58,
      "end": 963.3000000000001,
      "text": "30 minutes or less like probably like"
    },
    {
      "start": 964.0200000000001,
      "end": 966.0200000000001,
      "text": "Two minutes if you're just grinding it out"
    },
    {
      "start": 966.1800000000001,
      "end": 968.1800000000001,
      "text": "something else I want to go over is"
    },
    {
      "start": 969.46,
      "end": 972.1,
      "text": "A static ad so this is when you just have an image"
    },
    {
      "start": 973.0600000000001,
      "end": 976.1800000000001,
      "text": "And you can do something like we try the best calorie chakras here's our favorite"
    },
    {
      "start": 977.22,
      "end": 980.98,
      "text": "And then you click learn more it takes you to the app or website or whatever"
    },
    {
      "start": 981.62,
      "end": 986.82,
      "text": "So these static ads can actually work pretty well if some some company is heavily rely on them"
    },
    {
      "start": 986.9000000000001,
      "end": 989.62,
      "text": "Others heavily rely on video for elsewhere mostly video oriented"
    },
    {
      "start": 990.74,
      "end": 993.0600000000001,
      "text": "And just starting statics it looks like it's"
    },
    {
      "start": 994.4200000000001,
      "end": 999.7,
      "text": "Not it's likely not profitable right now most of our statics look like they're not doing that good"
    },
    {
      "start": 1001.7800000000001,
      "end": 1004.9000000000001,
      "text": "For apps honestly videos are probably the way to go"
    },
    {
      "start": 1006.98,
      "end": 1008.98,
      "text": "But yeah, so we just have a lot of stuff here"
    },
    {
      "start": 1009.7800000000001,
      "end": 1012.5,
      "text": "Let's look at some ads of some other apps"
    },
    {
      "start": 1012.98,
      "end": 1018.26,
      "text": "So like I said before you could just go to the meta ad library all ads Facebook ad library"
    },
    {
      "start": 1018.98,
      "end": 1021.38,
      "text": "Then you could start looking up stuff. So like opal"
    },
    {
      "start": 1022.42,
      "end": 1024.42,
      "text": "cool cool app"
    },
    {
      "start": 1024.42,
      "end": 1026.42,
      "text": "Cool ads"
    },
    {
      "start": 1027.22,
      "end": 1029.22,
      "text": "Some text on the screen"
    },
    {
      "start": 1038.5,
      "end": 1041.86,
      "text": "I've seen some really high quality opal ads. I wonder if I could find one"
    },
    {
      "start": 1042.66,
      "end": 1044.66,
      "text": "I"
    },
    {
      "start": 1047.62,
      "end": 1049.14,
      "text": "I'm seeing"
    },
    {
      "start": 1049.22,
      "end": 1051.22,
      "text": "This is one of the best ads I've seen in a while"
    },
    {
      "start": 1051.22,
      "end": 1053.06,
      "text": "It makes you feel very uncomfortable"
    },
    {
      "start": 1053.06,
      "end": 1055.62,
      "text": "And that's the whole point of this ad because if you feel uncomfortable"
    },
    {
      "start": 1056.02,
      "end": 1059.94,
      "text": "The jobs are high as you come come on pre so you can try it out for yourself"
    },
    {
      "start": 1060.42,
      "end": 1063.78,
      "text": "You are the human but here you treat it like catalysts and data"
    },
    {
      "start": 1063.94,
      "end": 1067.54,
      "text": "You've been reduced from a lot of people will picture on the planet who pair of eyeballs and a thumb"
    },
    {
      "start": 1067.86,
      "end": 1069.06,
      "text": "This is by design"
    },
    {
      "start": 1069.1399999999999,
      "end": 1072.6599999999999,
      "text": "Why do you think every single social media company created their own vertical video black"
    },
    {
      "start": 1073.06,
      "end": 1077.06,
      "text": "Because it's insanely fucking addictive the college persuasive technology"
    },
    {
      "start": 1077.1399999999999,
      "end": 1079.62,
      "text": "But it's in slatement four hours on your phone"
    },
    {
      "start": 1079.78,
      "end": 1081.62,
      "text": "Well, like 10 years of your life"
    },
    {
      "start": 1081.62,
      "end": 1083.62,
      "text": "Gone and what are you getting in return?"
    },
    {
      "start": 1083.7,
      "end": 1085.3799999999999,
      "text": "It was never meant to be this way"
    },
    {
      "start": 1085.3799999999999,
      "end": 1089.46,
      "text": "I was the bicycle of the mind men's take us further than we've ever been before"
    },
    {
      "start": 1089.46,
      "end": 1091.3799999999999,
      "text": "The harness fire went to the moon"
    },
    {
      "start": 1091.3799999999999,
      "end": 1095.3,
      "text": "There's all of them but the no smarter than you without a fucking title"
    },
    {
      "start": 1095.46,
      "end": 1098.6599999999999,
      "text": "You've been given one chance to play this game of life and they're trying to trap you"
    },
    {
      "start": 1099.06,
      "end": 1101.06,
      "text": "Here"
    },
    {
      "start": 1107.7,
      "end": 1112.26,
      "text": "So this obviously isn't the actual ad this was a TikTok of a guy reacting to it"
    },
    {
      "start": 1112.34,
      "end": 1114.8999999999999,
      "text": "But this ad I remember seeing it"
    },
    {
      "start": 1115.7,
      "end": 1118.5,
      "text": "Before like it just came up naturally on my four-upage"
    },
    {
      "start": 1119.1399999999999,
      "end": 1125.1399999999999,
      "text": "And it it called my attention. It's a very cool ad cinematic ads like that can work really well"
    },
    {
      "start": 1125.7800000000002,
      "end": 1131.8600000000001,
      "text": "There is a trade-off where like we I showed that ad where someone just took a picture of an apple one of our best performing ads"
    },
    {
      "start": 1132.18,
      "end": 1137.7800000000002,
      "text": "Ever that took 30 minutes or less whereas this probably took hours"
    },
    {
      "start": 1139.22,
      "end": 1141.22,
      "text": "tens of hours maybe even a hundred hours"
    },
    {
      "start": 1142.3400000000001,
      "end": 1147.7800000000002,
      "text": "And you don't know if it's going to be profitable at the end of the day you could spend we actually spent like 20k on an ad"
    },
    {
      "start": 1147.8600000000001,
      "end": 1152.26,
      "text": "And it just wasn't wasn't profitable. We tried to do a really high quality one just was not profitable"
    },
    {
      "start": 1152.98,
      "end": 1156.74,
      "text": "To be fair actually that ad we did it was a TV ad"
    },
    {
      "start": 1157.14,
      "end": 1160.98,
      "text": "So it was very different than what we're going through right now. We were just dabbling in TV"
    },
    {
      "start": 1161.7,
      "end": 1163.7,
      "text": "Not something you guys need to worry about right now"
    },
    {
      "start": 1165.06,
      "end": 1168.82,
      "text": "You'll get there soon enough if you really have what it takes we'll see"
    },
    {
      "start": 1169.7,
      "end": 1174.02,
      "text": "Our entrepreneur is born or can they be created? I don't know. I was actually thinking about this recently"
    },
    {
      "start": 1174.66,
      "end": 1181.86,
      "text": "And I think I've came to an answer. I think that it's a lot of nature versus nurture where I think most of being an entrepreneur is nurture"
    },
    {
      "start": 1181.86,
      "end": 1188.82,
      "text": "It's like risk tolerance a bunch of other things that all are affected when you're young for example risk tolerance"
    },
    {
      "start": 1190.58,
      "end": 1194.58,
      "text": "If you are rewarded for taking risks when you're younger versus if you are"
    },
    {
      "start": 1195.54,
      "end": 1197.54,
      "text": "It's opposite of rewarded like"
    },
    {
      "start": 1199.3,
      "end": 1204.8999999999999,
      "text": "Um opposite word or punish I guess"
    },
    {
      "start": 1209.78,
      "end": 1210.9799999999998,
      "text": "Antony"
    },
    {
      "start": 1212.26,
      "end": 1214.26,
      "text": "You"
    },
    {
      "start": 1222.5,
      "end": 1226.02,
      "text": "Okay, maybe there isn't a good one but punished as a kid"
    },
    {
      "start": 1226.9799999999998,
      "end": 1231.6999999999998,
      "text": "Entrepreneurs naturally like everyone knows they have a high risk tolerance. They take a lot of risks"
    },
    {
      "start": 1232.26,
      "end": 1234.26,
      "text": "most of them do at least"
    },
    {
      "start": 1234.6599999999999,
      "end": 1239.86,
      "text": "And that's something that if you're younger you develop a low risk tolerance"
    },
    {
      "start": 1240.02,
      "end": 1242.74,
      "text": "I think you could break that habit when you're older. It's just difficult to"
    },
    {
      "start": 1243.3,
      "end": 1247.1399999999999,
      "text": "The longer you go before starting your entrepreneurial your entrepreneurial journey"
    },
    {
      "start": 1247.4599999999998,
      "end": 1252.58,
      "text": "The harder I think it will be to get in the right mindset because there are some traits that are very necessary"
    },
    {
      "start": 1253.1399999999999,
      "end": 1259.2199999999998,
      "text": "Um, I'd say the main ones are grit. It's just being willing to fail over and over and over again as you're watching this just"
    },
    {
      "start": 1260.1799999999998,
      "end": 1264.9799999999998,
      "text": "Don't think you're gonna watch this and even though we've done this so many times we're giving you"
    },
    {
      "start": 1265.6200000000001,
      "end": 1269.46,
      "text": "Spoon feeding you the secrets don't think you're gonna get it on your first time"
    },
    {
      "start": 1269.54,
      "end": 1275.14,
      "text": "You're probably going to fail for your first couple of apps until one finally takes off and when that one takes off"
    },
    {
      "start": 1275.38,
      "end": 1279.3,
      "text": "It's gonna blow up past any of your expectations if you stay in it"
    },
    {
      "start": 1281.14,
      "end": 1285.22,
      "text": "I honestly was thinking about this the other day. I used to say when I was a like I mean"
    },
    {
      "start": 1285.22,
      "end": 1290.18,
      "text": "I was give that to say when I was a kid, but I guess a lot of people look at me as a kid now, but I'm 18. I'm not a kid, but"
    },
    {
      "start": 1290.74,
      "end": 1292.18,
      "text": "but"
    },
    {
      "start": 1292.98,
      "end": 1296.66,
      "text": "I used to think I'm gonna be an entrepreneur or die trying. I don't want to work at 9 to 5"
    },
    {
      "start": 1297.54,
      "end": 1302.18,
      "text": "And I thought about this yesterday. I was like this kind of retarded like I think genuinely"
    },
    {
      "start": 1302.8200000000002,
      "end": 1307.78,
      "text": "Anyone can find success as an entrepreneur. It's just a matter of trying enough things like you will"
    },
    {
      "start": 1307.8600000000001,
      "end": 1312.3400000000001,
      "text": "It's almost impossible not to if you just don't give up because there's so much money to be made"
    },
    {
      "start": 1312.66,
      "end": 1318.5800000000002,
      "text": "So many industries that are untapped people are making money off the dumbest things. I know people who are making six figures a year"
    },
    {
      "start": 1319.3,
      "end": 1324.4199999999998,
      "text": "That literally just book restaurants seats in advance and then sell them as it gets close to the day"
    },
    {
      "start": 1324.6599999999999,
      "end": 1328.4199999999998,
      "text": "There is so much money to be made in the world people just don't realize that"
    },
    {
      "start": 1331.46,
      "end": 1336.1,
      "text": "Back to the point of this yet, so go through the ad library search up your favorite apps"
    },
    {
      "start": 1336.98,
      "end": 1339.86,
      "text": "See if we get some any other cool ones"
    },
    {
      "start": 1339.9399999999998,
      "end": 1341.9399999999998,
      "text": "I"
    },
    {
      "start": 1344.1799999999998,
      "end": 1347.78,
      "text": "Don't invest is actually really cool popcorn. They aren't some nice news ads"
    },
    {
      "start": 1348.1799999999998,
      "end": 1354.8999999999999,
      "text": "Would you sell your ownership in this particular app for a hundred million dollars you post? Oh definitely not definitely not a billion"
    },
    {
      "start": 1355.54,
      "end": 1356.58,
      "text": "Definitely not"
    },
    {
      "start": 1356.58,
      "end": 1361.2199999999998,
      "text": "So you want to refuse to walk away from this no matter what I want to welcome this for the rest of my life"
    },
    {
      "start": 1361.3799999999999,
      "end": 1365.78,
      "text": "And I think the mission that we're trying to bring is we're really writing the investing playbook"
    },
    {
      "start": 1366.02,
      "end": 1371.86,
      "text": "If you send Americans are not participating in the greatest world creation engine of our time to stop more than capitalism"
    },
    {
      "start": 1372.26,
      "end": 1376.34,
      "text": "I know Steven the demand is pretty cr... I love him"
    },
    {
      "start": 1376.98,
      "end": 1380.58,
      "text": "We've been out to dinner a bunch of times. This is a great guy. That is definitely cap"
    },
    {
      "start": 1380.66,
      "end": 1384.98,
      "text": "He would sell his shares for a billion dollars if he won't then it's very commendable"
    },
    {
      "start": 1385.62,
      "end": 1387.78,
      "text": "Maybe he cares about his company more than I think"
    },
    {
      "start": 1388.42,
      "end": 1391.86,
      "text": "But now you got to say some extreme stuff for good ad creatives"
    },
    {
      "start": 1392.02,
      "end": 1396.02,
      "text": "He actually told me it's funny. He goes on when he goes on ads when he when he goes on"
    },
    {
      "start": 1396.9799999999998,
      "end": 1398.8999999999999,
      "text": "TV live TV"
    },
    {
      "start": 1398.9799999999998,
      "end": 1405.4599999999998,
      "text": "He'll have a few lines ready that they know will work well for the paid ad and then they'll clip up these specific parts"
    },
    {
      "start": 1405.78,
      "end": 1410.4199999999998,
      "text": "So that's what I started doing too when I go on these tv ads. I'll try some things something"
    },
    {
      "start": 1410.4199999999998,
      "end": 1415.1399999999999,
      "text": "I actually did the last time I went on TV. I don't know if we tried it as an ad yet"
    },
    {
      "start": 1415.86,
      "end": 1421.3,
      "text": "But I work two watches one on each wrist hoping that it's going to rage bait people in the comments"
    },
    {
      "start": 1421.62,
      "end": 1426.1,
      "text": "To write like why the fuck is he wearing two watches that founder what a loser bubble up"
    },
    {
      "start": 1426.5,
      "end": 1431.86,
      "text": "Because engagement on paid ads actually helps you get more and more reach just like on an organic post"
    },
    {
      "start": 1432.02,
      "end": 1434.18,
      "text": "It will lower the cost per"
    },
    {
      "start": 1434.8999999999999,
      "end": 1438.1,
      "text": "Person that sees it generally generally if you get good engagement"
    },
    {
      "start": 1440.34,
      "end": 1442.34,
      "text": "Okay"
    },
    {
      "start": 1442.82,
      "end": 1445.46,
      "text": "So feel free to just go around look through"
    },
    {
      "start": 1446.18,
      "end": 1448.26,
      "text": "This slide goes through creatives pretty well"
    },
    {
      "start": 1448.5,
      "end": 1450.82,
      "text": "I hope you have some good takeaways"
    },
    {
      "start": 1451.54,
      "end": 1455.7,
      "text": "Mm, I got to relax now I'm tired. Did a lot of recording today"
    },
    {
      "start": 1457.62,
      "end": 1460.82,
      "text": "Yeah, you guys got this you don't need me fucking just lock in"
    },
    {
      "start": 1462.02,
      "end": 1465.86,
      "text": "This is some music spend like I know a lot of people that will spend"
    },
    {
      "start": 1467.06,
      "end": 1470.9,
      "text": "One day a week and that whole day is just dedicated to making ad creatives"
    },
    {
      "start": 1471.54,
      "end": 1477.3,
      "text": "They'll upload them they'll let them run for a week and they'll have a new battery like the next day of the week to put in"
    },
    {
      "start": 1477.3,
      "end": 1482.5,
      "text": "Go have one filming day and then one uploading day the upload like 50 creatives every single week"
    },
    {
      "start": 1483.06,
      "end": 1487.3799999999999,
      "text": "You don't need to do that at this scale, but like when you start scaling up 50 creatives a week is"
    },
    {
      "start": 1487.86,
      "end": 1491.46,
      "text": "An ambitious goal. It's a good place to be that's when you'll start making millions of dollars among"
    },
    {
      "start": 1492.82,
      "end": 1494.34,
      "text": "Cool"
    },
    {
      "start": 1494.34,
      "end": 1499.1399999999999,
      "text": "I think that's actually everything for the traditional pay. It's not everything. Okay"
    },
    {
      "start": 1500.4199999999998,
      "end": 1502.4199999999998,
      "text": "I'll see you guys in the next module"
    }
  ]
}