{
  "file_name": "017_Lesson_17.faudio-hi-0-Default.mp4",
  "text": " Hey everyone, welcome back to the design module and today we're going to be talking about brand aesthetic. Now this is personally my favorite thing to do when I start walking on a new app or a new project. It like a brand brings a business to life and so I usually always start with that. Counterintuitively we started this design module with wire framing and I suppose that's how like most people do things. But for me it's always about brand first. So I'd love to do this little deep dive into what makes Quitter so good and successful in its own niche. How to build an app for your niche and how to get inspired by other brands that you like. So let's start. The most important thing to know is that you need your brand to resonate with your target demographic. You can't just build something that you think is cool if it doesn't appeal to the people you are targeting. For example, U-Bo they have a great and very clean UI. It's a bit like Snapchat, yellow, it's colourful, it's popping. But like this doesn't feel very professional. This doesn't feel very serious. This feels a bit like a joke or a school project which is great when just targeting Gen Z or younger individuals which they do. But let's say this is an app to find a lawyer. Lawyer and law is a very serious topic. And so these bright colours and these lower case lettering and these big fonts etc. And these emojis specifically as well. It isn't professional. No one's going to take you seriously if you're trying to be a lawyer app. Trying to find the plural version of that but I can't. So yeah, there's another example. So if I want to build a calorie tracking app for everyone, I'm going to use very simple colours. And I'm not going to pull any demographic in one way. And it's going to be like all inclusive. So it's hard to really like explain what I mean by that. But KAI shows no humans. It shows no faces. As soon as they do that, they're pushing a demographic onto you. Whereas with UBO you can see young people or at least relatively young will make this bigger for the sake of the video. You can see relatively young people. These are all under like 25 years old and like mostly females. Actually almost everyone's a female funny enough. So that's pushing that app towards a certain demographic. Whereas for a calorie tracking app, they're not showing any humans. So anyone that's watching it feels like this could be for them. They're not influenced by other factors like an image of a human. That is older or there's you know, got a family or kids, whatever. Very important when it comes to appealing to your niche. Next we have Quitter. And like why is Quitter successful? So we targeted Gen Z and younger people specifically. And the traditional Quitting Point Apps weren't cool. They put you in a box. They made you feel like you had this serious issue. They had like these intensive programs. They were showing pictures of older men and I'll show you in a second what I mean. And it didn't really appeal to younger people. So they were underserved and they had nowhere to go. And they just suffered with this addiction. Pretty much the entire time they had no solutions. And so look at our competitor now. So this is a really bad competitor. And straight away you can tell there's a massive difference. This feels super engaging. This feels really cool and this makes me want to down at the app. As a young guy I see a lot of colors. I see orbs. I see streaks. I see a gamified way to quit. I'm like hell fucking yeah. Whereas here I see an old guy maybe in his like 30s mid 30s. This is Quitter Point and masturbation. That language itself is a bit vulgar and like it's just a bit cringe. Whereas with us we just make it like simple. Just quit porn now. Just quit porn for life. Like instead of quit porn and masturbation like come on bro. No one's gonna, no one really appeals to that. Next track time and money saved. This doesn't really appeal to Gen Z. I don't think Gen Z is spending money on porn. They're just like watching it for free. So this is completely missing the mark when it comes to the younger demographic. But as you can see they still have 400 ratings. So whatever niche and what sorry whatever demographic they are targeting is working. But you know the most important thing to pull from this. It doesn't feel cool. It feels like a chore. And you know no young person. You're never gonna see a young person using this for sure not. And like we'll get right into the details like the data doesn't fly. Most of our downloads come from under 18 year olds. Now sure not everyone has a credit card to pay and actually use our app. But most of the traffic comes from people that are under 18. So whatever messaging we're doing is working. And I bet if we compare the data to this and of course it's not open source so we can't confirm. But I bet no one under like 25 is downloading this. But yeah that's like the whole point with niches and brand aesthetics. Like maybe quitter won't appeal to older people because they're like what the fuck is this. I want something actually serious and tangible. This feels like an actual program. This feels like yeah like a program pretty much. Whereas this is like this feels like a game. So super important to know when it comes to brand aesthetics like understand your demographic. Understand who you are targeting because if you get the messaging wrong. You're not going to succeed in who you're targeting. But you won't target the right people. So yeah I'm going to show you how to build a brand and how I would start building a brand based on the example design. Which is a testosterone max app. Now there are obviously two ways to spend this. So I'm targeting older gym guys who are like in their 30s who take steroids that want to be super super test testosterone to the max. I never use this like so my my apologies. But they want to be tested to the max. They want to be fucking ripped. They want to be super masculine etc etc. So that is one way one demographic that we can target. The other is just young people that listen to Andrew Tate for example. And they're like oh I want to get my testosterone up. I think that would be really cool. I would attract girls. So I'm going to show you two versions of how I would build this for an older demographic and for younger demographic. So one of the core principles when it comes to younger is use things that are relatable. One of those things could be emojis. So as you can see I'm probably going to start this with an emoji. Now there are a few apps that do this. Is it super professional? No but that's the point. You're targeting a bar younger demographic. So this is it's just less important. So here's the emoji we're going to use actually make it a little bit smaller. There we go. And then I'm going to change this background to be yeah that feels or maybe like a slated gray. Pick that. And then maybe I have text saying test max. Max is a very new age word so it works for the younger demographic. And we'll just do inter that's fine. And I'll make this about 300 maybe 225. Cool. And then I'll give it a stroke. A black stroke will make it a bit larger maybe 10. There we go. We'll just make this stroke green. Or we make the text green and stroke black. Straight black. Text green. Yeah. This is honestly solid. Now of course you can say from a design standpoint this isn't very clean. But it is definitely polarizing and you need to be capturing young people's attention. So this would low key actually work. Maybe the stroke makes it look unprofessional. Maybe I just do a drop shadow instead. 100. Maybe a black stroke slightly. 5. Okay that low key works. So again lots super professional we can make another version of this as well. Probably without chart as the main. We'll center this make it about 350. And then the spacing between I believe that is this way. Minus 50. Oh shit. What about vertical scaling though? You know what is fine I guess for now. I don't know how to use thing that well. But this could work. As a younger demographic or for a younger demographic this could totally, totally work. It seems really stupid but you get the vibe I'm trying to go for. Now let me show you how to build a very serious older demographic. Oh okay let me show you how to build a brine aesthetic for an older demographic based on the same app idea. So this is going to be feeling a little bit more professional. And maybe we get like a syringe or some all test. Like something like I can't have emojis can I? I also wouldn't put text in. Let me think. Yeah like I would probably do something like this. Honestly. This feels more legit. All the older guys will know exactly what this means. So we'll just make this a bit smaller. Maybe just TM. Alright. And that's in the center. And then we'll just lower the opacity of this by like 50%. Maybe even more. There we go. Loki this feels more professional and this feels more like a school project. And that's how I would design the TM. Alright everyone so now I'm going to show you how I would design the brine aesthetics for the two different demographics of the test, austro and maxing app. So I already started this a little bit but for the older demographic we wanted to film a professional and more serious and more like get shit done. Because that's like these older guys motto is like I'm fueled with testosterone, I'm jacked, I'm rips, I'm massive, I'm scary and I want to scare you in the process. So all of these massive fonts and like like bolded text and all caps very intentional. It literally appeals to that demographic so much that that like okay holy shit like this is for me. Even the app icon like it isn't that engaging but if you know you know and these big testosterone heads they know that this symbol behind signifies testosterone. So they're like okay whoever made this up knows what they're doing and this feels again very serious and very legit. Whereas like if we want to target a younger demographic maybe they're not they don't really care as much but they want to test it out and they want to do it in a fun way. They don't want to destroy the competition like we say here. They maybe you want to subtly increase the testosterone playing if you're not playing if you're games but like they want to increase their testosterone in a gamified way. They want to have fun like the young people at the end of the day they don't want to go all in. So for the younger demographic we choose emojis and this is because emojis are very relatable and yeah young people use them a lot. So it makes sense to leverage that kind of cultural significance within our app icon and our branding. So look at the look at the difference here. Test max become manually. It's way more passive it's way more you know it's easier to be a part of and then the line is like get jacked with easy steps. Young people want to cut corners they don't really want to go all in. So this makes more sense to them and a gamified way to increase testosterone. Again super super passive but it also explains what the app does. So young people will be like okay you know this I see the emoji I see the green font. This seems like everything I want to achieve out of getting testosterone I'm going to try it. Whereas like if I was an old guy and I saw this I'd be like okay like I bought too much fucking testosterone to wait around and get jacked of easy steps. I want to go fucking hard. So when they read this become the ultimate you destroy the competition. This is the one they will download and this is the one they'll pay for. This feels like a school project but low key if you are targeting a young demographic that's what you want. Of course this is a little bit difficult because we're talking about testosterone maxing out and like our young people super interested in that. Not sure if this was a social app again this would be really easy to sell to with the emojis and big fonts etc. So a thing to note is... So just to reiterate the most important thing about brand is how much you appeal to whatever demographic you're targeting. And so you need to get these things right. And my best advice when it comes to designing a brand and designing a product that you end up selling and making money from and building a brand from is just be the consumer yourself. For example, Zach, well actually I'm going to use me as an example but I don't want to say it's not like I'm fucking joker every day I'm just saying like I'm going to use me as an example. I went down self-improvement and you know quitting porn is a part of that. The reason it's so difficult in self-improvement is because it's so accessible the algorithms are filled with this like soft core porn material because that gets the most engagement. And so anyone that's trying to quit kind of just battles of themselves there's no like real good solution. So I was like okay what if I made it fun I made it cutting edge and I made it cool to actually begin quitting. So I was that person so I knew exactly what I would pay for and what I would use so I just built it. Now of course this isn't like super tangible advice because you could be the demographic and it could still like the brand said it could still suck. But the most important things to know are if it's for younger people just try and make it a bit more cool and a little bit more relaxed and laid back and if it's for older people kind of just make it seem more professional more serious and more more like a program. And it could be more boring as well. And so yeah another big advice. And you know what I'll close this by saying anything you do when it comes to your color scheme your font sizes and your language don't switch it up at all throughout your app. Make sure your brand is cohesive and this representing itself in almost everything you do. As soon as you start mixing fonts together you lose that brand aura. Now it is fine if the font isn't completely the same like maybe I want to do this Canada. I think this is low key fine but any more than three different fonts it won't work. It just feels sloppy. And brands gain respect because you feel the time the dedication the messaging throughout it. Quitter is such a strong brand because we've been here around for a year we've put a bunch of cool stunts or on a mission to take down the point industry. The UI is super fucking clean the app works really well and that's how we bought our brand. And if we started using these brand of different colors and like didn't represent the brand as true to itself and always try to do different shit and it's hard to explain what I mean by that. But stick to your core messaging and don't switch it up. Actually I can give a great example and this is so off topic but it kind of works. This is my profile picture. It's me looking up the sky blue background from a year ago. This is bought a brand. I bought a brand in myself by repping this profile picture. As soon as I change my profile picture I'm going to need to build my brand again. Now of course it's going to be easier because I'm using the Alex later name but it's generally generally a bad strategy to switch up branding. And like even Quitter Quitter's logo has not changed since the beginning. And so one of my greatest advice is just stick to what you have as long as you're happy with it of course and keep growing that. Don't change things around. You can change the app source screen shots they aren't really that important but the language, the fonts, the logo try to keep that uniform for everything you do. And so like if I went into this app maybe I would copy the font that I just used from my super serious version. So what font is this? Can it. So go into this and instead of in sir we use can it. There you go. Maybe we want to make this all caps. Facial analysis. There we go. And then we'll have the logo TM. We'll copy this. TM or test dough. Or maybe we want this to be the kind of one which also works. So having a different font for the logo and a different font for the test for the text works well too. We see this with Instagram, we see this with Twitter etc etc. And that's how you build a brand. 101 how you build a brand. But yeah. I'm going to move this down a copy just so you guys are aware. But yeah. Peace out boys.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.34,
      "text": "Hey everyone, welcome back to the design module and today we're going to be talking about brand aesthetic."
    },
    {
      "start": 5.34,
      "end": 12.0,
      "text": "Now this is personally my favorite thing to do when I start walking on a new app or a new project."
    },
    {
      "start": 12.0,
      "end": 18.0,
      "text": "It like a brand brings a business to life and so I usually always start with that."
    },
    {
      "start": 18.0,
      "end": 24.5,
      "text": "Counterintuitively we started this design module with wire framing and I suppose that's how like most people do things."
    },
    {
      "start": 24.5,
      "end": 27.5,
      "text": "But for me it's always about brand first."
    },
    {
      "start": 27.5,
      "end": 33.5,
      "text": "So I'd love to do this little deep dive into what makes Quitter so good and successful in its own niche."
    },
    {
      "start": 33.5,
      "end": 39.5,
      "text": "How to build an app for your niche and how to get inspired by other brands that you like."
    },
    {
      "start": 39.5,
      "end": 41.5,
      "text": "So let's start."
    },
    {
      "start": 41.5,
      "end": 49.5,
      "text": "The most important thing to know is that you need your brand to resonate with your target demographic."
    },
    {
      "start": 49.5,
      "end": 55.5,
      "text": "You can't just build something that you think is cool if it doesn't appeal to the people you are targeting."
    },
    {
      "start": 55.5,
      "end": 59.5,
      "text": "For example, U-Bo they have a great and very clean UI."
    },
    {
      "start": 59.5,
      "end": 64.5,
      "text": "It's a bit like Snapchat, yellow, it's colourful, it's popping."
    },
    {
      "start": 64.5,
      "end": 69.5,
      "text": "But like this doesn't feel very professional. This doesn't feel very serious."
    },
    {
      "start": 69.5,
      "end": 77.5,
      "text": "This feels a bit like a joke or a school project which is great when just targeting Gen Z or younger individuals which they do."
    },
    {
      "start": 77.5,
      "end": 83.5,
      "text": "But let's say this is an app to find a lawyer."
    },
    {
      "start": 83.5,
      "end": 87.5,
      "text": "Lawyer and law is a very serious topic."
    },
    {
      "start": 87.5,
      "end": 96.5,
      "text": "And so these bright colours and these lower case lettering and these big fonts etc."
    },
    {
      "start": 96.5,
      "end": 98.5,
      "text": "And these emojis specifically as well."
    },
    {
      "start": 98.5,
      "end": 106.5,
      "text": "It isn't professional. No one's going to take you seriously if you're trying to be a lawyer app."
    },
    {
      "start": 106.5,
      "end": 109.5,
      "text": "Trying to find the plural version of that but I can't."
    },
    {
      "start": 109.5,
      "end": 113.5,
      "text": "So yeah, there's another example."
    },
    {
      "start": 113.5,
      "end": 119.5,
      "text": "So if I want to build a calorie tracking app for everyone, I'm going to use very simple colours."
    },
    {
      "start": 119.5,
      "end": 123.5,
      "text": "And I'm not going to pull any demographic in one way."
    },
    {
      "start": 123.5,
      "end": 126.5,
      "text": "And it's going to be like all inclusive."
    },
    {
      "start": 126.5,
      "end": 133.5,
      "text": "So it's hard to really like explain what I mean by that."
    },
    {
      "start": 133.5,
      "end": 137.5,
      "text": "But KAI shows no humans. It shows no faces."
    },
    {
      "start": 137.5,
      "end": 141.5,
      "text": "As soon as they do that, they're pushing a demographic onto you."
    },
    {
      "start": 141.5,
      "end": 148.5,
      "text": "Whereas with UBO you can see young people or at least relatively young will make this bigger for the sake of the video."
    },
    {
      "start": 148.5,
      "end": 154.5,
      "text": "You can see relatively young people. These are all under like 25 years old and like mostly females."
    },
    {
      "start": 154.5,
      "end": 157.5,
      "text": "Actually almost everyone's a female funny enough."
    },
    {
      "start": 157.5,
      "end": 166.5,
      "text": "So that's pushing that app towards a certain demographic."
    },
    {
      "start": 166.5,
      "end": 169.5,
      "text": "Whereas for a calorie tracking app, they're not showing any humans."
    },
    {
      "start": 169.5,
      "end": 173.5,
      "text": "So anyone that's watching it feels like this could be for them."
    },
    {
      "start": 173.5,
      "end": 178.5,
      "text": "They're not influenced by other factors like an image of a human."
    },
    {
      "start": 178.5,
      "end": 182.5,
      "text": "That is older or there's you know, got a family or kids, whatever."
    },
    {
      "start": 182.5,
      "end": 187.5,
      "text": "Very important when it comes to appealing to your niche."
    },
    {
      "start": 187.5,
      "end": 190.5,
      "text": "Next we have Quitter."
    },
    {
      "start": 190.5,
      "end": 193.5,
      "text": "And like why is Quitter successful?"
    },
    {
      "start": 193.5,
      "end": 198.5,
      "text": "So we targeted Gen Z and younger people specifically."
    },
    {
      "start": 198.5,
      "end": 202.5,
      "text": "And the traditional Quitting Point Apps weren't cool."
    },
    {
      "start": 202.5,
      "end": 206.5,
      "text": "They put you in a box. They made you feel like you had this serious issue."
    },
    {
      "start": 206.5,
      "end": 208.5,
      "text": "They had like these intensive programs."
    },
    {
      "start": 208.5,
      "end": 212.5,
      "text": "They were showing pictures of older men and I'll show you in a second what I mean."
    },
    {
      "start": 212.5,
      "end": 218.5,
      "text": "And it didn't really appeal to younger people."
    },
    {
      "start": 218.5,
      "end": 222.5,
      "text": "So they were underserved and they had nowhere to go."
    },
    {
      "start": 222.5,
      "end": 225.5,
      "text": "And they just suffered with this addiction."
    },
    {
      "start": 225.5,
      "end": 229.5,
      "text": "Pretty much the entire time they had no solutions."
    },
    {
      "start": 229.5,
      "end": 233.5,
      "text": "And so look at our competitor now."
    },
    {
      "start": 233.5,
      "end": 236.5,
      "text": "So this is a really bad competitor."
    },
    {
      "start": 236.5,
      "end": 241.5,
      "text": "And straight away you can tell there's a massive difference."
    },
    {
      "start": 241.5,
      "end": 243.5,
      "text": "This feels super engaging."
    },
    {
      "start": 243.5,
      "end": 246.5,
      "text": "This feels really cool and this makes me want to down at the app."
    },
    {
      "start": 246.5,
      "end": 248.5,
      "text": "As a young guy I see a lot of colors."
    },
    {
      "start": 248.5,
      "end": 250.5,
      "text": "I see orbs. I see streaks."
    },
    {
      "start": 250.5,
      "end": 252.5,
      "text": "I see a gamified way to quit."
    },
    {
      "start": 252.5,
      "end": 254.5,
      "text": "I'm like hell fucking yeah."
    },
    {
      "start": 254.5,
      "end": 259.5,
      "text": "Whereas here I see an old guy maybe in his like 30s mid 30s."
    },
    {
      "start": 259.5,
      "end": 261.5,
      "text": "This is Quitter Point and masturbation."
    },
    {
      "start": 261.5,
      "end": 265.5,
      "text": "That language itself is a bit vulgar and like it's just a bit cringe."
    },
    {
      "start": 265.5,
      "end": 268.5,
      "text": "Whereas with us we just make it like simple."
    },
    {
      "start": 268.5,
      "end": 270.5,
      "text": "Just quit porn now."
    },
    {
      "start": 270.5,
      "end": 271.5,
      "text": "Just quit porn for life."
    },
    {
      "start": 271.5,
      "end": 274.5,
      "text": "Like instead of quit porn and masturbation like come on bro."
    },
    {
      "start": 274.5,
      "end": 277.5,
      "text": "No one's gonna, no one really appeals to that."
    },
    {
      "start": 277.5,
      "end": 279.5,
      "text": "Next track time and money saved."
    },
    {
      "start": 279.5,
      "end": 281.5,
      "text": "This doesn't really appeal to Gen Z."
    },
    {
      "start": 281.5,
      "end": 283.5,
      "text": "I don't think Gen Z is spending money on porn."
    },
    {
      "start": 283.5,
      "end": 285.5,
      "text": "They're just like watching it for free."
    },
    {
      "start": 285.5,
      "end": 290.5,
      "text": "So this is completely missing the mark when it comes to the younger demographic."
    },
    {
      "start": 290.5,
      "end": 292.5,
      "text": "But as you can see they still have 400 ratings."
    },
    {
      "start": 292.5,
      "end": 297.5,
      "text": "So whatever niche and what sorry whatever demographic they are targeting is working."
    },
    {
      "start": 297.5,
      "end": 301.5,
      "text": "But you know the most important thing to pull from this."
    },
    {
      "start": 301.5,
      "end": 302.5,
      "text": "It doesn't feel cool."
    },
    {
      "start": 302.5,
      "end": 304.5,
      "text": "It feels like a chore."
    },
    {
      "start": 304.5,
      "end": 307.5,
      "text": "And you know no young person."
    },
    {
      "start": 307.5,
      "end": 312.5,
      "text": "You're never gonna see a young person using this for sure not."
    },
    {
      "start": 312.5,
      "end": 319.5,
      "text": "And like we'll get right into the details like the data doesn't fly."
    },
    {
      "start": 319.5,
      "end": 322.5,
      "text": "Most of our downloads come from under 18 year olds."
    },
    {
      "start": 322.5,
      "end": 325.5,
      "text": "Now sure not everyone has a credit card to pay and actually use our app."
    },
    {
      "start": 325.5,
      "end": 330.5,
      "text": "But most of the traffic comes from people that are under 18."
    },
    {
      "start": 330.5,
      "end": 333.5,
      "text": "So whatever messaging we're doing is working."
    },
    {
      "start": 333.5,
      "end": 337.5,
      "text": "And I bet if we compare the data to this and of course it's not open source so we can't confirm."
    },
    {
      "start": 337.5,
      "end": 344.5,
      "text": "But I bet no one under like 25 is downloading this."
    },
    {
      "start": 344.5,
      "end": 348.5,
      "text": "But yeah that's like the whole point with niches and brand aesthetics."
    },
    {
      "start": 348.5,
      "end": 352.5,
      "text": "Like maybe quitter won't appeal to older people because they're like what the fuck is this."
    },
    {
      "start": 352.5,
      "end": 355.5,
      "text": "I want something actually serious and tangible."
    },
    {
      "start": 355.5,
      "end": 357.5,
      "text": "This feels like an actual program."
    },
    {
      "start": 357.5,
      "end": 361.5,
      "text": "This feels like yeah like a program pretty much."
    },
    {
      "start": 361.5,
      "end": 365.5,
      "text": "Whereas this is like this feels like a game."
    },
    {
      "start": 365.5,
      "end": 370.5,
      "text": "So super important to know when it comes to brand aesthetics like understand your demographic."
    },
    {
      "start": 370.5,
      "end": 374.5,
      "text": "Understand who you are targeting because if you get the messaging wrong."
    },
    {
      "start": 374.5,
      "end": 378.5,
      "text": "You're not going to succeed in who you're targeting."
    },
    {
      "start": 378.5,
      "end": 381.5,
      "text": "But you won't target the right people."
    },
    {
      "start": 381.5,
      "end": 388.5,
      "text": "So yeah I'm going to show you how to build a brand and how I would start building a brand based on the example design."
    },
    {
      "start": 388.5,
      "end": 392.5,
      "text": "Which is a testosterone max app."
    },
    {
      "start": 392.5,
      "end": 395.5,
      "text": "Now there are obviously two ways to spend this."
    },
    {
      "start": 395.5,
      "end": 403.5,
      "text": "So I'm targeting older gym guys who are like in their 30s who take steroids that want to be super super test testosterone to the max."
    },
    {
      "start": 403.5,
      "end": 406.5,
      "text": "I never use this like so my my apologies."
    },
    {
      "start": 406.5,
      "end": 408.5,
      "text": "But they want to be tested to the max."
    },
    {
      "start": 408.5,
      "end": 410.5,
      "text": "They want to be fucking ripped."
    },
    {
      "start": 410.5,
      "end": 412.5,
      "text": "They want to be super masculine etc etc."
    },
    {
      "start": 412.5,
      "end": 415.5,
      "text": "So that is one way one demographic that we can target."
    },
    {
      "start": 415.5,
      "end": 419.5,
      "text": "The other is just young people that listen to Andrew Tate for example."
    },
    {
      "start": 419.5,
      "end": 421.5,
      "text": "And they're like oh I want to get my testosterone up."
    },
    {
      "start": 421.5,
      "end": 423.5,
      "text": "I think that would be really cool."
    },
    {
      "start": 423.5,
      "end": 425.5,
      "text": "I would attract girls."
    },
    {
      "start": 425.5,
      "end": 431.5,
      "text": "So I'm going to show you two versions of how I would build this for an older demographic and for younger demographic."
    },
    {
      "start": 431.5,
      "end": 438.5,
      "text": "So one of the core principles when it comes to younger is use things that are relatable."
    },
    {
      "start": 438.5,
      "end": 440.5,
      "text": "One of those things could be emojis."
    },
    {
      "start": 440.5,
      "end": 444.5,
      "text": "So as you can see I'm probably going to start this with an emoji."
    },
    {
      "start": 444.5,
      "end": 449.5,
      "text": "Now there are a few apps that do this."
    },
    {
      "start": 449.5,
      "end": 452.5,
      "text": "Is it super professional? No but that's the point."
    },
    {
      "start": 452.5,
      "end": 455.5,
      "text": "You're targeting a bar younger demographic."
    },
    {
      "start": 455.5,
      "end": 458.5,
      "text": "So this is it's just less important."
    },
    {
      "start": 458.5,
      "end": 462.5,
      "text": "So here's the emoji we're going to use actually make it a little bit smaller."
    },
    {
      "start": 462.5,
      "end": 466.5,
      "text": "There we go."
    },
    {
      "start": 466.5,
      "end": 475.5,
      "text": "And then I'm going to change this background to be yeah that feels or maybe like a slated gray."
    },
    {
      "start": 475.5,
      "end": 477.5,
      "text": "Pick that."
    },
    {
      "start": 477.5,
      "end": 482.5,
      "text": "And then maybe I have text saying test max."
    },
    {
      "start": 482.5,
      "end": 487.5,
      "text": "Max is a very new age word so it works for the younger demographic."
    },
    {
      "start": 487.5,
      "end": 489.5,
      "text": "And we'll just do inter that's fine."
    },
    {
      "start": 489.5,
      "end": 494.5,
      "text": "And I'll make this about 300 maybe 225."
    },
    {
      "start": 494.5,
      "end": 496.5,
      "text": "Cool."
    },
    {
      "start": 496.5,
      "end": 498.5,
      "text": "And then I'll give it a stroke."
    },
    {
      "start": 498.5,
      "end": 502.5,
      "text": "A black stroke will make it a bit larger maybe 10."
    },
    {
      "start": 502.5,
      "end": 503.5,
      "text": "There we go."
    },
    {
      "start": 503.5,
      "end": 506.5,
      "text": "We'll just make this stroke green."
    },
    {
      "start": 506.5,
      "end": 509.5,
      "text": "Or we make the text green and stroke black."
    },
    {
      "start": 509.5,
      "end": 511.5,
      "text": "Straight black."
    },
    {
      "start": 511.5,
      "end": 514.5,
      "text": "Text green."
    },
    {
      "start": 514.5,
      "end": 516.5,
      "text": "Yeah."
    },
    {
      "start": 516.5,
      "end": 517.5,
      "text": "This is honestly solid."
    },
    {
      "start": 517.5,
      "end": 524.5,
      "text": "Now of course you can say from a design standpoint this isn't very clean."
    },
    {
      "start": 524.5,
      "end": 531.5,
      "text": "But it is definitely polarizing and you need to be capturing young people's attention."
    },
    {
      "start": 531.5,
      "end": 534.5,
      "text": "So this would low key actually work."
    },
    {
      "start": 534.5,
      "end": 538.5,
      "text": "Maybe the stroke makes it look unprofessional."
    },
    {
      "start": 538.5,
      "end": 543.5,
      "text": "Maybe I just do a drop shadow instead."
    },
    {
      "start": 543.5,
      "end": 550.5,
      "text": "100."
    },
    {
      "start": 550.5,
      "end": 553.5,
      "text": "Maybe a black stroke slightly."
    },
    {
      "start": 553.5,
      "end": 555.5,
      "text": "5."
    },
    {
      "start": 555.5,
      "end": 557.5,
      "text": "Okay that low key works."
    },
    {
      "start": 557.5,
      "end": 562.5,
      "text": "So again lots super professional we can make another version of this as well."
    },
    {
      "start": 562.5,
      "end": 568.5,
      "text": "Probably without chart as the main."
    },
    {
      "start": 568.5,
      "end": 574.5,
      "text": "We'll center this make it about 350."
    },
    {
      "start": 574.5,
      "end": 583.5,
      "text": "And then the spacing between I believe that is this way."
    },
    {
      "start": 583.5,
      "end": 585.5,
      "text": "Minus 50."
    },
    {
      "start": 585.5,
      "end": 586.5,
      "text": "Oh shit."
    },
    {
      "start": 586.5,
      "end": 593.5,
      "text": "What about vertical scaling though?"
    },
    {
      "start": 593.5,
      "end": 595.5,
      "text": "You know what is fine I guess for now."
    },
    {
      "start": 595.5,
      "end": 598.5,
      "text": "I don't know how to use thing that well."
    },
    {
      "start": 598.5,
      "end": 603.5,
      "text": "But this could work."
    },
    {
      "start": 603.5,
      "end": 612.5,
      "text": "As a younger demographic or for a younger demographic this could totally, totally work."
    },
    {
      "start": 612.5,
      "end": 636.5,
      "text": "It seems really stupid but you get the vibe I'm trying to go for."
    },
    {
      "start": 636.5,
      "end": 642.5,
      "text": "Now let me show you how to build a very serious older demographic."
    },
    {
      "start": 642.5,
      "end": 650.5,
      "text": "Oh okay let me show you how to build a brine aesthetic for an older demographic based on the same app idea."
    },
    {
      "start": 650.5,
      "end": 654.5,
      "text": "So this is going to be feeling a little bit more professional."
    },
    {
      "start": 654.5,
      "end": 658.5,
      "text": "And maybe we get like a syringe or some all test."
    },
    {
      "start": 658.5,
      "end": 663.5,
      "text": "Like something like I can't have emojis can I?"
    },
    {
      "start": 667.5,
      "end": 672.5,
      "text": "I also wouldn't put text in."
    },
    {
      "start": 672.5,
      "end": 675.5,
      "text": "Let me think."
    },
    {
      "start": 675.5,
      "end": 686.5,
      "text": "Yeah like I would probably do something like this."
    },
    {
      "start": 686.5,
      "end": 694.5,
      "text": "Honestly."
    },
    {
      "start": 694.5,
      "end": 696.5,
      "text": "This feels more legit."
    },
    {
      "start": 696.5,
      "end": 703.5,
      "text": "All the older guys will know exactly what this means."
    },
    {
      "start": 703.5,
      "end": 711.5,
      "text": "So we'll just make this a bit smaller."
    },
    {
      "start": 711.5,
      "end": 725.5,
      "text": "Maybe just TM."
    },
    {
      "start": 725.5,
      "end": 726.5,
      "text": "Alright."
    },
    {
      "start": 726.5,
      "end": 729.5,
      "text": "And that's in the center."
    },
    {
      "start": 729.5,
      "end": 734.5,
      "text": "And then we'll just lower the opacity of this by like 50%."
    },
    {
      "start": 734.5,
      "end": 741.5,
      "text": "Maybe even more."
    },
    {
      "start": 741.5,
      "end": 743.5,
      "text": "There we go."
    },
    {
      "start": 743.5,
      "end": 752.5,
      "text": "Loki this feels more professional and this feels more like a school project."
    },
    {
      "start": 752.5,
      "end": 767.5,
      "text": "And that's how I would design the TM."
    },
    {
      "start": 767.5,
      "end": 776.5,
      "text": "Alright everyone so now I'm going to show you how I would design the brine aesthetics for the two different demographics of the test, austro and maxing app."
    },
    {
      "start": 776.5,
      "end": 784.5,
      "text": "So I already started this a little bit but for the older demographic we wanted to film a professional and more serious and more like get shit done."
    },
    {
      "start": 784.5,
      "end": 795.5,
      "text": "Because that's like these older guys motto is like I'm fueled with testosterone, I'm jacked, I'm rips, I'm massive, I'm scary and I want to scare you in the process."
    },
    {
      "start": 795.5,
      "end": 804.5,
      "text": "So all of these massive fonts and like like bolded text and all caps very intentional."
    },
    {
      "start": 804.5,
      "end": 811.5,
      "text": "It literally appeals to that demographic so much that that like okay holy shit like this is for me."
    },
    {
      "start": 811.5,
      "end": 825.5,
      "text": "Even the app icon like it isn't that engaging but if you know you know and these big testosterone heads they know that this symbol behind signifies testosterone."
    },
    {
      "start": 825.5,
      "end": 832.5,
      "text": "So they're like okay whoever made this up knows what they're doing and this feels again very serious and very legit."
    },
    {
      "start": 832.5,
      "end": 839.5,
      "text": "Whereas like if we want to target a younger demographic maybe they're not they don't really care as much but they want to test it out and they want to do it in a fun way."
    },
    {
      "start": 839.5,
      "end": 842.5,
      "text": "They don't want to destroy the competition like we say here."
    },
    {
      "start": 842.5,
      "end": 851.5,
      "text": "They maybe you want to subtly increase the testosterone playing if you're not playing if you're games but like they want to increase their testosterone in a gamified way."
    },
    {
      "start": 851.5,
      "end": 855.5,
      "text": "They want to have fun like the young people at the end of the day they don't want to go all in."
    },
    {
      "start": 855.5,
      "end": 865.5,
      "text": "So for the younger demographic we choose emojis and this is because emojis are very relatable and yeah young people use them a lot."
    },
    {
      "start": 865.5,
      "end": 873.5,
      "text": "So it makes sense to leverage that kind of cultural significance within our app icon and our branding."
    },
    {
      "start": 873.5,
      "end": 876.5,
      "text": "So look at the look at the difference here."
    },
    {
      "start": 876.5,
      "end": 888.5,
      "text": "Test max become manually. It's way more passive it's way more you know it's easier to be a part of and then the line is like get jacked with easy steps."
    },
    {
      "start": 888.5,
      "end": 892.5,
      "text": "Young people want to cut corners they don't really want to go all in."
    },
    {
      "start": 892.5,
      "end": 898.5,
      "text": "So this makes more sense to them and a gamified way to increase testosterone."
    },
    {
      "start": 898.5,
      "end": 902.5,
      "text": "Again super super passive but it also explains what the app does."
    },
    {
      "start": 902.5,
      "end": 908.5,
      "text": "So young people will be like okay you know this I see the emoji I see the green font."
    },
    {
      "start": 908.5,
      "end": 913.5,
      "text": "This seems like everything I want to achieve out of getting testosterone I'm going to try it."
    },
    {
      "start": 913.5,
      "end": 923.5,
      "text": "Whereas like if I was an old guy and I saw this I'd be like okay like I bought too much fucking testosterone to wait around and get jacked of easy steps."
    },
    {
      "start": 923.5,
      "end": 930.5,
      "text": "I want to go fucking hard. So when they read this become the ultimate you destroy the competition."
    },
    {
      "start": 930.5,
      "end": 933.5,
      "text": "This is the one they will download and this is the one they'll pay for."
    },
    {
      "start": 933.5,
      "end": 939.5,
      "text": "This feels like a school project but low key if you are targeting a young demographic that's what you want."
    },
    {
      "start": 939.5,
      "end": 947.5,
      "text": "Of course this is a little bit difficult because we're talking about testosterone maxing out and like our young people super interested in that."
    },
    {
      "start": 947.5,
      "end": 957.5,
      "text": "Not sure if this was a social app again this would be really easy to sell to with the emojis and big fonts etc."
    },
    {
      "start": 957.5,
      "end": 967.5,
      "text": "So a thing to note is..."
    },
    {
      "start": 967.5,
      "end": 985.5,
      "text": "So just to reiterate the most important thing about brand is how much you appeal to whatever demographic you're targeting."
    },
    {
      "start": 985.5,
      "end": 989.5,
      "text": "And so you need to get these things right."
    },
    {
      "start": 989.5,
      "end": 1001.5,
      "text": "And my best advice when it comes to designing a brand and designing a product that you end up selling and making money from and building a brand from is just be the consumer yourself."
    },
    {
      "start": 1001.5,
      "end": 1012.5,
      "text": "For example, Zach, well actually I'm going to use me as an example but I don't want to say it's not like I'm fucking joker every day I'm just saying like I'm going to use me as an example."
    },
    {
      "start": 1012.5,
      "end": 1018.5,
      "text": "I went down self-improvement and you know quitting porn is a part of that."
    },
    {
      "start": 1018.5,
      "end": 1032.5,
      "text": "The reason it's so difficult in self-improvement is because it's so accessible the algorithms are filled with this like soft core porn material because that gets the most engagement."
    },
    {
      "start": 1032.5,
      "end": 1038.5,
      "text": "And so anyone that's trying to quit kind of just battles of themselves there's no like real good solution."
    },
    {
      "start": 1038.5,
      "end": 1043.5,
      "text": "So I was like okay what if I made it fun I made it cutting edge and I made it cool to actually begin quitting."
    },
    {
      "start": 1043.5,
      "end": 1053.5,
      "text": "So I was that person so I knew exactly what I would pay for and what I would use so I just built it."
    },
    {
      "start": 1053.5,
      "end": 1062.5,
      "text": "Now of course this isn't like super tangible advice because you could be the demographic and it could still like the brand said it could still suck."
    },
    {
      "start": 1062.5,
      "end": 1082.5,
      "text": "But the most important things to know are if it's for younger people just try and make it a bit more cool and a little bit more relaxed and laid back and if it's for older people kind of just make it seem more professional more serious and more more like a program."
    },
    {
      "start": 1082.5,
      "end": 1089.5,
      "text": "And it could be more boring as well."
    },
    {
      "start": 1089.5,
      "end": 1095.5,
      "text": "And so yeah another big advice."
    },
    {
      "start": 1095.5,
      "end": 1106.5,
      "text": "And you know what I'll close this by saying anything you do when it comes to your color scheme your font sizes and your language don't switch it up at all throughout your app."
    },
    {
      "start": 1106.5,
      "end": 1111.5,
      "text": "Make sure your brand is cohesive and this representing itself in almost everything you do."
    },
    {
      "start": 1111.5,
      "end": 1116.5,
      "text": "As soon as you start mixing fonts together you lose that brand aura."
    },
    {
      "start": 1116.5,
      "end": 1123.5,
      "text": "Now it is fine if the font isn't completely the same like maybe I want to do this Canada."
    },
    {
      "start": 1123.5,
      "end": 1130.5,
      "text": "I think this is low key fine but any more than three different fonts it won't work."
    },
    {
      "start": 1130.5,
      "end": 1133.5,
      "text": "It just feels sloppy."
    },
    {
      "start": 1133.5,
      "end": 1140.5,
      "text": "And brands gain respect because you feel the time the dedication the messaging throughout it."
    },
    {
      "start": 1140.5,
      "end": 1148.5,
      "text": "Quitter is such a strong brand because we've been here around for a year we've put a bunch of cool stunts or on a mission to take down the point industry."
    },
    {
      "start": 1148.5,
      "end": 1154.5,
      "text": "The UI is super fucking clean the app works really well and that's how we bought our brand."
    },
    {
      "start": 1154.5,
      "end": 1167.5,
      "text": "And if we started using these brand of different colors and like didn't represent the brand as true to itself and always try to do different shit and it's hard to explain what I mean by that."
    },
    {
      "start": 1167.5,
      "end": 1172.5,
      "text": "But stick to your core messaging and don't switch it up."
    },
    {
      "start": 1172.5,
      "end": 1177.5,
      "text": "Actually I can give a great example and this is so off topic but it kind of works."
    },
    {
      "start": 1177.5,
      "end": 1179.5,
      "text": "This is my profile picture."
    },
    {
      "start": 1179.5,
      "end": 1183.5,
      "text": "It's me looking up the sky blue background from a year ago."
    },
    {
      "start": 1183.5,
      "end": 1191.5,
      "text": "This is bought a brand. I bought a brand in myself by repping this profile picture."
    },
    {
      "start": 1191.5,
      "end": 1196.5,
      "text": "As soon as I change my profile picture I'm going to need to build my brand again."
    },
    {
      "start": 1196.5,
      "end": 1207.5,
      "text": "Now of course it's going to be easier because I'm using the Alex later name but it's generally generally a bad strategy to switch up branding."
    },
    {
      "start": 1207.5,
      "end": 1212.5,
      "text": "And like even Quitter Quitter's logo has not changed since the beginning."
    },
    {
      "start": 1212.5,
      "end": 1224.5,
      "text": "And so one of my greatest advice is just stick to what you have as long as you're happy with it of course and keep growing that."
    },
    {
      "start": 1224.5,
      "end": 1226.5,
      "text": "Don't change things around."
    },
    {
      "start": 1226.5,
      "end": 1236.5,
      "text": "You can change the app source screen shots they aren't really that important but the language, the fonts, the logo try to keep that uniform for everything you do."
    },
    {
      "start": 1237.5,
      "end": 1245.5,
      "text": "And so like if I went into this app maybe I would copy the font that I just used from my super serious version."
    },
    {
      "start": 1245.5,
      "end": 1247.5,
      "text": "So what font is this?"
    },
    {
      "start": 1247.5,
      "end": 1248.5,
      "text": "Can it."
    },
    {
      "start": 1248.5,
      "end": 1252.5,
      "text": "So go into this and instead of in sir we use can it."
    },
    {
      "start": 1252.5,
      "end": 1255.5,
      "text": "There you go. Maybe we want to make this all caps."
    },
    {
      "start": 1255.5,
      "end": 1257.5,
      "text": "Facial analysis."
    },
    {
      "start": 1257.5,
      "end": 1258.5,
      "text": "There we go."
    },
    {
      "start": 1258.5,
      "end": 1261.5,
      "text": "And then we'll have the logo TM."
    },
    {
      "start": 1261.5,
      "end": 1263.5,
      "text": "We'll copy this."
    },
    {
      "start": 1264.5,
      "end": 1266.5,
      "text": "TM or test dough."
    },
    {
      "start": 1269.5,
      "end": 1274.5,
      "text": "Or maybe we want this to be the kind of one which also works."
    },
    {
      "start": 1274.5,
      "end": 1279.5,
      "text": "So having a different font for the logo and a different font for the test for the text works well too."
    },
    {
      "start": 1279.5,
      "end": 1283.5,
      "text": "We see this with Instagram, we see this with Twitter etc etc."
    },
    {
      "start": 1283.5,
      "end": 1286.5,
      "text": "And that's how you build a brand."
    },
    {
      "start": 1286.5,
      "end": 1289.5,
      "text": "101 how you build a brand."
    },
    {
      "start": 1290.5,
      "end": 1291.5,
      "text": "But yeah."
    },
    {
      "start": 1292.5,
      "end": 1295.5,
      "text": "I'm going to move this down a copy just so you guys are aware."
    },
    {
      "start": 1300.5,
      "end": 1301.5,
      "text": "But yeah."
    },
    {
      "start": 1301.5,
      "end": 1302.5,
      "text": "Peace out boys."
    }
  ]
}