{
  "file_name": "020_Lesson_20.faudio-hi-0-Default.mp4",
  "text": " Hey everyone, welcome to the Art Mafia development module. My name is Alex Slater. I'm the founder and lead developer of Quitter. Quitter does half a million dollars in revenue a month and has done about two and a half million dollars in its total lifespan. I have a lot of a lot of information to share about building products specifically because they wasted years and I mean like two years building the perfect app that never launched and never got traction and never went anywhere. Whereas with Quitter on the other hand, I spent a week, two weeks building it, got instant validation and that just kind of parlayed into momentum that got us to this point today. So the goal of this module is to share how to build a successful app. We'll be running through how to rebuild UMACS from scratch, which was one of Blake Anderson's most successful first apps. So we'll go for the entire tutorial and how to skip a lot of the wasted time that I spent. So you don't have to spend that wasted time yourself. And by the end of this module, ideally you will have an app that is ready to be sold and you can go into the distribution module that comes right after this and start making money. So yeah, let's get started.",
  "language": "en",
  "segments": [
    {
      "start": 0.0,
      "end": 5.32,
      "text": "Hey everyone, welcome to the Art Mafia development module. My name is Alex Slater."
    },
    {
      "start": 5.32,
      "end": 10.44,
      "text": "I'm the founder and lead developer of Quitter. Quitter does half a million dollars in revenue"
    },
    {
      "start": 10.44,
      "end": 16.56,
      "text": "a month and has done about two and a half million dollars in its total lifespan. I have a lot"
    },
    {
      "start": 16.56,
      "end": 22.2,
      "text": "of a lot of information to share about building products specifically because they wasted years"
    },
    {
      "start": 22.2,
      "end": 29.400000000000002,
      "text": "and I mean like two years building the perfect app that never launched and never got traction"
    },
    {
      "start": 29.4,
      "end": 34.08,
      "text": "and never went anywhere. Whereas with Quitter on the other hand, I spent a week, two weeks"
    },
    {
      "start": 34.08,
      "end": 40.04,
      "text": "building it, got instant validation and that just kind of parlayed into momentum that got us to"
    },
    {
      "start": 40.04,
      "end": 46.8,
      "text": "this point today. So the goal of this module is to share how to build a successful app. We'll be"
    },
    {
      "start": 46.8,
      "end": 51.8,
      "text": "running through how to rebuild UMACS from scratch, which was one of Blake Anderson's most successful"
    },
    {
      "start": 51.8,
      "end": 57.480000000000004,
      "text": "first apps. So we'll go for the entire tutorial and how to skip a lot of the wasted time that I"
    },
    {
      "start": 57.48,
      "end": 63.16,
      "text": "spent. So you don't have to spend that wasted time yourself. And by the end of this module,"
    },
    {
      "start": 63.16,
      "end": 69.32,
      "text": "ideally you will have an app that is ready to be sold and you can go into the distribution module"
    },
    {
      "start": 69.32,
      "end": 74.52,
      "text": "that comes right after this and start making money. So yeah, let's get started."
    }
  ]
}